{
  "posts": [
    {
      "id": "t3_13sx2du",
      "title": "[NEED ADVICE] need to learn real discipline especially without medication. Need to rewire my brain",
      "body": "I really feel like a complete failure. I Can’t handle it. I was diagnosed with adhd and binge eating disorder. I take vyvanse 5 days a week. My issue is, even when I do take my vyvanse I’m not as productive as I’d like to be. I take two days off so the vyvanse can keep working. On those days off, I eat so much. I’m just so disappointed in my self. It’s hard to drink water. I’m lethargic on my days off. I only work out on the days I take vyvanse. I’m trying to learn to trade but I need to be more focused and put my time into it. My diet is shit. I’m tired. I need to know how to do things at least decent without my medication and I need to utilize my time and be more productive when I do take my medication. Food makes me feel like shit. I’m just mad at life. I’m not depressed I’m just disappointed. I’m a ball full of energy. I’m an attractive lady. I am in college part time I have a job I have a car I have a plan. I am not dirty. But I am unorganized. I am reasonable and realistic and I think about my future a lot and my future responsibilities towards my future family. I take care of my body , skin, shower, teeth, but I suck at eating well and I suck at drinking water so my body feels like shit. But I’m just doing so bad. My binge eating ruins me. I’m a caffeine addict. I don’t know how I will function without my meds when I’m pregnant without wanting to kill myself from all the binge eating and laziness I will become and I will hate my body. I am 22 years old haven’t even gotten my associates degree yet.How do I just reset my stupid brain? From food And phone and simple easy dopamine pleasures like sugar and food and my phone. How do I have energy? How do I get motivated ? How do I stay focused and not side tracked? How do I reset my brain to be able to handle boringness and discipline? Discipline is doing what u don’t wanna do. I’m not disciplined. How do I rewire my brain to be able to handle discipline? And how do I stay focused and get back on track if I fall off? I feel hopeless but I care so much. I don’t feel good . I would feel so guilty being a horrible wife and mother who can’t take take of her family and her self. Like I just want to be able to have ups and downs but consistently be disciplined in all areas of life and just deal with the pain and boringness of it until I get used to being disciplined. HOW do I do this? I’mTired of going in circles :/ I have so much wrong with me but I wanna fix it",
      "comments": {
        "best_comment": "Re: the meds part, why?  Genuine question, as a reliant Vyvanse taker myself.You wouldn't expect a diabetic to just learn to live without insulin, or a paraplegic to suddenly get up out of their wheelchair and start walking.  So what's wrong with taking Vyvanse to correct the chemical imbalances in your brain?That's how my psychiatrist justified it to me at least though, lol",
        "percentile_10_comment": "Main thing you need to focus on is getting rid of caffeine.  Your body becomes extremely dependent on it.  That’s why you feel like you have no energy.  It’s hard to cut caffeine addiction but trust me it’s worth it.",
        "comment_o3": "I’ve been in a similar loop with ADHD meds, caffeine, lousy food, and guilt, so here’s what’s actually helped me crawl out of the spiral and get some real traction.Treat the medicated and un‑medicated days as two different “modes” with their own expectations. On Vyvanse days aim for the heavy cognitive stuff (studying, trading practice, paperwork) and block it in short “work sprints”—25 minutes of focus, 5 minutes off, three rounds, then a longer break. Put just three must‑do items on the schedule; finishing them earns you a win, everything else is extra credit. On off‑days switch the goal to recovery and low‑bandwidth habits: meal‑prep, laundry, a walk, stretching, refilling your water bottle every time you open the fridge. When the bar is realistic you stop burning willpower on beating yourself up.Food: decide it once, not three times a day. Sunday evening plan five simple, repeatable meals you don’t hate (e.g., overnight oats, rotisserie‑chicken salad kits, frozen veg + rice + sauce). Prep or portion them right away so “what should I eat?” never becomes a question. Store junk food somewhere you’d have to leave the house to get—future‑you rarely wants to put on shoes just for Oreos. For water, tie it to something you already do: every bathroom break = 8 oz, every coffee = finish a full bottle first. If plain water is painful, add zero‑calorie flavor drops or go bubbly.Movement: 10‑minute micro‑workouts beat zero‑minute perfect workouts. Bodyweight circuits, YouTube yoga, or a brisk walk around the block keep the streak alive on lethargic days and blunt the urge to binge. Momentum matters more than intensity.Phones and dopamine: put your most distracting apps in a folder called “Later” on the last screen, turn on grayscale after 9 p.m., and leave the charger across the room so grabbing the phone is an active choice. When the itch hits, set a 10‑minute timer—if you still want to scroll after it rings, go ahead; half the time the urge passes.Plan for the inevitable crash days: write a short rescue checklist (“drink water, shower, 10‑min walk, text a friend”) and tape it where you’ll see it first thing. Following it keeps a bad day from becoming a bad week.Finally, don’t confuse discipline with punishment. You’re not broken; your brain just needs clearer systems than most people’s. Nail one small ritual at a time, celebrate it, then stack the next one on top. Six months of that beats any heroic Monday‑morning overhaul. You already care enough to ask for help—that’s the hardest part. Now give yourself permission to improve in boring, unsexy, relentlessly consistent steps. It works.",
        "comment_gpt4dot1": "First off, you’re not a failure—seriously. You’re juggling a lot, and the fact that you’re self-aware and want to change is a huge step. Discipline isn’t about being perfect or never slipping up; it’s about building systems that help you get back on track when you do. For ADHD and binge eating, it’s extra tough because your brain is wired to chase quick rewards, so you have to outsmart it a bit.Start small. Don’t try to overhaul everything at once. Pick one thing—like drinking more water or eating a better breakfast—and make it your main focus for a week or two. Set reminders on your phone, put a water bottle where you’ll see it, whatever helps. Once that feels more automatic, add something else. For binge eating, try to notice your triggers and swap in a different activity (even just stepping outside or texting a friend) before you eat. It won’t be perfect, but every time you interrupt the cycle, you’re making progress.On days off meds, expect to feel off, but don’t beat yourself up. Plan for lower energy: maybe do a short walk instead of a full workout, or set a timer for 10 minutes of focused work. Even a little bit counts. For focus, try the Pomodoro method (25 minutes on, 5 off) and keep your phone in another room. Motivation comes and goes, but discipline is about showing up even when you don’t feel like it. The more you practice, the easier it gets.If you fall off, just restart. Don’t wait for a new week or month—just pick up where you left off. Progress isn’t linear, and nobody is disciplined 100% of the time. You’re already doing a lot right, so give yourself some credit. Keep showing up, keep tweaking your systems, and over time you’ll build the habits you want. You got this."
      }
    },
    {
      "id": "t3_ydi7ga",
      "title": "[Need Advice] How do I fix my life",
      "body": "I don't really have any friends. I have nojob. The only thing going for me is that I'm not ugliest guy in the world and im in ok shape physically. My parents are also old but still alive and we talk occasionally which im grateful for in a lot of ways but feel like once they are gone I'll have absolutely no support system.  I have a bit of savings as well which is helping me get by but life feels confusing and difficult at times. I also feel old because I'm 31 and I don't have any parts of my life figured out at all. I lost all my relationships in 20s because I was depressed from making stupid decisions snd feeling confused about life. I was also ghosted by a girl recently who was pretty attractive but didn't want to put up with my shit apparently. I think she only wanted sex anyways which is a strange thing to say and im kind of over that part of my life... or she just thought i was a loser. She wouldn't really say other than she didn't want anything serious and I was too serious...I wish felt like I was making a difference in people's lives even though I feel lost. Fitness is what I do currently but outside of that I don't very many other positive habits or routines . At times I feel like I'm crazy cause I can be somewhat miserable on more than one occasion and can't interact very well with other people. People are fed up for good reason. I dont have a life",
      "comments": {
        "best_comment": "if you're good at physical training and like to help people, learn to be a fitness instructor and help ppl that way",
        "percentile_10_comment": "It is never too late to start as long as you move in the right direction. A 10 or 100 small steps in the right direction  will still be 10 or 100 steps better then where you were before.Having said that, make a list of things or goals in major areas of your life physically, mentally, emotionally, financially, spiritually. Break these into  20 small actionable steps.E.g Physical goal: Want to get fit? Get up an hour early. Go for a walk, excercise or jog everyday for 30 minutes. Avoid junk food. Eat healthy. If you can do this for a month consistently, you would have done 15 hours of exercise and had an improved diet. Over a long term these add up and count.List down similarly what you can do. In terms if finances, try getting a job. Create a resume. Update it to all job portals. Look an hour for all jobs available and apply. Ask friends for job openings.... you will land something.Try going to mall or retail outlets and look for or ask for job. Everyday have a sense of accomplishment. Try saving one dollar a day, and put it in a jar where it is visible to you....Join a library and read 2-3 pages of a book you like.Listen to uplifting music.Avoid wasting time.Cut negative thinking and be friends and supportive to your self. Everyday try to encourage yourself and do better and be in a better place than yesterday. Remember every step ahead is progress. Believe in yourself. Change your mindset for a better you. I may not know you, but believe in you. Because you took the effort to write and get better. You can do it bro.",
        "comment_o3": "You’re actually sitting on some decent raw materials: decent health, some savings, living parents you still talk to, and a clear sense that what you’re doing now isn’t working. That’s enough to start making deliberate moves instead of drifting. Try treating the next twelve months like a personal turnaround plan with three pillars—income, structure, and community.Income first. Turn job‑hunting into a daily habit, not a mood‑based activity. Pick a set time each weekday (say 9‑11am) where the phone goes on airplane mode and you do one thing that moves the ball: tweak the résumé, send applications, follow up on an old lead, or take an online micro‑course that upgrades a line on your CV. Track it on paper so you can literally see the streak build. Momentum here will reduce a lot of the background anxiety you’ve got about the future.Structure next. You already work out; expand that into a simple morning routine that starts the day on rails: wake at the same time, drink water, make the bed, 15‑minute walk, then your workout. Lay clothes out the night before so there’s zero decision fatigue. When the routine becomes automatic you free up willpower for bigger goals.Community last, but crucial. Isolation makes everything else harder. The fastest, cheapest way to get around people who won’t ghost you is volunteering. Animal shelters, food banks, park cleanups—pick something that takes two or three hours a week. You’ll add structure, meet people who value contribution over social polish, and you may stumble into job leads. If you enjoy fitness, consider a group class or even studying for a personal‑trainer cert; that turns an existing interest into a social and possibly paid activity.Expect awkwardness at first. Do it anyway, log it, and see how you feel after thirty days. If emotions stay rough, add a therapist to the mix; savings are well spent on getting your mind running clean.The short version: one disciplined job‑search block a day, one locked‑in morning routine, one weekly commitment that puts you around other humans. Keep those promises to yourself for a quarter and your life will look noticeably different—maybe not “fixed,” but moving, and that’s what counts. Good luck, man; twelve months of consistent basics can erase a lot of messy years.",
        "comment_gpt4dot1": "First off, you’re not alone in feeling lost at 31—plenty of people are still figuring things out, and it’s not too late to make changes. The fact that you’re physically active is a solid foundation, so give yourself credit for that. If you want to start building a life you’re proud of, try focusing on small, consistent actions. For example, set a simple daily routine: wake up at the same time, get some sunlight, do your fitness thing, and add one new habit (like reading for 10 minutes, journaling, or applying to one job a day). Don’t worry about making friends or finding a relationship right away—those things tend to come when you’re working on yourself and putting yourself out there, even in small ways. Volunteering or joining a local club can help you meet people and feel like you’re making a difference, even if it’s just a couple hours a week. Progress is slow and sometimes boring, but if you stick with the basics and keep showing up, things will start to shift. You don’t have to fix everything at once—just pick one thing to improve and build from there."
      }
    },
    {
      "id": "t3_rbpiq9",
      "title": "[Need Advice] I chicken out when the pressure increases",
      "body": "All my life will be sunshine and rainbows if I pass this one exam and I have been preparing for entire year with ups and downs(mostly downs) but when the date comes close , I give up and don’t try too hard because deep down I believe that I can’t fail and that’s why I don’t even try because it might result in failure.Exam’s just a month far and all these past few days I’ve done is look for online dates and singles in my area.Watched porn and fapped all day, all to avoid studying.Even when I study , I take too many breaks.And when I don’t take break, I fantasize about BS and what if’s .And in the end, I get scared thinking about the outcomes. And so I avoid it all together .I let myself get distracted from even slightest of distractions.And just so you know how important this exam is,See, if I pass this exam, I’ll get admitted into the Top 100 Universities on earth. And with that my road to MIT will be clear. By passing this exam, there’s roughly about 60% chance of me getting admission into MIT ( The best in the whole world )It’s all looking like a dream now , Back then, it was a definite possibility, but now it’s slowly turning into dream. Ofcourse, it’s not still a dream and I’ll keep working on it till I get old and can’t work . But see, I am not working hard enough. Guide me .",
      "comments": {
        "best_comment": "The more the world means to you, the more you'll stay stagnant & frozen up. The more you'll stay miserable.One exam can't decide one's fate in life, nor can it certify you as some genius or a fool.If that self inflicted pressure is negated, through clarity of the fact that you want it because either your neighbor wants it or you have the ego to prove your mettle, then everything including the prep for some exam becomes an interesting game.Ofc all these are advice from someone who's a slacker & a coward, like most of us. But I know you can have a glimpse of what's real after reading & understanding what I have to say. You contemplate over that glimpse or faint feeling, stretch it out as much as you can. Write & contemplate. You'll soon find what you're looking for. And that's not MIT, although chances of getting into it will increase.",
        "percentile_10_comment": "\\>  I give up and don’t try too hard because deep down I believe that I can’t fail and that’s why I don’t even try because it might result in failure.What would happen if you failed the exam?",
        "comment_o3": "You’re not dealing with laziness, you’re dealing with fear masquerading as “I’ll do it later.” That fear shrinks when the next move is tiny and time‑boxed. Set a 25‑minute timer, pick one specific chunk (one concept, 10 questions, whatever), and do absolutely nothing else until time’s up. Stand, stretch five minutes, repeat. Six of those blocks is only 3 hours but it’s real, focused work. You’ll feel momentum after the first one, so make it the day’s first task before breakfast.Make failure harder than studying. Delete dating apps, install a blocker like Cold Turkey that locks porn and social media during your study windows, and hand the password to a friend or sibling until test day. Put your phone in another room; no one needs “just a quick scroll” during a 25‑minute sprint.Front‑load your schedule. Willpower fades, so carve out your biggest study session early. Map the remaining syllabus: chapters, problem sets, mock exams. Divide by the days left so you know today’s non‑negotiable quota. Cross it off a paper chart; watching the boxes fill calms the what‑ifs more than any pep talk.End each night with a shutdown ritual: tidy the desk, write tomorrow’s first task on a sticky note, then let yourself relax guilt‑free. This keeps burnout—and the escape into porn or fantasy—from building.Four focused hours a day for the next month will put you ahead of most test‑takers and give you a real shot at that top‑100 university. The exam is a puzzle, not a verdict on your worth. Show up, solve what you can, and let the score sort itself out. Now open the timer and start block one.",
        "comment_gpt4dot1": "Honestly, this is a super common cycle, especially when the stakes are high. The pressure makes your brain want to run away from the thing that matters most, so it latches onto easy distractions. The key is to break the all-or-nothing mindset. You don’t have to study perfectly or for hours at a stretch—just focus on showing up for a set, realistic amount of time each day, even if it’s just 30 minutes at first. Set a timer, put your phone in another room, and commit to that block. When you catch yourself drifting or fantasizing, gently bring your focus back—don’t beat yourself up, just refocus. Also, try to make your environment boring for distractions: block the sites, uninstall the apps, and make it a little harder to slip into old habits. Remember, you don’t have to feel motivated or confident to do the work; you just have to do it anyway, even if it feels pointless or scary. The more you show up, the more you’ll build trust in yourself. You’ve got a month—start small, be consistent, and let the results take care of themselves."
      }
    },
    {
      "id": "t3_vv187j",
      "title": "[Need advice] How do I reward myself after accomplishing a small goal I set to better myself?",
      "body": "",
      "comments": {
        "best_comment": "Try this tip. Every time when my salary is in, I allocate $100 to a separate savings account. This is the bonus I will receiveto spend however I want if i complete a certain mission, if I don't then it rolls over to the next month. Essentially you are setting time aside to work on yourself, to pay yourself.",
        "percentile_10_comment": "A man by the name of Andrew D. Huberman who is a Neuroscientist at the Standford school of medicine has a great podcast about this topic of creating goals, achieving goals, and how to reward/punish yourself according to those goals for the most productive results. I’ll try and find the episode title and number and edit it into this response.[The Science of setting and achieving goals.](https://open.spotify.com/episode/6cO0BC9EEedrKhxQtjuo80?si=-cobxXi_Q-yNMRMs9AgIUw)",
        "comment_o3": "Think of rewards as fuel, not dessert. They should refill your motivation tank without undoing the progress you just made. First decide on a reward budget—a short list of simple, low‑cost things that make you happy but aren’t so indulgent that they derail you. A fancy coffee, an episode of a favorite show, 15 guilt‑free minutes on a game, or a walk in a park all work. Tie each reward to a specific action (e.g., “When I finish my workout, I get my latte”) and cash it in immediately after the task so your brain links success with the treat. Keep the size of the reward proportional to the task: small goal, small reward; big milestone, bigger reward like a night out or new gear related to your habit. Finally, track your streaks—just seeing the chain grow on a calendar or app becomes its own form of reward, and it costs nothing. Test a few ideas, note what actually leaves you refreshed, and adjust your reward menu over time.",
        "comment_gpt4dot1": "Great question! Rewarding yourself for hitting small goals is a solid way to reinforce good habits. The key is to pick rewards that don’t undo your progress or distract you from your bigger goals. For example, after finishing a task, you could take a short break to do something you enjoy—like watching a quick YouTube video, having a favorite snack (in moderation), or spending a few minutes on a hobby. Some people like to keep a checklist or journal and give themselves a gold star or sticker for each win, which can be surprisingly motivating. Over time, you might find that the sense of accomplishment itself becomes its own reward, but there’s nothing wrong with a little positive reinforcement along the way. Just make sure the reward fits the effort, and you’ll keep building momentum!"
      }
    },
    {
      "id": "t3_13nhprw",
      "title": "[Need advice] I need to learn how to control and suppress emotions and feelings",
      "body": "When I (30s M) have feelings, whether it be love, betrayal, happiness, sadness, etc, I feel it deeply, to the point my emotions affect my thought and decision making processes. My emotional response to what would be the logical actions to take prevents me from making what deep down I know would probably be the best decision, but my feelings and emotions focus on the hope of what I desire, instead of looking at the reality of what I actually receive. Now I'm at the point where I'm losing myself because of how confused and distraught I have allowed myself to become due to inaction one way or the other. How can I check my emotions to be able to think clearly and logically in order to be able to make the best decisions for myself? Any and all advice is appreciated.",
      "comments": {
        "best_comment": "I'm not a therapist but I don't think you need to suppress your emotions, that will only make things worse. I think a better approach would be to process the emotions. You can even set up a time and date in your calendar to process those feelings, as if it were a meeting or appointment, that way you show up.The advice given by others is good but I'd like to add some that I haven't seen mentioned:1. Use the voice recorder on your phone and just talk, cry, whatever you need to. Talk to yourself or pretend you're talking to someone and let all the emotions out. Then after you can even try listening to the audio pretending you're listening to a friend venting since we tend to be harsher on ourselves but when it comes to others, we can be more patient and less judgmental. Then ask questions. Whether it's questions to fix the problem or questions that help you get to the root of things to try to heal on your own. (why do you feel this way, when was the last time you felt like this, where might this come from? Is there a pattern?, etc...it all depends on whether you want to brainstorm on how to fix a problem or if you wanna go back in your past and try to understand the why so then you give yourself some slack and actively start working on what you can control to change your situation)That's what I do sometimes and it works. Just talking or recording yourself. Again, I'm no therapist. I'm just sharing what has worked for me.2. Sometimes I also try to pretend I'm my own daughter. No, I'm not a mother but I believe all humans want the best for their offspring, even if it's hypothetical ones. So, if you were your own daughter/son, as a parent, what would you think is best for your child? Do that.3. Meditation as well is very helpful. Set an intent before you meditate, state the question you want answered and then clear your mind and focus on your breathing. Your brain usually comes up with an answer during the meditation session or you stumble upon one days later. That also works for me.Good luck!",
        "percentile_10_comment": "Try journalling. Write or talk to someone about it, don't suppress it, it will just bottle up and that's not good. Writing things helps me see it as it is and not with emotions but with logic and rationale.",
        "comment_o3": "I used to think the answer was to shut feelings down, but that’s like trying to hold a beach ball underwater—it works until it doesn’t. The trick is separating the moment you feel an emotion from the moment you act on it. One simple way is the “pause and label” habit: when something hits you, name the emotion out loud or in writing (“that’s anger,” “that’s disappointment”). The tiny act of labeling moves the experience from the limbic system to the prefrontal cortex, giving you a short window to think instead of react.While you’re in that window, run a preset protocol rather than ad‑libbing. Mine is a notebook page with three questions: What exactly happened? What do I want to do right now? What would I tell a friend to do? Writing it forces me to translate raw feelings into concrete statements, and looking at that third answer often exposes the gap between impulse and wisdom. If I’m still unsure, I wait 24 hours before taking any irreversible action—love confessions, angry emails, quitting a job, whatever. Most emotional whiplash cools off in a day; if it still feels right after the wait, I trust it more.Build a daily practice that trains this skill when the stakes are low. Ten minutes of mindfulness meditation or breath counting literally rewires the brain for better impulse control; five minutes of journaling each morning keeps a running log of patterns that cloud your judgment. Physical outlets help too—lifting, running, even walks—because a calm nervous system is easier to reason with.Finally, decide once, not every time. For recurring situations (dating red flags, spending limits, staying up late), write a short set of personal policies while you’re calm. Next time your emotions flare, the decision is already made and you just follow the policy, no debate required.You’re not weak for feeling things strongly; you just need a system that catches the emotion, channels it, and lets logic have its say. Give the above a 30‑day trial, track your results, and adjust. It’s work, but it beats letting every spike of feeling steer the wheel.",
        "comment_gpt4dot1": "Honestly, learning to manage emotions so they don’t hijack your decisions is a skill, and it takes practice like any other. One thing that helps is building a habit of pausing before reacting—literally taking a few deep breaths or even stepping away for a few minutes when you feel a strong emotion. This gives your logical brain a chance to catch up. Journaling can also be useful: write down what you’re feeling and what you think the logical action is, then revisit it after some time has passed. Over time, you’ll start to notice patterns and get better at separating what you want to do in the moment from what’s actually best for you. It’s not about suppressing emotions, but about acknowledging them without letting them run the show. If you keep practicing this pause-and-reflect habit, it’ll get easier to make decisions that align with your long-term goals instead of just your immediate feelings. Hang in there—it’s a process, but it’s definitely doable."
      }
    },
    {
      "id": "t3_xc1fsf",
      "title": "[Need advice] Scared of making any attempt so I procrastinate",
      "body": "So, what I’ve noticed is that I get very scared to do anything with studying or homework. I just get scared to even make an attempt at things… Usually, when it’s the day something is due, that fear of getting a bad grade overcomes that fear of making an attempt at doing things. It’s struggle though, and I end up hurting a lot. I’m just wondering about how I can just do things with school even if there is no due date to scare me into trying even though I get so afraid to (because I want to get things done earlier and not last second) I just don’t know how to get over that fear of doing anything at all, of even making an attempt…..It’s not that I just want to play games or do something else, it’s just fear of doing it at all…..",
      "comments": {
        "best_comment": "I don't know if the experience is similar or not but I will share my incidents with exams.In my third year, Few weeks before exams, I used to start worrying  and used to make a schedule. Then another day I used to procrastinate saying I will do it next day. Slowly the time went shorter and more fear gripped me, but I used to deliberately ignore them by distracting myself with social media, movies ,series, booze, friends etc . Then when there was little time left I started thinking I'm not gonna make it. Although some part of me was saying just do whatever you can do with remaining time , but there was gripping fear in one hand and comfort of distracting myself on another. I choosed comfort and spend watching Simpson with fear still inside of me.  In the end I didn't even went to give my exams Firstly you need some motivation and need to believe in yourself. You may not believe but I passed 3 major subjects of my final mbbs exams just by reading for a day. I hadnot touched books in years. I read while walking in room. I first read every points 3 -4 times then recalled it two times without looking at book. Then I used to speed revise hard topics in every few hours, like just taking a quick glance. In the morning I revised all of it with rapid speed reading.  In exam I could recall more than 60% So whatever time you have left, believe me you can manage. The first and foremost thing is to get started ,once you complete some topics it will give you a boost, thats for sure  but that boost may lead to waste time , so first make a schedule of every hour and day. You may not meet all of it but it will keep you on track. If you are finding really hard to start then try this. Think about the fear , think about the consequences, imagine the consequences, relate it with your past. Don't  distract yourself with comfort. I repeat it don't distracting yourself with comfort this time. Just meditate upon the thoughts. You may feel very bad , but do it. Face the fear completely  and feel the sense of responsibility. Have a hope that if I start it now I will make it. And trust me ,you will make it. Now you need a boost to motivate yourself past the fear. Get a cold shower, just stay in that shower for long time, saying I'm gonna do it. Once you complete it your mind will sense the result of your effort and motivate you somehow. Then just go and start it. Good luck bro , you can do it.",
        "percentile_10_comment": "Pretend you are playing an acting role, or are controlling a robot, and your character/bot puppet is studying or doing whatever project. They are miserable, but getting on with it, putting in a C+ effort.__Sometimes making it a weird game like this works for me, or at least just accepting it's going to be miserable at first like like jumping in a cold pool, or telling myself giving 75% of my best effort is fine. Usually end up  going beyond that after getting into the groove of it.",
        "comment_o3": "I used to wait until panic was the only thing stronger than my dread, so I get it. What finally helped was treating “starting” like its own tiny assignment. Promise yourself you’ll work for just five minutes: open the doc, read the first question, scribble a couple notes. When the timer rings you can quit guilt‑free, but nine times out of ten you’ll already have momentum and keep going. Make tomorrow’s tasks specific and decided the night before—“outline history essay” instead of “work on history.” That way you sit down and act instead of negotiate. Break every big project into mini‑deadlines (outline today, first draft Friday) so you’re still getting the adrenaline kick but in manageable doses. Change locations if you can; a library table or a coffee shop creates a “work” cue and makes bailing feel awkward. And remind yourself the goal is “finished,” not “perfect.” Give yourself permission to write an ugly first version and polish later. If the fear ever tips into full‑on anxiety attacks, talk to a counselor—no shame in using all the resources. Otherwise, treat each five‑minute start like a rep at the gym; the more reps you do, the lighter it gets. You’ve got this.",
        "comment_gpt4dot1": "Honestly, this is a super common struggle, and it’s good that you’re noticing the pattern. One thing that helps is lowering the bar for what “starting” looks like. Instead of thinking you have to do the whole assignment or study session, just tell yourself you’ll open the document or read the first paragraph. Sometimes, just getting over that initial hump is enough to break the fear loop. Also, try setting a timer for 5 or 10 minutes and promise yourself you can stop after that—most of the time, you’ll keep going once you’re in motion. If the fear is about not doing it perfectly, remind yourself that a rough attempt is better than nothing, and you can always improve it later. Progress over perfection. The more you practice starting, even in tiny ways, the less power that fear will have over time. You’ve got this."
      }
    },
    {
      "id": "t3_vyhoxf",
      "title": "[Need advice] I'm a 26 year old failure and I don't know what to do anymore.",
      "body": "I'm 26 years old and I am a failure who is completely useless to society. What should I do?I'm a stereotype loser. I'm 26. I still live with my parents. I have a low paying job that doesn't translate to anything useful. I have zero interest. I have zero real life experience. I hate everything about my life and most of the time I only think about either commiting suicide or hoping I die peacefully. It's not like I didn't try. When I went to college I tried getting into a decent STEM field, but because I was a dumbass I couldn't even pass basic math, so I flunked the barrier to entry for basically every major that's worth attending college for. Instead I got a journalism degree which is the worst decision I have ever made in my life. There are no jobs for this field and now they lowered the requirements to allow even high school grads to get the jobs so now it is literally a useless degree. So at this point I am 30k in debt as well from a dogshit degree that I regret everyday I wake up. I have no idea what to really do because I mostly hate life and everything about it. I'm tired of popping anti depressants that only keep me just above water in terms of mental stability because without them I can't even sleep because I have rapid thoughts of suicidal and sometimes even homicidal ideation in my head. How can I turn my life around while also trying to focus and push through my own mental state.Edit: I didn't think I would get a huge response from this post so I want to thank everyone who posted. There are a lot of people who posted really thoughtful things and I appreciate that.",
      "comments": {
        "best_comment": "26 is young. Plenty of time to turn your life around. Figure out what you want out of life and work backwards. If you're most people, what you want will involve some amount of money and working on your social skills.Life is short, but it's longer than you think. The secret to nearly everyone's success (except the very lucky) is consistency.Figure out what you want - it doesn't have to be something huge like world peace. It could be \"to travel the world\" or \"to buy a house\" or \"get married and raise a family\" or as simple as \"get a job that lets you live comfortably\". Figure out what it is.Consistency compounds quickly. Reaching your goal may only take a couple years depending - if you really stick to it. Then you can move on to the next thing, maybe something bigger. Being successful itself is a skill - the more you are successful and reach your own goals - the easier it is to be successful. Just decide what's important to you and start today, then do it every day.Break down the goal into smaller chunks - if it's get a good job maybe that involves picking a skill you can self-teach fairly easily, then committing to that skill and the job search. If it's getting a girlfriend, maybe that includes getting into good shape and improving your social skills. The point is - pick one thing, right now, and stick to it. The secret is consistency and you feel the way you feel because you have not been consistent in developing any aspects of your life up to this point. That's okay. In 3 years time your life can be entirely different and nearly unrecognizable. You could be thirty and in a happy relationship with a good job doing what you want. The only difference between that version of you and today is the little bit of work you put in every single day between now and then.And if I had to recommend a self-taught job to go from 0 to 100k salary - there are thousands of jobs for front-end JS developers on the market right now - and hundreds of free resources to learn how to be a front end developer. If I was in your position, I would start there.",
        "percentile_10_comment": "It's hard to do something you like when you don't even know what you like 😔",
        "comment_o3": "First thing: if the suicidal thoughts ramp up again, call 988 (US) or whatever the crisis line is where you live and tell someone right away. Staying alive has to be priority one or none of the other advice matters.You don’t have to fix everything at once. Pick one daily anchor habit that’s so small it feels almost silly, then protect it at all costs for the next two weeks. A brisk 10‑minute walk right after waking up is the one I recommend most because it checks several boxes: sunlight, movement, time away from screens, and a clear “I did something” win before the day even starts. Your brain needs repeated proof that you can set a goal and follow through, even a tiny one.Once the walk feels automatic, add the next brick: spend 30 minutes every weekday learning a marketable skill. It could be Google’s free IT Support cert, basic Excel on YouTube, copy‑editing on Coursera, or a community‑college HVAC evening class—whatever looks remotely interesting and leads to a job that hires. You already proved you can finish a degree, so you have the grit; you just need a direction that actually pays. If you truly don’t care which field, lean toward something short, cheap, and in demand so you see progress fast.Debt can feel overwhelming, but lenders mostly just want regular minimum payments. Open the statement, write the number down, and set up autopay so you never have to look at it again except once a month. That simple step moves the debt from “monster under the bed” to “scheduled bill,” which frees mental bandwidth.Use your low‑stress living situation to your advantage instead of as a badge of shame. Parents’ house = low overhead. That buys you time to train, stack cash, and stabilize your headspace without rent breathing down your neck.Last piece: get a therapist if you can, and if meds help you stay functional, that’s a win, not a weakness. Discipline is easier when your chemistry isn’t fighting you the whole way.TL;DR: tiny daily win (walk), dedicated skill block (30 min), autopay the debt, leverage cheap living, keep the mental‑health safety net in place. String those days together and a year from now you won’t recognize the guy who wrote this post.",
        "comment_gpt4dot1": "First off, you’re not a failure just because you’re struggling right now. A lot of people feel stuck at 26, especially with debt and a degree that didn’t pan out. It sucks, but it’s not the end. The most important thing is to start with small, manageable changes. Don’t try to overhaul your whole life at once—that’s overwhelming and usually backfires. Pick one thing you can control, like getting up at the same time every day, or taking a 10-minute walk outside. Build on that. Discipline isn’t about being perfect, it’s about showing up for yourself in small ways, consistently. If you can, try to find one thing you’re even a little curious about—doesn’t have to be a passion, just something you don’t hate—and learn a bit about it or practice it regularly. Over time, these tiny habits add up and can help you feel a bit more in control. Also, if your meds aren’t helping much, it might be worth talking to your doctor about adjusting them or trying therapy if you haven’t already. You’re not alone in this, and things can get better, even if it’s just one small step at a time."
      }
    },
    {
      "id": "t3_t0mi6z",
      "title": "[Need Advice] How are you supposed to do EVERYTHING?!",
      "body": "How are you supposed to study, and work, and spend time with your family, and learn a musical instruments, and clean the house, and cook, and read books, and watch movies, and buy groceries, and workout, and ....this is not a complain or anything. I'm generally interested in how is it possible to live like this...like I really want to study, and I do want to work, and also I want to learn piano, and so on...but it just doesn't seem possible. either there's not enough time, or I forget, or I'm to tired from one task that I just wanna go to sleep or ...so how does someone go about living like this? how can you do everything? im 22, I've been trying to turn my life around for the past year. I have done many things I'm proud of since last year. I got way more productive than I ever was.But here's the thing, whatever I do, it doesn't seem like I can manage to do everything I want to....",
      "comments": {
        "best_comment": "Random Advice:  get a Slow cooker and a rice cooker. You can go out to work or stuff come back and food is ready. I still have no idea how people do so many things. Work takes the majority of my time but I still want to go back to school and do many other things too!",
        "percentile_10_comment": "This is the way, particularly with new habits.Write a list of things you would like to do/ do more of, prioritise it, then start adding things into your schedule slowly.15 mins every day doing one new thing. Once you have done that for a couple of weeks you can think about adding the next thing.That said, don’t stress over not doing all things you want to all at the same time - there are going to be times that you don’t have time to practice piano, or cook, or whatever and that’s fine.I go through phases of being at the gym 5 days a week, and phases when work gets in the way and it is only once a week, and that’s fine because I can get back on it the following week. Be persistent at trying to be consistent. You haven’t failed until you stop trying.",
        "comment_o3": "Nobody does everything at the same time—what you’re seeing online or imagining is usually a highlight reel plus a lot of trade‑offs that aren’t obvious. Pick a small set of “now” priorities and let the rest wait their turn. Right now that might be work, studying, and basic health. Block specific hours for those in your calendar, then treat the remaining time as negotiable space for the extras (piano, reading, movies, etc.). If something doesn’t fit in the current week, it goes on a later‑this‑month list instead of on your conscience.Think in seasons rather than days. You might focus heavily on piano for six weeks, then switch the spotlight to fitness while letting piano drop to maintenance practice. Over a year you’ll have touched everything you care about without trying to cram it all into every 24‑hour cycle.Energy matters more than clock time, so schedule high‑brain tasks (studying, practice) when you’re freshest and batch low‑brain chores (laundry, groceries) together so they don’t leak into the rest of your day. Protect sleep—losing an hour at night usually costs two hours of focus tomorrow.Finally, accept “good enough” levels. A 30‑minute workout beats skipping because you don’t have 60. Two pages of a book before bed still counts as reading. Tiny, consistent reps compound faster than heroic marathons followed by burnout.You’re 22 and already more productive than last year; that’s the game. Keep iterating the system, rotate priorities, and let imperfect but consistent action stack up. That’s how people who look like they “do everything” actually get it done.",
        "comment_gpt4dot1": "Honestly, nobody does *everything* all at once, even if it looks that way from the outside. The trick is to accept that time and energy are limited, so you have to prioritize and rotate your focus. Think of your life like a playlist, not a to-do list—some things are on heavy rotation, others pop up now and then. For example, you might focus on work and studying during the week, then carve out a little time for piano or movies on weekends. Or you could do 10 minutes of practice a day instead of an hour, and that still adds up over time. Also, routines help a lot—if you automate stuff like cleaning or groceries (set days, meal prep, etc.), it frees up mental space. Most importantly, don’t beat yourself up for not doing it all. Progress is about consistency, not perfection. You’re already ahead by being intentional and making changes—just keep tweaking your system and remember that “doing everything” is really about doing what matters most to you, bit by bit."
      }
    },
    {
      "id": "t3_w1n869",
      "title": "[Need advice] was doing great and now I'm depressed",
      "body": "Was doing pretty well, started going to the gym and studied a bit.But then my hair started falling out in huge amounts :( , I'm losing so much hair and everyone pointing out that my hair is everywhere is getting me even more anxious and depressed.How to push through unforseen circumstances which drag you into slumps like this.",
      "comments": {
        "best_comment": "It wasn't your fault. Don't blame yourself for things that are out of your control.",
        "percentile_10_comment": "When you get stressed, don’t look at the whole staircase; just look at the next step. Soon enough you’ll feel better. Then another challenge will come. And another. You get better at dealing with it after you go through it enough times. Good luck!",
        "comment_o3": "First, book an appointment with a dermatologist or your regular doctor this week. Getting a clear answer on what’s going on (stress shedding, nutrient deficiency, genetic pattern, etc.) puts boundaries around the problem and gives you an action plan. Knowing there’s a concrete next step keeps it from ballooning into a vague, paralyzing worry.While you wait for that visit, treat the hair issue like any other unforeseen obstacle: separate what’s inside your control from what isn’t, then build tiny daily wins around the controllables. You can’t instantly stop the shedding, but you can keep showing up to the gym, prep balanced meals with enough protein and iron, take a multivitamin if recommended, and get seven‑plus hours of sleep to lower cortisol. Each time you tick one of those boxes, remind yourself, “I’m doing my part; the rest is biology.”If comments from others are triggering, decide in advance how you’ll respond so it doesn’t knock you off track in the moment. Something short and neutral like “yeah, I’m working on it” then change the subject. Pre‑planning reduces the mental load.Finally, shrink your baseline habits to the minimum that still counts as “I stayed on track today.” Maybe that’s ten minutes of study and a 20‑minute workout. Most motivation dips are temporary; the folks who get through them are the ones who keep the habit alive in its smallest form until the storm passes.Handle the medical side, keep the habits tiny but alive, and in a few weeks you’ll have both data and momentum back on your side.",
        "comment_gpt4dot1": "That sounds rough, especially when you were building momentum. Unforeseen stuff like this can really throw you off, but it doesn’t mean all your progress is lost. When life hits you with something out of your control, it helps to scale back your expectations and focus on the smallest habits you can still manage—like a 5-minute walk, a single page of studying, or just making your bed. These tiny wins keep the discipline muscle active and make it easier to ramp back up when things settle. Also, if you haven’t already, it might be worth checking in with a doctor about the hair loss, just to rule out anything medical. Remember, discipline isn’t about being perfect, it’s about showing up for yourself in whatever way you can, even on the tough days. You’ve already proven you can build good habits, so trust that you can get back on track when you’re ready."
      }
    },
    {
      "id": "t3_yk8w5j",
      "title": "[need advice] I (30f) feel lost and don’t even know where to start changing my life",
      "body": "I really don’t have any self worth or self esteem. A lot stems from me being a failure in life. I’m in my early 30s and only have a bachelors in art history. I have worked as an admin coordinator and don’t make much money. I definitely need a better job but don’t have skills or an education to get one. Other than that I don’t have any friends except for my boyfriend. Lately I signed up for a dance class so I hope I can make a friend there (I’m really shy and have a hard time reaching out). I need to rehaul my life because I’m not the person I want to be, but I just don’t know where to start.",
      "comments": {
        "best_comment": "It sounds like you're putting a lot of pressure and self worth into what would be better described as a logic problem.   If what you're doing isn't making you happy, then what might you do differently?  I know we're all creatures of habit, and it's hard to break a rut, especially if you need big changes, but stable homes get built brick by brick, and stable lives are built day by day.   Try to find the least disagreeable change in the right direction you can tolerate and make it.   As yourself what your daily life would be if you were satisfied, and seek to mirror those actions until they become habit.",
        "percentile_10_comment": "I hear ya, Life can be hard. I recently felt quite the same so i can relate to you. I'm gonna give you what I did to myself and maybe you can take parts of it and apply to yourself. Basically breaking it down it went:1. Assess my current situation2. Map out where I want to be in 1 year from now on, and what is my ideal self3. Create SMART goals 4. Do a daily review of the day**Assess the situation**.  This is where you want to assess what it is that your currently doing in your life to know which parts to reduce and what to start improving.  I started by drawing out a big Chart, where i marked  Infrequent on the left side of the chart, and frequent on the right side  Then i marked little on the bottom side of the chart, and Alot on the top side.  After that i started to plot in my daily habbits. What do i actually do often that has a big impact on my life, good or bad. For instance I spent alot of time working overtime, eating unhealthy and watching youtube, where as i spent alot less time reading books, going to the gym and working on sideprojecs.This gave me a good overview of my current situation and let me know which of my daily habits that we're the biggest issues in my life.**Map out your ideal self**  I basically made a mindmap consisting of me in the middle with parts, Family & Social, Career, Health, Economy. Here I basically maped out in an ideal world, what would I do, what would I look like, what would my relationships with others be like. I did it for my ideal self and also another version for 1 year from now on. This gave me quite a boost of motivation to actually know where I ideally would want to take things. No actions planed, just a vision of what I want my life to be like.&#x200B;**SMART Goals**  Way to many times I've created goals and never followed up. SMART goals enable me to make my goals more tangible by making sure my goals are very specific, that they're measurable(how else can i expect to know if i've achived them), Achiveable - I can't expect to be a worldclass athlete in 1 year, but I can start going to the gym 15 times a month.  Relevant, I don't want to set a goal of losing x amount of pounds, but rather focusing on living a long life for my family. Timebound, this is to give myself a deadline of when this needs to be achived, which makes you accountable.   **Daily Review**  The hardest part of making sure this new routine sticks is def in the begining I just made a simple spreadsheet where i put in my goals, and date, and when i Achive them i mark the day as green, and when i fail i mark it as red. It feels awesome to mark a day as green, and it also gives myself a remainder each day of the goals that I've set up for myself.  So these are the 4 steps that I took to get back on track and start rehauling my life. Feel free to reach out if you wanna chat some more about it.",
        "comment_o3": "The good news is you don’t need to “re‑haul” everything at once; you just need a few keystone habits that start compounding. Pick one small win in each area you care about—work, health, social—and protect 30–60 minutes a day for them.Work: Admin coordinator gives you a ton of transferable skills (organization, scheduling, spreadsheets, communication). Pick one that pays better and double down. For example, take a free Google Project Management or Data Analytics cert on Coursera. Do 30 minutes after work, five days a week, and keep a simple log so you can see hours pile up. Six months of steady half‑hours is 60+ hours—enough to finish a cert and update your résumé.Health/energy: Do something that moves your body but doesn’t drain willpower. A 15‑minute walk before breakfast or after work is enough to boost mood and confidence, and it doesn’t require gear or a gym. If you feel like doing more, great, but the rule is “never zero.”Social: You already enrolled in dance—perfect. Before each class set a tiny target like saying “Hey, how long have you been dancing?” to one person. Same question every time if you want. Consistency beats cleverness; if you speak to one new person each class, you’ll have talked to 20 by the end of a month.Track these three things in a notebook or app with a simple ✔️ each day. Seeing streaks grow is its own motivation and a reminder that you’re not “a failure”; you’re a person who shows up. In a year the compounding looks like: a marketable cert, better energy, and a network of dancers who know your name. That’s a solid foundation to keep stacking on.",
        "comment_gpt4dot1": "First off, signing up for a dance class is a great step—seriously, putting yourself out there like that takes guts. When it comes to overhauling your life, it can feel overwhelming if you try to tackle everything at once. Instead, pick one small thing you want to improve and focus on building a daily habit around it. For example, if you want to work on your career, maybe set aside 20 minutes a day to research jobs, learn a new skill online, or update your resume. If you want to make more friends, challenge yourself to say hi to one new person each week at your class. The key is consistency, not perfection. Progress is slow at first, but it adds up. Also, don’t underestimate the value of your current experience—admin skills are useful in a ton of fields, and you can always build on them. Start small, keep showing up, and give yourself credit for every step forward, no matter how minor it feels. You’re not stuck—you’re just at the starting line, and that’s a good place to be."
      }
    },
    {
      "id": "t3_q0nupo",
      "title": "[Need advice] I'm only living life for the next weekend",
      "body": "I work a corporate 9 - 5 job, but because of covid and WFH, it's been more of a 9 - 9 kinda deal. I'll not get too much into it but I'm miserable during the weekdays. I'm also in a new job so I'm constantly worried about underperforming while actually underperforming which further adds to the worrying. Here's what my week looks like - Monday to Thursday is a struggle to get through. I sleep 8-9 hours, struggle to wake up the next day and count the hours before it's time to sleep again. I wake up happy on Friday, work for 3-4 hours, and then just fuck around for the rest of the day. This part of the weekend is my personal favorite. I'm not too excited because it is still technically a work day but I'm also not drowned out by the fast approaching Monday. Saturday is hype but it's way, way too short and the 18-20 hours I'm awake usually feel like 3-4 hours of productive fun. Sunday first half is mostly recovering from the previous day, and the second half can be best described as pure irrational mental agony. Rinse and repeat. I want to stop glorifying the weekends and want to live a more balanced life where I look forward to each day and where I am not trying to maximize entertainment over the weekend. My current way of living has also gotten me into some weird mental health situations, for example I now depend on food to cope with feeling sad. I've been overweight all my life and this is greatly accelerating the problem. Also, I stay in bed for 9-10 hours because my mind refuses to get out of bed after 8 hours.How do I accept that this is what life is going to be for the next 35-40 years and respect each day equally regardless of how boring/fun it is going to be?",
      "comments": {
        "best_comment": "I personally don't think that discipline is what is going to fix your situation. Unless your long work hours are imposed by WFH hurting your mindset and making it easy to slack off, then maybe so. If that's the case, I recommend you look for things to do outside of work. WFH makes a lot of us feel really repressed, so maybe you would enjoy to start going for walks in the morning. That could be something to motivate you to get out of bed for example. Try to give your day some structure, like a kind of schedule. It doesn't have to hour-by-hour, just whatever works for you. You could start reorganizing yourself by simply adding one new habit at a time.I can't speak for your career because you know your situation, but if it is your job putting you through this, maybe looking for a new one is a good option. Even if the paycheck is less, decreased stress will improve your quality of life much more than the pay difference",
        "percentile_10_comment": "You need discipline, a hobby and work-life balance. The discipline will allow you to set personal targets at work and structure your days accordingly and finish at a reasonable time (8.30-5.30 works well for me with 30 mins for lunch and a few 10-15 min breaks throughout the day). Your hobby/hobbies allow you to have an actual life outside of work on the evenings (soccer, gym, DnD.. Whatever - just try and pick something that takes you out of the house since you WFH). The combination of a disciplined work day and a hobby or planned evening gives you work life balance (voila!).",
        "comment_o3": "Been there during the peak of lockdown – weekdays felt like an airport lounge where I was just killing time until the flight to Friday. A few changes pulled me out of that loop.First, put a fence around work. WFH blurs the edges, so you have to draw them yourself. Decide a hard shut‑down time (say 7 pm), put it in your calendar, tell your manager you’ll be offline after that unless there’s an emergency, then actually close the laptop and put it in a drawer. Most bosses won’t push back if you’re delivering; the boundary forces you to work with more intention and keeps the evenings clear for life.Second, treat each weekday like a mini‑weekend by scheduling one small “anchor” you genuinely look forward to. Could be a 30‑minute guitar lesson on Monday night, a pick‑up basketball game on Tuesday, a fancy coffee and a book on Wednesday morning, whatever. When there’s something positive waiting at 6 pm, the day stops feeling like an endurance test.Third, give your body a reason to get out of bed. Set the alarm for the same time every day, get vertical immediately (phone across the room helps), splash water on your face and step outside for 2 minutes of sunlight or a daylight lamp. Follow it with 5–10 push‑ups, squats, or stretching. Tiny, but it signals to your brain that the day has started and it’s no longer sleep time.Fourth, clean up the coping loop with food by changing the environment, not your willpower. Keep trigger snacks out of the house, prep easy high‑protein meals on Sunday so Weekday‑You doesn’t have to think, and put fruit or nuts where the chips used to be. If the only “lazy” option is something decent, that’s what you’ll eat.Finally, don’t try to make peace with a 40‑year sentence. Think in 3‑month experiments. “For the next quarter I’ll hold a 7 pm work curfew, lift on M/W/F, and practice Spanish T/Th for 20 minutes.” Review, tweak, repeat. Careers, companies, and you will all change many times before retirement. Your job is to build routines and skills that travel with you.Weekends will still be fun, they just won’t be the only time you feel alive. Good luck—you’ve got this.",
        "comment_gpt4dot1": "Honestly, a lot of people fall into the “living for the weekend” trap, especially with WFH blurring the lines between work and life. The first thing to realize is that you don’t have to accept that this is how it’ll be for the next 40 years—things can change, but it takes small, intentional steps. One thing that helps is building little rituals or activities during the week that you actually look forward to, even if they’re minor. It could be a walk after work, a hobby you do for 30 minutes, or even just making a good cup of coffee and reading something you enjoy. The point is to break up the monotony and give yourself something to anticipate that isn’t just the weekend.About the work stress and underperforming: try setting a clear “end” to your workday, even if it’s just shutting your laptop and physically moving to a different space. It’s easy to let work bleed into your whole day, but having a hard stop can help your brain switch gears. If you’re worried about performance, pick one or two small, concrete things to improve each week instead of trying to overhaul everything at once.For the food and sleep stuff, it’s worth experimenting with a morning routine that gets you out of bed for something other than work—maybe a quick walk, stretching, or even just sitting by a window with music. The goal isn’t to be super productive, but to give your mind a reason to get up that isn’t just obligation.You don’t have to love every day, but you can make them less miserable by sprinkling in small things you enjoy and setting boundaries around work. Over time, those little changes add up and make the weeks feel less like something to “get through.” Hang in there—it’s possible to build a life where you don’t dread Monday through Thursday."
      }
    },
    {
      "id": "t3_v8z22p",
      "title": "[Need Advice] How do you stop depression from stopping you?",
      "body": "Hi guys,I’m 21F who has struggled with severe social anxiety disorder for as long as I can remember. It’s bad because i’ve let it go on for too long. Luckily, I recently enrolled in a serious program. I’ve been able to stick with it, everyday, for a month now. It was cognitive strategies at first, and now it’s getting into behavioral things. Going out and socializing. Exposure to my fear. And I can’t help but be upset at myself because I can feel myself slipping into depression atm, which is a symptom of my SA, because I feel like I can’t do this.But I want it so bad. Tonight I was sitting in bed after scrolling on my phone for hours and I’ve decided I’ve had enough. I need things to change. I have a list of 4 things I want to do everyday (therapy program, meditation, work out, and doing one social thing as simple as going into a store). The thing is I don’t wanna slip. Because for me, slipping even once is a huge fall back into my depression and isolation.For any of you who have successfully achieved your goals and stuck to a schedule, how did you do it? Are there apps that can help, communities that hold you strongly accountable, a method or something you discovered that finally made you not quit? Especially those of you who have a mental illness, how did you stop it from getting in your way? Any help or advice is appreciated. I wanna start tomorrow.Edit: Thank you all for the amazing advice. I feel very motivated and supported. :)",
      "comments": {
        "best_comment": "Having a structure like your program is a huge help. It gives you something to grasp onto and you slide into and out of depression. One thing I will say is that it’s a journey. It’s going to take awhile. You are going to take some steps forward and some steps back. It’s completely normal so try to not beat yourself up about it. It’s going to happen, it’s going to be ok, and it does get better. For myself, what has made the most difference is to not a ridged, self-enforced schedule. I can’t ever do it well enough for that to fix anything. The self-anger from messing up just Leads to more depression. What I can do is try to break away from my daily life as much as possible. I see new things, even if I am alone. I go to a local bar a few times a week. It was awkward at first but someone will take you under their wing at some point and give you the comfort to get to know others there.",
        "percentile_10_comment": "Every time I get into a rut, I realize my sleep has been poor. I’m not naive and condescending enough to suggest sleep is the only thing that’s making you feel bad. But it’s a good place to start when trying to get on track. Protect your sleep. Do that by:- Going to bed at the same time every night. - Waking up at the same time every day. (For the most part.)- Getting up when your alarm goes off. (I have one old-school alarm in my bedroom and my phone alarm set for one minute later out in the kitchen. Also, my bedroom alarm is an ascending beep, meaning it starts at low volume and gradually increases.)- Protecting yourself from screens for an hour before you go to bed. (This is an important one. Even with apps that protect you from blue light, the screen is still too much stimulation before bed. Give yourself an hour, even if you’re not really doing anything in that hour.)Also, allow yourself to break one of these rules on occasion. Be disciplined, but don’t be rigid. That will help break you of the all-or-nothing mindset that causes you to feel you’ve lost all progress when you screw up once. Protecting your sleep is easy and makes you feel better, period.",
        "comment_o3": "What helped me stick with a similar “mental‑health first” routine was treating each habit like brushing my teeth: not negotiable, but the intensity can vary day to day. I planned a tiny, can’t‑fail version of every task—five minutes of the program, two minutes of meditation, ten push‑ups or a short walk, walking into the corner store to buy gum. On good days I often did more, but if my mood cratered I could still hit the minimum and keep the streak alive. That one change killed the all‑or‑nothing thinking that used to send me spiraling.I put every task in my calendar with alarms and labelled them “appointments.” The less deciding I do in the moment, the less my brain can negotiate. Habit‑tracking apps like Loop (Android) or Streaks (iOS) give you a satisfying visual chain; I check mine off immediately afterward so the reward is instant. If you like gamification, Habitica turns your tasks into an RPG and has guilds for social anxiety where people cheer each other on.Accountability multiplies discipline, so I post my daily checklist in a small Discord with two friends. If I don’t report by 10 p.m. they ping me. You can get a similar effect from r/90daygoal or the daily threads here.Finally, expect the occasional miss. One slip isn’t a relapse; it’s a data point. When it happens I write down what tripped me up, adjust tomorrow’s plan, and move on. Consistency beats perfection, and the fact that you’ve already stuck with the program for a month shows you have the chops to do this. Good luck—you start again every morning, and that’s a powerful advantage.",
        "comment_gpt4dot1": "First off, huge respect for sticking with your program for a month—that’s not easy, especially with social anxiety and depression in the mix. One thing that helped me was lowering the bar for what “counts” as a win, especially on tough days. If you can’t do the full workout, just put on your shoes and stretch for five minutes. If going into a store feels impossible, maybe just walk to the door or even around the block. The key is to keep the streak alive, even if it’s a tiny version of the habit. I also found it helpful to use a habit tracker app (like Habitica or Streaks) because seeing the chain grow is motivating, and it’s less about perfection and more about consistency. If you miss a day, don’t let it spiral—just get back to it the next day. Communities like this sub or even small Discord groups can help with accountability, but ultimately, being kind to yourself and focusing on progress over perfection is what keeps you going. You’re already doing the hard part by showing up and wanting to change. Keep going, even if it’s just a little at a time."
      }
    },
    {
      "id": "t3_soop8x",
      "title": "[Need Advice] how to find your pasisons",
      "body": "I need some help here. Currently 27.Things I've tried:1. Programming2. Designing (did that for most of my extracurricular. Don't see myself doing it for a career) 3. Song writing & audio engineering (I wrote songs as a kid and teen. I'm pretty OK with the analog board) 4. Psychology (degree level) 5. Economics (microeconomics) 6. Physical sciences (pre-u level. This is the last time I truly felt interested in something, maybe pursue this one further?)[Edited] Things I know about myself:Area of interest: ???Values to keep: honesty. Scope: ideally can connect to a lot of people.  Skills: problem solving, creating too why not. Years of commitment: ideally LONG Term RN I identify 'disinterest' as a dry hole in my chest, or a heavy feeling of 'why am I here'. I need a sense of purpose I guess? Hobbies: I've been watching videos on history, conspiracy shit, self help, and some kpop stuff. Jobs I've already tried: 1. sales (making money for a just a company is not fulfilling. Scope of influence is a little small for me.)2. market research (large scope! I like learning about consumer and economic insights, but got pretty tired after 2 years. I'm analysing - always a plus, but not implementing solutions)3. customer service (absolutely no. Pretty dry for me.)Current job: online business (ahhhhh..... I don't like to lie to customers, so I really research the products I bring in if its health related)Potential pursuits: self-help vids, or post daily routine on yt. I'm just sitting on this idea for now. When I'm ready then I'll do it. And hopefully make more $$$$$",
      "comments": {
        "best_comment": "I’d recommend reading a book called So Good They Can’t Ignore You by Cal Newport. He makes the claim that this idea of finding your passion is mostly nonsense. Instead, real passion is forged through years of effort and dedication. (He gives a more nuanced take in the book though)",
        "percentile_10_comment": "GYM GYM GYM GYM",
        "comment_o3": "A lot of people wait to “discover” a passion when what usually happens is they stumble into it after a stretch of focused doing. Think of it less like hunting for buried treasure and more like running a series of short, deliberate experiments. Pick one direction that feels promising—physical sciences, for example, since that was the last time you remember genuine interest—and give it a six‑month sprint. During that time build a simple, repeatable routine: spend an hour a day on foundational study, an hour on a hands‑on side project (could be a small electronics kit, a data‑analysis notebook, a short explanatory video), and finish each session by writing two sentences about what felt energizing and what felt draining. At the three‑month mark reread those notes. If your average day still feels like the “dry hole,” pivot to the next experiment on the list. If the notes are trending positive, double down for another six months.Two rules keep the process honest: cap your experiments at one or two simultaneous commitments so you don’t spread thin, and make sure each one ends with something concrete you can show—an Arduino gadget, a Medium article, a five‑minute explainer on YouTube. Tangible outputs give you real feedback and build a portfolio at the same time.You already like problem‑solving and reaching people, so look for intersections: science communication, data journalism, user‑research inside tech, or even product management where micro‑economics, psychology, and design all collide. Those fields reward honesty and have broad impact, which matches your values. And if you still want to try the self‑help or daily‑routine channel, run it the same way: schedule six weeks, script ten short videos, post them on a fixed cadence, then review the numbers and your own enthusiasm before deciding whether to scale.Discipline here isn’t about iron willpower; it’s about building a small structure that makes these experiments automatic. Block the time on your calendar, set a visible tracker on your wall, and commit to not breaking the chain for the full sprint. Whether or not any single project becomes “the one,” you’ll come out with stronger habits, clearer data on what excites you, and a growing stack of skills you can leverage anywhere.",
        "comment_gpt4dot1": "Honestly, it sounds like you’ve already done a lot of the hard work by trying different things and reflecting on what actually matters to you. That “dry hole” feeling is super common when you’re searching for something that feels meaningful, so don’t beat yourself up for not having it all figured out at 27. If you’re looking for a sense of purpose, sometimes it helps to focus less on finding a single “passion” and more on building habits around things you’re curious about—even if they don’t feel like a grand calling yet. For example, if physical sciences were the last thing you felt genuinely interested in, maybe set aside a small, consistent block of time each week to dive back in—read, take an online course, or even join a local group if that’s an option. Over time, discipline in exploring these interests can help you rediscover what excites you, and you might find new angles you hadn’t considered before.Also, since you value honesty and connecting with people, maybe try combining those with your skills—like making content that helps others learn or solve problems (self-help, routines, or even breaking down complex topics in a relatable way). You don’t have to commit to a full career pivot right away; just start small, build a routine around creating or sharing, and see what sticks. The key is to keep showing up, even when you’re not 100% sure where it’s leading. Purpose often comes from action and consistency, not just inspiration. Good luck!"
      }
    },
    {
      "id": "t3_136fhqy",
      "title": "I'm weak mentally and physically [Need Advice]",
      "body": "Hey everyone, I'm a 24 year old male, and I really need some wisdom words because I think I'm at the bottom of my life. Last February, I had a breakup. It was a 1-year relationship, and she was my first true love ever. I really wanted us to work so badly, but it didn't happen. It was a \"healthy\" breakup, but I just couldn't accept it. She wanted us to stay \"friends,\" but I said no. Even if it hurt me so fucking bad. The thing is that I felt safe during her. I showed too much emotion. I was vounrable all the time thinking it was ok to show her my real feelings.I know it was my fault. I just don't want to be that person anymore. I don't want to be famous and get easily affected by my emotions. I want to know how to control my mind and my emotions so people can rely on me in the future. And I have absolutely no idea where to start because I feel lost every time.I don't really know if it's the right sub to post in, but I like how the guys think here.thanks, ",
      "comments": {
        "best_comment": "If you tell yourself you're weak, you're gonna be weak. Give yourself a break mate, no one else is going to.The word you're looking for is stoic. And try meditation and mindfulness for though control.You can be yourself, you're just fine. Just need to be around people who appreciate who you are. Don't change for others, just be yourself.Are you in the UK by any chance?Paul",
        "percentile_10_comment": "Not sure what you mean by weak? Telling your partner where you're at emotionally isn't weak, that's just being in a relationship. Unless it's to the point where you're using your partner as a trauma dumpster when you really need to be in therapy, medicated, and in the gym to help manage your emotional help then you aren't weak. You're just human.",
        "comment_o3": "First thing: nothing is “wrong” with you for feeling gutted after a breakup. It hurts because you cared, and caring is not weakness. What matters now is what you do with the energy that’s sloshing around after that loss. Discipline is really just the habit of directing that energy on purpose instead of letting it leak everywhere.Start by giving your days a basic structure. Wake‑up time, bed time, three meals, some movement, something productive, something genuinely relaxing. If you nail the fundamentals—sleep, decent food, exercise—you’ll be shocked how much emotional turbulence settles on its own. Pick one anchor habit that you can hit no matter what: a 30‑minute walk every morning, a short lift session after work, whatever is sustainable. Treat that habit like brushing your teeth: non‑negotiable.Next, train the mind the same way you’re training the body. Ten minutes of meditation, or even just sitting with a notebook and dumping all the messy thoughts onto paper, will teach you to watch emotions instead of being yanked around by them. Pair that with some Stoic or CBT‑style reflection: ask yourself, “Is this feeling helpful? Is it telling me to act, or is it just noise?” Over time you’ll get quicker at spotting unhelpful loops and steering back to what you can control.Because a breakup can leave a huge gap in your social and purpose “buckets,” deliberately fill them. See friends in person, join a hobby group, volunteer, take a course—anything that reminds you you’re part of something bigger than your own head. Momentum is your friend here; the more small wins you stack, the easier the next one feels.Track progress somewhere visible—a calendar you don’t want to break, a notes app, whatever. The point isn’t perfection; it’s proving to yourself day after day that you keep promises to yourself. That’s where real confidence comes from, not from never feeling sad again.If the grief still feels overwhelming after a couple of months of genuine effort, there’s zero shame in talking to a therapist. Think of it as hiring a personal trainer for your head.Finally, remember that discipline isn’t about becoming a stoic robot. It’s about having enough control that you can choose when to be open and when to be reserved. You’re already on that path by asking for help. Keep showing up for yourself and the strength—mental and physical—will follow.",
        "comment_gpt4dot1": "First off, it’s totally normal to feel lost after a breakup, especially your first real one. Wanting to be more disciplined and in control is a solid goal, and you’re already on the right track by reaching out and wanting to change. The best way to start is small—pick one daily habit that you can control, like making your bed every morning or going for a short walk. These little wins build up your confidence and show your mind that you can stick to things. When it comes to emotions, you don’t have to shut them off, but you can practice not reacting right away. If you feel something intense, give yourself a few minutes before you act or respond. Journaling helps too—just write down what you’re feeling and why, no filter. Over time, you’ll notice patterns and get better at handling them. Remember, discipline isn’t about being emotionless, it’s about not letting your emotions run your life. Keep it simple, be patient with yourself, and focus on progress, not perfection. You’ve got this."
      }
    },
    {
      "id": "t3_14eo6ut",
      "title": "[need advice] my shameful secret: I never went to high school.",
      "body": "Bullet points so you don’t have to read the whole thing:-I was homeschooled and my parents didn’t hold me accountable with my schoolwork -I think I made it to 6th or 7th grade until I stopped school completely-I want to go to college spring 2024, but I don’t know where to start————I’m not sure if I’m even in the right subreddit for this but I’m kind of desperate and genuinely just truly embarrassed at this point. I’m 24 y/o and never went through high school.I grew up in a Christian homeschooled household and to make a very long story short, since middle school my parents never kept me accountable with my school work. I believe I had some learning disabilities that made it hard for me to do my schoolwork which led me putting it off. That coupled with my parents never checking up on how I was doing/if I was completing my schoolwork, my education just slipped through the cracks. I started working and moved out when I was 17. And that’s how it’s been till now. I honestly don’t remember what grade I got to in school before I dropped out, I’m assuming 6th or 7th. Now that I’m nearing my mid twenties I’m realizing I’d like to go to college in spring of 2024 but I have no idea where to even start. I was hoping I could get some advice on first steps. I know I need to get GED but where do I go for that? Is there a program for people like me? Am I too far gone? Please help.",
      "comments": {
        "best_comment": "Hit up your local community college and tell an entrance counselor you need to take some assessment tests due to non-traditional schooling.  I guarantee you they’ve heard this story before and they will help you figure out what remedial courses are necessary.  Also ask how to get assessed for learning disabilities so you can get accommodations as necessary.",
        "percentile_10_comment": "Yo homie I also didn't get past 7th grade, I got my GED at 30, then started college 2 years after that. I'm an engineer now. It's possible for you as well, learn about passing the GED as an exam instead of trying to learn what's on it (the big books the give you are intimidating), being in college is rewarding as you are around people motivated to learn. Community college will be a better resource at first until you are ready to transfer to a university.",
        "comment_o3": "You’re not too far gone at all—24 is a perfectly normal age to be figuring this out and people ten, twenty, even thirty years older than you do it every year. The short version of the process is: get the GED, use it to enroll in community college, then transfer or continue from there.  First step: make an account on GED.com. That site is run by the company that administers the test, and it walks you through registration, state‑specific rules, testing centers, fees, and free practice questions. Take the diagnostic quizzes right away; they’ll show where you’re strong and where you need work, which keeps your study time focused instead of random.  Next, call or email the nearest community college’s “adult education” or “continuing education” department. Almost every state funds free or very low‑cost GED prep classes—many meet at night or online and include tutors. If you suspect a learning disability, tell them; the GED has official accommodations (extra time, private room, etc.) and colleges often have disability services that can help you document and receive them.  Now the discipline piece: treat studying like a shift at work. Pick a specific block of time you can defend—say 7–9 p.m. on weeknights—and sit in the same spot with your phone on airplane mode until the block is over. Start each session by writing the single topic you’ll cover (e.g., “fractions” or “social studies practice test”) at the top of a sheet of paper and end by jotting what to tackle tomorrow, so you never waste time wondering what’s next. Khan Academy, GED Flash, and plenty of YouTube channels cover everything for free; the key is consistency, not perfect resources. Aim for four or five study blocks a week and track them on a calendar so you can see the streak grow.  Once your GED practice scores are comfortably above passing, schedule the real exams one at a time. Passing all four subjects instantly makes you eligible for federal financial aid; fill out the FAFSA as soon as it opens in October and apply to the community college for Spring 2024 admission. They’ll likely give you a placement test and, if needed, remedial math or English courses—which is normal and nothing to be embarrassed about.  The plan is straightforward: GED account tonight, call the adult‑ed office tomorrow, study on a fixed schedule, knock out the four exams, file FAFSA, enroll. Keep your daily study habit small but non‑negotiable, and the months between now and spring will be more than enough. You’ve already done the hardest part by deciding to act; now it’s just reps. You got this.",
        "comment_gpt4dot1": "You’re definitely not too far gone, and honestly, you’re not alone—lots of people have gaps in their education for all kinds of reasons. The good news is, there’s a clear path forward. First, look up GED prep programs in your area—public libraries, community colleges, and adult education centers often offer free or low-cost classes. There are also online resources (like Khan Academy, GED.com, and YouTube channels) that can help you brush up on the basics at your own pace. Once you feel ready, you can register for the GED test through GED.com, which will guide you to official testing centers near you. As for discipline, try setting a simple daily study routine, even if it’s just 30 minutes a day to start. Track your progress and celebrate small wins—consistency is way more important than cramming. If you hit a wall, don’t be afraid to ask for help—there are tons of online forums and local tutors who can support you. Getting your GED is 100% doable, and it’s a solid first step toward college. You’ve already done the hardest part by deciding to change things. Keep going!"
      }
    },
    {
      "id": "t3_qiy0vv",
      "title": "[Need Advice] After a month of studying, I think I'm Burned Out. What can I do? I literally feel physically too weak to do anything and would just lie in my bed",
      "body": "Lectures are getting annoying as they are \"dry\" af (only writing out really long and exhausting proofs, or professors who simply cannot fascinate someone)And I start feeling like wanting to just lie in bed and to watch Netflix. If I sit at my desk, I feel so so tired and weak, even during lectures, I am having trouble even holding my pen and writing(don't worry, I'm not sick, I feel 100% fine)Coffee used to give me that kick in the a**, but it stopped workingWhat should I do to charge batteries?",
      "comments": {
        "best_comment": "Make sure you eat well and drink enough water, also get enough sleep.",
        "percentile_10_comment": "I take one whole day off after a month of anatomy and physiology classes given by professors with deep accents, contemplating whether I should just quit or continue. It is okay to take a break. Sometimes we just need a rest. Maybe just acknowledging that we have a power to choose what we want with our life. So, all the best.",
        "comment_o3": "Start with the basics: consistent 7‑8 hour sleep, real meals with protein and complex carbs, plenty of water, and a bit of movement every day. The moment those slip, no amount of coffee keeps you alert, and caffeine tolerance rises fast. If you can, drop coffee for a week so your receptors reset—your first cup back will feel like rocket fuel.Dry lectures are brutal when you’re just transcribing. Skim the notes or textbook before class and write down a handful of questions you actually want answered. In lecture, focus on listening for the answers instead of copying every line; afterward, try to explain the proof to a friend or a rubber duck. Teaching forces active engagement and cuts study time later.Keep study blocks short enough that willpower doesn’t flatline. The classic Pomodoro (25‑on, 5‑off, four rounds then a longer break) works because you’re never more than a few minutes from standing up. During those breaks, leave the desk—walk around the building, stretch, do a set of push‑ups—anything that pumps blood and gives your eyes a screen break.Schedule real downtime so it’s recovery, not procrastination. Decide, for example, that Saturday night is pure Netflix with zero guilt, then on Sunday morning you’re back at the desk. Having set “on” and “off” hours keeps your brain from trying to escape all week.Most “burnout” is basic maintenance debt. Fix sleep, food, water, and movement first, swap passive note‑taking for active learning, and your energy comes back surprisingly fast. Good luck; you’ve got this.",
        "comment_gpt4dot1": "Honestly, it sounds like you’ve hit a wall, which is super common after grinding for a while, especially with dry material. First, don’t underestimate the power of a real break—like, a full day or two where you don’t touch your studies at all and just do things you enjoy (guilt-free). Sometimes your brain just needs to reset. After that, try switching up your study routine: shorter sessions, changing locations, or even studying with a friend can help. If lectures are draining, maybe skim the material beforehand so you’re not going in cold, or focus on active recall instead of just copying notes. Also, make sure you’re getting enough sleep, eating decently, and moving your body a bit—basic stuff, but it makes a huge difference. Coffee loses its magic if you rely on it too much, so maybe cut back for a bit and see if your natural energy comes back. Burnout is real, but it’s not permanent. Give yourself permission to rest, then ease back in with small, manageable goals. You’ve got this."
      }
    },
    {
      "id": "t3_ocxh5e",
      "title": "[Need Advice] How do I manage to convince myself I’ll do something tomorrow when I have a terrible track record of actually doing a task next the next day?!",
      "body": "I seem to be completely unaware of my abilities and capabilities. At times I’ll convince myself I can do anything in the world, and on other times I’ll convince myself I’m a good for nothing failure. It’s crazy how I’ll start a task and be so happy to have even started the task, I’ll be like yeah see you can start a task whenever you want. With my newfound confidence, I’ll be riding that ‘high’ and end up procrastinating and that would be the end of my task for that day. Time and time again I procrastinate and hate myself for it later, but I somehow manage to convince myself to procrastinate again! It’s crazy! How do I break this loop? Should I just assume that there’s no way I’ll end up doing the task later, and hence there’s no better time than now? I’ve gotten to the point of initiating the task but I struggle to keep up the momentum. I’m really tired and I think it’s high time I break out of this seemingly never ending loop. I’ll take any suggestions I can get.",
      "comments": {
        "best_comment": "Perhaps it can help by viewing your future self as an separate entity that you can help out by doing something today. Sounds like he would be very grateful if he didn't have to go through the pain of pushing through procrastination habits again.I also like to fool myself into only asking to do a chore for a few more minutes when I want to quit, usually I stick to it a while longer",
        "percentile_10_comment": "Easy. **DON'T** say you'll do it tomorrow. Get up and do it right now. Tomorrow does not exist. It's a hypothetical period of time. As soon as \"tomorrow\" comes, it's today, and no one is guaranteed a \"tomorrow\" anyway. Do it now.",
        "comment_o3": "I used to do the “tomorrow‑me will crush it” routine until I stopped trusting tomorrow‑me and built a system that doesn’t rely on motivation. Decide exactly what and when before you stop today—“read pages 10‑15 at 9 am” is concrete; “work on the book” is an invitation to procrastinate. Make the first step almost embarrassingly small: open the doc and write one sentence, do two push‑ups, whatever. Once in motion you’ll usually keep going, and even if you don’t, you kept the promise and protect the streak. Track the streak on paper; a row of X’s is surprisingly persuasive. End each session mid‑stride—jot the very next action before you leave so tomorrow’s start is automatic. Finally, add friction to the escape hatches: phone in another room, blocker on distracting sites, timer running. After a week or two the internal debate fades because the default is simply “I start at 9 am; that’s what happens.” Discipline is less about heroic willpower and more about rigging the environment so the easiest choice is the productive one.",
        "comment_gpt4dot1": "Honestly, this is super relatable. The “I’ll do it tomorrow” trap is so easy to fall into, especially when you get that little boost from just starting something. One thing that’s helped me is to stop trusting my “future self” to magically be more motivated or disciplined than I am right now. If I catch myself thinking “I’ll do it later,” I try to do at least a tiny piece of the task immediately—like, literally just two minutes. That way, I’m building the habit of acting now, not later. Also, instead of relying on motivation, try setting up a routine or a specific time for the task, and make it as easy as possible to start. Lower the bar for what “counts” as progress. Over time, you’ll start to trust yourself more because you’re actually following through, even in small ways. Momentum builds from consistency, not from big bursts of motivation. You’ve already got the self-awareness, so just keep nudging yourself to take action in the moment, even if it’s tiny. It adds up."
      }
    },
    {
      "id": "t3_sunwbq",
      "title": "[Need Advice] 23 years old, been in a really dark place, now trying to win over myself and be a better person",
      "body": "Hi everyone, this is the first time for me writing something on reddit, so I hope it will not be a problem writing such a long post. Basically my last months were really really difficult ones. In particular, I had a relationship which really broken me, or at least, I don't know if it broken me or it made me realize how much I was already broken before meeting her. Basically sometimes I had suicide thoughts because of the overall situation and I went to therapy 4/5 times, then stopped it because I was feeling like \"I didn't have much more to say\" and I was perceiving time spent doing that as something not so practical / affecting me. Furthermore, I dated 3/4 girls after her (thanks to dating apps), of which I even kissed one and brought her to my home, after that moment we basically ghosted each other (I didn't write her and she didn't write me). I would say that if someone would judge my life from an outside perspective it's something that looks really good: I am a good student in a top university, I have a family which loves me and financially supports me, I have few friends, but with whom I feel like myself and I can talk about anything. Despite that, considering more the part of my life I can see and judge more than others, there are some things with whom I really struggle on a daily basis.**Two minors issues*** **First of all, I don't like my body and I would like to lose weight** \\--> This is something I am working on in the last weeks, indeed, I went to gym on a daily basis, now these days I am sick so I cannot go there, but I trust myself and I think I will be able of losing weight and be in a good shape. My biggest concern here is that after reaching a good point and having reached a good body then I would start not following anymore this habbit and become bad again (it happened when I was 17 years old, I had abs after 3 months of gym on a daily basis, then school started and I didn't went to gym anymore for years).* **Cutting alcohol from my life** \\--> Many times it happened that I took decisions in my life due to alcohol or I treated others badly due to being drunk, I am trying to drink less. I have already drinked less than usual these 2 months (I had 4/5 beers overall, due to social circumstances, like spending time with others who I know would have liked me to drink in that moment)   **My two biggest issues*** **Dealing with porn / masturbation / NoFap** \\--> For years, and I mean **years** (since I was 15) I used porn and masturbation as a way to escape from my problems, I used to masturbate to porn 3/4 times a day and I know for sure this is something I have done in the moments in which I was feeling worse. For example, if someone didn't message me back or if I was anxious for a girl I would haved masturbated a lot. Also, after losing to videogames masturbation was an habit. Now I am trying to go to a nofap journey, I had a 5 days streak, yesterday I fapped so here I go starting again. For me it's really really really difficult to quit porn and masturbation, especially because it seems a life-changing decision, and so I start thinking \"ok now I will start this, so does it means that I will no longer fap to porn / masturbation in my life?\" and the thought really really scares me.   * **Dating** \\--> In the last months I have been subscripted to tinder and bumble, I feel like I was able of finding girls to talk with and I had few dates. On the other hand, there are 3 issues in this matter. The first is that dating itself is something exhausting, it's exhausting because it feels like you have to impress others. The second one is that I am currently studying abroad, in June I will go back to my parents country and in August I will start an exchange semester. So I perceive this thing of changing countries many times could be something detrimental for having a relationship. Third and last one, I had 9 relationships in my life, all of them lasted maximum 2 months, I am really scared that having another relationship would lead to the same outcome, I really don't want that and now, more than ever, I need a lot of stability in my life. Many times I think \"Should I stop dating for few months and just focus on myself?\" but I am really scared of being lonely or not having someone so close to me during some months of my life (I think that more or less in my life I always had periods in which I had either a relationship or a crush for someone, I think love is one of the most important things in life).   **I really don't know if there exist one solution or a reply to every of these problems, I would appreciate also having an answer just to one of them, if you have ever been through something similar or if you have advices to share. Thanks a lot to this community, wish everyone a nice self-improvement journey!**",
      "comments": {
        "best_comment": "I took a quick read through and let me just plop down some advice from my almost 30’s self. The desire to change and make adjustments never goes away no matter how much you change. If you’re dissatisfied now that means you need to take whatever small things you can start TODAY and go from there. It takes such a long time to make active changes in your life no matter how small or low you aim you need to start today. In my experience nothing has ever been a quantum leap but rather constant tiny changes in my “right now” decision making.",
        "percentile_10_comment": "May I ask what is the rush to date?Your a VERY young guy with a LOT of growth left to do. If you are not truly satisfied with all aspects of ur life then give dating a miss for the time being and focus competent on YOU. There’s a lot more I would like to say but I advise you take a day off and binge watch these 2 you tubers:“Hamza” and “first man”These 2 will rework your mindset and set you on a good path for self improvementGood luck G and see you on the other side",
        "comment_o3": "I’d zoom out and think in terms of a “one‑knob at a time” approach. When you try to twist four or five knobs simultaneously (gym, alcohol, porn, dating, school) you run out of willpower fast, relapse on one, then feel like the whole panel exploded. Pick the single habit that would make everything else easier and nail it for 60‑90 days. For most people in your situation that’s consistent exercise because it’s an anchor: it floods you with endorphins, regulates sleep, gives you something to do when urges hit, and grows self‑respect. Your plan can be as simple as three strength workouts and two 30‑minute walks per week, booked on your calendar like classes you can’t skip. When you’re sick or busy, keep the streak alive with an ultra‑tiny version—five minutes of push‑ups or stretching counts. The goal is “never zero,” not “perfect session.” Once that’s automated you’ll be surprised how much easier it is to drink less, study better, and resist porn because your brain already has a daily win.For alcohol, decide your rule before you enter the bar: “no drinks” or “two and done.” Announce it to the friend who will actually call you on it, not the one who buys rounds. Order a soda with lime as soon as you arrive so your hands aren’t empty. Track nights alcohol‑free on a calendar; watching a streak grow scratches the same dopamine itch drinking used to.Porn is a stimulus‑response loop like any other. Remove the stimulus (blockers, phone out of bedroom, no screens after 11), replace the response (cold shower, short walk, text a friend) and expect withdrawal waves for two weeks. When you slip—and you will—label it data, not failure. Note the trigger, adjust the environment, start the streak counter at one again. That mental reset is the real skill you’re practicing.Dating can wait. You’re about to switch countries twice; that’s enough novelty. Give yourself permission to focus on friendships, study, and the habits above until you land in the exchange semester. Loneliness won’t kill you; chasing new matches while you’re unstable might. If someone amazing crosses your path organically, great, but deleting the apps removes the “should I swipe?” bandwidth tax and lets you prove to yourself that you can be content solo.Finally, therapy usually feels unproductive right before the real work starts. If you can afford it, commit to another ten sessions and treat it like training, not chatting. Show up with a written agenda of what happened, what you tried, what didn’t work. That alone makes it feel practical.TL;DR: pick exercise as your keystone habit, guard it like a class, layer in alcohol rules, treat porn slips as data, pause the dating apps, and give therapy another structured shot. Stack small, repeatable wins and the darker thoughts lose their grip. You’ve got good resources; now turn them into daily reps.",
        "comment_gpt4dot1": "First off, props for being honest with yourself and taking steps to improve—just writing this out is a big deal. A lot of what you’re describing is actually pretty common, especially in your early 20s when life feels like it’s moving a million directions at once. For the gym/weight thing, the key is to focus on building a routine that’s sustainable, not just intense. Instead of going all-in and burning out, try to make exercise a non-negotiable part of your week, even if it’s just a quick walk or a short workout when you’re busy or sick. Consistency > intensity. If you fall off, just get back on—don’t let one missed week turn into months.With alcohol, it sounds like you’re already making progress. Social pressure is tough, but you can always have a drink in your hand that isn’t alcohol (soda, water, etc.) and most people won’t care as much as you think. The more you practice saying no, the easier it gets.On the porn/masturbation front, don’t get caught up in the “forever” mindset. It’s not about never doing it again, it’s about breaking the cycle of using it as an escape. Focus on understanding your triggers and finding other ways to cope when you’re stressed or bored—go for a walk, call a friend, do something creative. If you slip up, don’t beat yourself up, just start again. Progress isn’t linear.For dating, it’s totally valid to take a break and focus on yourself, especially if you’re moving around a lot. You’re not going to miss out on “the one” by taking a few months to get your own life in order. If you’re worried about loneliness, lean into your friendships and family, and maybe pick up a new hobby or group activity. Relationships are great, but they’re not the only source of connection or meaning.Overall, don’t try to overhaul your whole life at once. Pick one or two habits to focus on, keep your goals realistic, and give yourself credit for small wins. Discipline is about showing up for yourself, even when it’s not perfect. You’ve got this."
      }
    },
    {
      "id": "t3_r33noq",
      "title": "[NEED ADVICE] Issue regarding sleep and motivation to work (will be discussing porn and porn usage)",
      "body": "For the past two years, I have been sleeping, dreaming about me being a sissy and pleasuring different people I have met and am friends with. I have been watching porn with the perspective of me being the woman and not the man. Too much sissy porn has affected me so seriously in my brain. I have been watching Hypnos, BNWO videos on Twitter, Reddit and on many other websites. It has reprogrammed me into thinking I am never going to be a man who could bang like in the video, or be a man who could achieve anything. I am always going to be the girl.The worst thing about this addiction is that I don’t sleep unless I dream about getting fucked. Whenever I think about being the dude in sex, I stay up all night. But the moment I think about me getting plowed by a dick, I sleep like a baby.This thinking is severely affecting my career. Me, doing a master’s in finance, have to give a lot of presentations. Since watching sissy porn, my confidence has dropped a lot, and I am shy all the time. My manhood is being affected by this type of porn.I am unable to be the focus on my studies as well. I am so attracted to this type of porn that I have started missing my online lectures, or I watch porn during the lectures on my phone.I don’t know how to cope up with this addiction. Can anyone help me spiral out of this hypnotic porn?",
      "comments": {
        "best_comment": "Seek.Professional.Help.***No one here can help you.",
        "percentile_10_comment": "There is honesty nothing wrong with the fantasies you are having. What’s not normal is that your fantasies are intruding into your daily life. You need to take a break from porn but continue to enjoy your fantasies. Do not be ashamed of them. We cant control the experiences that bring us to these fantasies but its important that we accept them for what they are - enjoyable fantasies. Your manhood is not deteriorating because of your fantasies. Its deteriorating because you can’t accept yourself and the lack of confidence shows.A sex therapist would the best place to help you.",
        "comment_o3": "First, treat this the same way you’d treat any compulsion that’s hijacking your time: remove easy access, add friction, and fill the vacuum with something that actually moves your life forward. Start tonight by wiping all saved porn from your phone and laptop, unfollowing the Twitter subs, and installing a blocker like Cold Turkey or BlockSite on every device. Give a friend the password or use a random one‑time generator so you can’t bypass it in a weak moment.Next, swap the bedtime cue. Right now arousal equals sleep because you’ve trained your brain that way. Pick a different, non‑sexual wind‑down ritual and commit to it for thirty nights. A paper book in bed, guided breathing on YouTube, or even boring finance articles will do—anything that tells your brain, “It’s sleep time, not porn time.” Go to bed and wake up at fixed hours, no screens in the bedroom, and caffeine only before noon. It’ll be rough for a week or two, then the new cue starts sticking.Daytime urges hit hardest when you’re idle or stressed. Keep the phone out of reach in lectures, take handwritten notes, and set 25‑minute focus blocks with a five‑minute stretch break. If the urge shows up, stand up, do ten push‑ups, breathe deep, and get back to work. Physical interruption breaks the loop.Confidence won’t magically return, but it does grow with reps. Lift weights three times a week, join Toastmasters or volunteer to read the next case study aloud, and track every small win in a notebook. Seeing proof that you can shape your body and speak in public starts dismantling the “I’m always the girl” narrative.If the fantasies still dominate, find outside accountability. A kink‑aware therapist, SAA meetings, or the communities on r/pornfree and r/nofap are built for exactly this. You’re not broken; you’re caught in a reinforced habit loop, and thousands have climbed out of the same hole.Expect slips. When they happen, don’t spiral—log what triggered it, tighten your defenses, and keep the streak going. Give yourself 90 sober days and you’ll be shocked at how different your brain, sleep, and self‑image feel. Keep grinding—you’ve got this.",
        "comment_gpt4dot1": "First off, you’re not alone in struggling with this kind of habit, and it’s good that you’re reaching out for help. Breaking a porn addiction—especially when it’s tied to specific fantasies—can be tough, but it’s definitely possible with some structure and patience. The first step is to recognize your triggers. If you’re watching during lectures or before bed, try to change up your routine: keep your phone in another room during study time, and set a strict bedtime routine that doesn’t involve screens. Replace the habit with something else—reading, journaling, or even listening to music or a podcast can help distract your mind before sleep. It might also help to set small, realistic goals, like going one day without porn, then two, and so on. Track your progress and reward yourself for milestones. If you slip up, don’t beat yourself up—just get back on track. If you’re comfortable, consider talking to a counselor or therapist, especially since this is affecting your confidence and studies. You’re working on your master’s, which is a big deal, so try to focus on your long-term goals and remind yourself why you want to make this change. It’s a process, but with consistency, you can definitely regain control."
      }
    },
    {
      "id": "t3_xe53ud",
      "title": "[Need Advice] How to stop being extremely lazy and day dreaming, and instead focus on learning?",
      "body": "Hello, I am easily distracted in school. I am extremely lazy and would often day dream but I am extremely lazy.I have short-sightedness and would just use it as an excuse to not focus, but here's the thing. I would write down what I heard and google it, even when my vision is blurry.EXCEPT I STOPPED DOING THIS BECAUSE I'M REALLY LAZY, HOW DO I DEAL WITH MYSELF?",
      "comments": {
        "best_comment": "Since no one else is giving you serious advice… Learning is just like any good habit and it takes time to build good habits.  You need to force yourself to do things you don’t enjoy because you know that its for your own benefit anyway.Force yourself to study for 10-15 minutes at a time.  Do this multiple times a day, whether you feel like it or not.Soon the habit of studying starts to form and then you will be studying more often and it won’t seem so unpleasant after a while.But this doesn’t happen overnight.  Building habits take time.",
        "percentile_10_comment": "I'd recommend using a pomodoro timer! 25 minutes on, 5 min break.",
        "comment_o3": "First, get rid of the “lazy” label—it’s usually just a mix of unclear goals, friction, and zero systems. Start by removing the most obvious friction: book an eye‑test and wear the right glasses or contacts every single day. When you can actually see the board you won’t have that built‑in excuse to drift off.In class, keep doing what already worked: jot quick keywords, not full sentences, then Google or review them during a designated study block later. If writing everything feels heavy, set a tiny floor: commit to writing just one keyword per slide or five per lesson. Once you’re moving, momentum usually carries you.To stay present, run mini Pomodoros during lectures: tell yourself, “I’ll lock in for the next ten minutes, then I’m allowed a 30‑second stretch or doodle.” Short, timed focus sprints give your brain something concrete to beat instead of a vague “pay attention all period.”Put obstacles in front of the easy distractions. Phone stays in your bag across the room; if you need it for research, keep it on airplane mode until break. Sit nearer to the front so daydreaming feels more obvious.When your mind inevitably wanders, don’t fight it—just note the thought in the margin, then bring your eyes back up. Treat it like mental push‑ups; every rep strengthens focus.After school, spend ten minutes rewriting or expanding the keywords into proper notes while the material is still fresh. Ten minutes is short enough that you’ll actually start; once you’re in motion you’ll probably go longer.Stack a small reward to the end of that study block—playlist, snack, quick game—so your brain associates “did the work” with “good thing happens.”Finally, expect slip‑ups. Missing a session isn’t failure; skipping twice is. When you catch yourself coasting, reboot the very next class or day with the same tiny minimums.See clearly, lower resistance, add structure, reward effort, and the “lazy” story will fade on its own. Good luck—you’ve already proved you can do the habit; now it’s just consistency.",
        "comment_gpt4dot1": "Honestly, the fact that you used to write things down and look them up even with blurry vision shows you’re capable of pushing through obstacles—you just need to get back into that groove. Laziness isn’t a fixed trait; it’s more about habits and momentum. Try starting super small: commit to writing down just one thing per class, no matter what. Once you do that, let yourself stop if you want, but chances are you’ll keep going. Also, if you catch yourself daydreaming, don’t beat yourself up—just gently bring your focus back. It helps to set up little rewards for yourself after you finish a class or a study session, even if it’s just a 5-minute break or a snack. Over time, these small actions add up and make it easier to stay focused. And if your vision is making things tough, maybe talk to your teacher about sitting closer or getting materials in a format that’s easier for you to read. You’ve already shown you can work around challenges, so just start small and build from there."
      }
    },
    {
      "id": "t3_xr9mbt",
      "title": "[Need advice] How to develop study habits? Planing to go back to school after decades.",
      "body": "I plan to go back to school after decade. I need a career change, because my current job is just not it anymore. I've been out of school for so long, I don't know how to study anymore. I have one year untill I start and would like to start practicing \"studying\" now so I don't get burned out in the first semester.Any tips?",
      "comments": {
        "best_comment": "Read Deep Work by Cal Newport. Great book on how to study. Borrow from the library. Worth buying as well. Or download free pdf from pdfdrive dot net.",
        "percentile_10_comment": "I know it seems pretty obvious, but for me, studying two weeks ahead really helps in the long run. When you are ahead, you can afford to take breaks, be sick or whatever, without getting left behind by the piles of homework. And if you are behind, catch up!!! I have made that mistake before, and i was so behind that it was impossible to catch up, because i kept delaying it. And because of that, i had to restart my programme.Best of luck!",
        "comment_o3": "Start by treating “studying” as a daily appointment, not a heroic sprint. Pick a time you can reliably protect—30‑45 minutes is fine at first—and sit at the same place, with the same tools, every day. Consistency rewires your brain faster than marathon sessions do. While you’ve got a year, choose a free online course (Coursera, Khan, edX) that’s close to what you’ll face in school and move through it slowly. Watch a short lecture, close the video, and test yourself from memory before looking at your notes; active recall beats rereading for long‑term retention. When you want to keep facts, drop them into Anki or another spaced‑repetition app and run the deck for five minutes a day.  Use a simple Pomodoro timer—25 minutes of focused work, 5 minutes of walking or stretching—to train attention stamina. If you complete two Pomodoros, log it in a notebook; the growing chain of checkmarks is its own motivator. Each Sunday, scan the log and decide what the next week’s target is: maybe one more Pomodoro, or tackling practice problems instead of just videos. Over time, you’ll slide up to two hours of honest focus without realizing it.  Finally, nail down the logistical stuff that trips returning students: a clutter‑free desk, cloud backups for notes, keyboard shortcuts, and a calendar that auto‑reminds you of deadlines. The technical friction you remove now is energy you’ll keep for harder material later. Millions of people go back to school in mid‑life and crush it; the ones who stick with a simple, repeatable routine end up feeling like they never left. Start small, show up daily, review weekly, and you’ll hit the first semester already warmed up.",
        "comment_gpt4dot1": "First off, props for planning ahead and giving yourself a year to get back into the groove. The good news is that studying is a skill you can rebuild with practice. Start small: pick a subject or topic you’re interested in (even if it’s not related to your future studies) and set aside 20-30 minutes a day to read, take notes, or summarize what you’ve learned. The key is consistency, not intensity at first. Try experimenting with different study methods—like active recall (quizzing yourself), spaced repetition, or teaching the material to someone else (even if it’s just out loud to yourself). Over time, gradually increase your study sessions and try to mimic the kind of work you’ll be doing in school, like writing short essays or solving problems. Also, pay attention to your environment—find a spot with minimal distractions and set a regular study time to build the habit. Don’t stress about being perfect; the goal is to make studying a normal part of your routine again so it feels less overwhelming when classes start. You’ve got plenty of time to ramp up, so just focus on steady progress. Good luck!"
      }
    },
    {
      "id": "t3_rnpw4g",
      "title": "[Need Advice] How do I overcome complacency?",
      "body": "Complacency for me is staying at the same area I am at, no matter if I am already good at this area. I want to grow in life, but in more areas than not, I feel like I am complacent and also procrastinate on achieving my goals and dreams. For this discussion, I would like some advice on how to overcome complacency and apathy in life, how do I make sure I am continually growing, and how do I continually get out of my comfort zone?",
      "comments": {
        "best_comment": "I agree with you. One of the reasons I have for getting out of my comfort zone is to not waste my life being mediocre and to really have a positive impact on the world. A lot of people have a midlife crisis because they are being complacent. I have other reasons too, but this is one of them.",
        "percentile_10_comment": "Why do you want to keep growing and get out of your comfort zone? This might seem like a strange question to ask, but different people will want this for different reasons. If you really want this then it can be extremely helpful to know why, exactly, you want it.",
        "comment_o3": "Complacency creeps in when the next step isn’t obvious or urgent, so the first move is to give your growth an address: pick one area you genuinely care about and define a clear, measurable target. “Read more” becomes “finish 12 non‑fiction books this year,” “get fitter” becomes “run 5 km in under 30 minutes.” Specificity creates friction against drifting.Once the target is concrete, forget about motivation and build a process that makes the next action automatic. Decide when, where, and for how long you’ll work on it, put it on your calendar, and treat that block like an appointment you can’t miss. If you can’t see exactly when you’ll practice, you’ll default to someday—which is when complacency loves to visit.To push your comfort zone without burning out, use the 85 % rule: most of the time stay in tasks you can do fairly well, but carve out 15 % of each session for something that’s just beyond your current ability. That sweet spot feels awkward enough to trigger growth but not so hard that you quit.Track progress visibly—whiteboard, habit app, notebook, whatever you’ll actually look at. A streak counter or progress graph creates tiny hits of momentum and makes plateaus obvious before they turn into months of inertia. If the numbers stop moving, tighten the feedback loop: shorter cycles of plan‑do‑review, maybe weekly instead of monthly.Accountability multiplies discipline. Tell a friend, join a subreddit challenge thread, or hire a coach. The goal isn’t shame; it’s an external nudge that reminds you you’re playing a bigger game than “I’ll do it when I feel like it.”Finally, protect your identity as a learner. Each time you show up—even for five sloppy minutes—tell yourself, “I’m the kind of person who trains daily.” Identity‑based framing lasts longer than adrenaline spikes of motivation. Keep accumulating those tiny votes for the growth‑oriented version of you, and complacency loses its grip.",
        "comment_gpt4dot1": "Complacency is super common, especially when you’ve reached a decent level in something and it feels comfortable to just stay there. One thing that helps is to set specific, challenging (but realistic) goals that push you just a bit beyond your current abilities. Instead of trying to overhaul everything at once, pick one area you want to grow in and break it down into small, actionable steps. Track your progress, even if it’s just a daily or weekly check-in, so you can see that you’re moving forward. Also, try to regularly expose yourself to new experiences or skills, even if they’re unrelated to your main goals—this keeps your brain in “learning mode” and makes it easier to get out of your comfort zone. Lastly, remember that discipline isn’t about feeling motivated all the time; it’s about building routines that make growth automatic. Even on days you don’t feel like it, doing something small toward your goals keeps the momentum going."
      }
    },
    {
      "id": "t3_u0xcin",
      "title": "[Need Advice] 23 year old female with a 6 figure software engineer job. Just bought a condo. New at my job and fortunately that let's me get away with barely doing any work but ... getting increasingly nervous that I can't perform.",
      "body": "First thing first. Imposter syndrome is kicking my ass. I remind myself constantly that it's okay not know how to do things and ask a lot of questions, but I need so much hand holding. I feel so much panic. On top of that, I'm dealing with learning how to be a better person, friend and partner. And I have a place I'm getting in order. I get bursts of motivation but I feel like I am procrastinating so often. I know they're going to realize I am not doing shit and I am worried about my job. I used to be able to sit for hours and study math or make art. Maybe because I felt good at it? But I could figure things out and perfect things for so long but my patience and tolerance feels like it is at a 0. Any book recommendations? I want to feel good at what I do and put the work in. I just... don't know what to do. And the good therapist I finally found after many shitty ones has ghosted me and I don't want to go through the process again. I feel like I'm so close to an amazing life with a job that gives me freedom to do other things. But I feel like I'm drowning and I'm so unconfident in my job. I feel like I'll lose it and will be stripping again. Sometimes I fantasize about that because I am good at it and I feel in control there.",
      "comments": {
        "best_comment": "Congrulations for your Job! In my opinion small daily routines  gives best outcome. Waiting for inspiration, motivation  boom  generally not sustainable. I am also a software developer sometimes I cant help myself and giving up my tasks. But when i start daily fixed routine  i feel more organized and productive. I told my self first thing in the morning do some coding job Just for 5 minutes if dont like you can give up. I did this every day now i feel more productive. I can suggest meditation. It clears mind and atomic habits book.",
        "percentile_10_comment": "As a 25 year old who's already studying for quite some time with a new job as ABAP developer I know exactly what it feels like. I'm scared of failing exams, imposter syndrome at work.Since i'm working fully remote they cannot really track my working time nor progress. I'm not really getting my work done in a appropriate time...But... I noticed that if I have any appointment (Uni, work, friends, sports) i'm much more reliable.Maybe it is a good idea to find someone to have a work-meeting with for set times. So you see eachother working and can casually talk with about problems (and all software engineers know... we have A LOT of problems). I don't even mean a colleague from work. Just anyone! Maybe that is going to help you as well? :)",
        "comment_o3": "First, remember that every junior engineer I’ve met feels like they’re faking it. The folks who grow are the ones who turn that anxiety into a system. Start keeping a running “question log” in a plain text file: every time you hit a wall, write the question, spend 30‑60 minutes trying to answer it yourself, then take it to a teammate or Stack Overflow. Add the answer right under the question. In a month you’ll have your own mini‑wiki and you’ll notice how many things you can now answer solo.Block one or two uninterrupted “deep work” hours on your calendar each day. Mute Slack, close email, set a timer for 25‑minute sprints (Pomodoro), and pick one bite‑sized task: reading a design doc, fixing a tiny bug, writing a unit test. Ship or document something tangible by the end of the block. Visible output calms impostor nerves and gives your team confidence in you.Outside those deep hours, be noisy in a good way: leave comments on PRs, ask clarifying questions in chat, volunteer for small chores. You’ll build a reputation for engagement long before you feel “expert.”At home, treat life admin like code sprints: pick one condo task per weekend morning, set a two‑hour cap, and stop when the timer ends. Consistency beats marathon cleaning.Books worth skimming: “Atomic Habits” for building tiny, repeatable routines; “Deep Work” for protecting focus; “The Making of a Manager” (even if you’re not a manager) for understanding how good work is scoped and delivered. Don’t binge‑read—apply one idea the same day you read it.If therapy’s on pause, try a low‑stakes “mental health stand‑up” with a friend once a week: what went well, what was hard, what’s the next small step. It scratches the accountability itch until you find a new professional.Finally, keep the stripping fantasy in perspective: it shows you miss feeling competent and in control, not that you actually need to quit tech. Give yourself three months of the systems above before you judge your performance. You earned the offer; now build routines that prove it to yourself. You’ve got this.",
        "comment_gpt4dot1": "Honestly, you’re in a spot a lot of people dream about, but that doesn’t make it any less overwhelming. Imposter syndrome is super common, especially in tech, and it’s actually a good sign you care about doing well. The fact that you’re asking questions and trying to learn is exactly what you should be doing as a new hire. No one expects you to know everything right away, and most people are too busy with their own stuff to notice every little thing you do or don’t do.For discipline, try setting really small, specific goals for each day—like “I’ll read the docs for 20 minutes” or “I’ll clean one room.” When you finish, let yourself be done. Consistency beats intensity, especially when you’re building confidence. If you’re procrastinating, it might help to use a timer (like Pomodoro: 25 minutes on, 5 off) to get started, since the hardest part is usually just beginning.Book-wise, “Atomic Habits” by James Clear is a classic for a reason—it’s all about making tiny changes that add up. “Deep Work” by Cal Newport is also great for focus, especially if you miss those long, productive sessions from before.It’s normal to miss things you felt good at, but you can get that sense of mastery back by sticking with the uncomfortable stuff a little at a time. You’re not behind, and you’re not alone in feeling this way. Keep showing up, keep asking questions, and remember that progress is messy. You’ve already done hard things—this is just another one."
      }
    },
    {
      "id": "t3_rygxb9",
      "title": "[Need Advice] How do I un-fuck my life?",
      "body": "So I'm 18, no job, and I kinda fucked up my college life. I haven't done a single thing for the first semester of college and now my second semester is coming up in a few days, and now one of my scholarship funding sources are asking for my grades. WHAT DO I DO?!You might be wondering how this happened...well...I have a severe hentai addiction. I've gotten into this terrible procrastination routine where I pleasure myself, then play a video game, then eat, then sleep, pleasure myself some more, then repeat that cycle the next day. My question is, how do I stop? I've tried P0rn blockers, but because how easy it was to turn off the blocker to watch my \"content\", I built a habit of disabling the blocker before going onto my computer, rendering it worthless.Another problem is whenever I work myself up to not watching the content, my day filled up with other distractions like video games.Even when I had a day with absolutely zero distractions, no games, no h3ntai, and the perfect working environment, I had this odd habit to walk out of my room and around the kitchen, maybe grab a snack, or I would just go to sleep. I don't understand why I do this. For the work environment, I do use a basic kitchen chair, which I'm not sure if that has something to do with it as they're not designed to sit at a computer desk for hours.Now back to my college stuff. I can slowly work on self-improving and my procrastination later (ik that sounds counterintuitive), but seriously, I don't know what to say to my dad. I can't just say \"I didn't do a single one of my assignments and I basically scrapped my entire first semester\", and I most certainly can't say that to one of my primary sources of scholarships. What tf do I do? On top of that, I have severe social anxiety. Many of the comments are gonna say \"just do it\", but it doesn't work like that.For stopping my procrastination, I'm getting a little into Atomic Habits, but I've even found myself procrastinating in my anti-procrastination. Could I get some strong advice for someone who has suffered through a strong addiction of some sort?Edit: Should I skip this second semester entirely to fix myself before I get back to college? ",
      "comments": {
        "best_comment": "I do a LOT better if I study on campus in the library, rather than at home around my home computer. It’s so hard to work at the place I also play games (and more lol).",
        "percentile_10_comment": "Sounds like you could have ADHD.",
        "comment_o3": "First priority: stop the academic free‑fall. Go to your school’s advising or registrar office tomorrow, in person, and ask about a late withdrawal or leave of absence for last semester. Schools usually have a process that lets you wipe F’s off the transcript if you can document a medical/mental‑health issue; at worst they can tell you the deadline and your exact GPA situation so you know what you’re dealing with. While you’re there, ask what would happen to your scholarship if you sit out a semester—get facts before making the decision. That information will make the conversation with your dad and the scholarship provider a lot easier, because you can present a plan instead of just a confession: “I had a rough first semester, I’ve spoken with the school, I’m taking a leave/retaking the classes, here’s the timeline and what I’m doing to fix it.”Second, treat the porn loop like any other compulsive behavior: remove frictionless access and add frictionless alternatives. Put your gaming PC/console in a common area or box it up and leave it at a friend’s for a month. Install blocking software that only a friend has the password to. Use your phone or a library computer for schoolwork so you can’t alter the blocker. When the urge hits, stand up, leave the room, and do ten push‑ups, walk outside, or open your textbook—teach your brain that the cue leads somewhere else. If you relapse, no moral drama; log it and reset the counter.Third, shrink your study sessions to something you cannot refuse. Literally set a timer for five minutes, open the syllabus, and start. When five minutes are up you can quit—most of the time you’ll keep going. Pair that with a hard daily cutoff: once it’s 6 p.m. you’re done for the day, no guilt, which prevents the “I wasted the morning so the day is ruined” spiral.Fourth, get humans involved. Book an appointment with campus counseling (or a local therapist if you pause school). Tell one friend what you’re trying to fix and text them a photo of your study space each time you start a session—accountability doesn’t have to be deep, it just has to exist.Taking a semester off can work if you treat it like rehab, not vacation: structured schedule, part‑time job for routine, counseling, daily exercise, and clocked study blocks to retake or prep classes. Gather the facts from your school first, then decide. Whatever you choose, move on it this week—the sooner you act, the smaller the mess gets. Good luck; lots of people have dug out of deeper holes than this, and the common denominator is facing it early and systematically.",
        "comment_gpt4dot1": "First off, you’re not alone in this—lots of people hit a wall in their first year of college, and it’s not the end of the world, even if it feels like it right now. The most important thing is to face what’s happening head-on, even if it’s uncomfortable. For your dad and the scholarship, honesty (without oversharing) is usually the best policy. You can say you struggled with motivation and time management, and you’re working on getting help and making changes. It’s better than letting them find out on their own or making excuses that fall apart later.About the addiction and procrastination: blockers and willpower alone rarely work long-term. The key is to change your environment and routines so it’s harder to fall into old habits. If your computer is the main trigger, try moving it to a more public space or limiting your access to it during certain hours. Replace the “pleasure-then-game” cycle with something else—literally anything that gets you out of your room and moving, even if it’s just a walk or a quick workout. The urge to wander or nap when you’re supposed to work is super common; it’s your brain dodging discomfort. Try the “2-minute rule” from Atomic Habits: commit to just two minutes of the task, then see if you can keep going. Sometimes just starting is the hardest part.As for skipping the semester, that’s a big decision. If you’re truly not ready and you have the option, taking a break to reset can help, but only if you use that time to actually work on your habits and mental health—not just to escape. If you stay, set super small, realistic goals for each day, and don’t expect perfection. Progress is messy.Lastly, consider talking to a counselor at your school—they’ve seen this before and can help you figure out next steps. You’re 18, you’ve got time to turn things around, and the fact that you’re asking for help is a solid first step. Don’t try to fix everything at once; just focus on the next right action. You got this."
      }
    },
    {
      "id": "t3_p89z6k",
      "title": "[Need Advice] Why do I find myself going on social media overdrive after a long hard day of work?",
      "body": "After completing 16 solid hours of productive analytical work, instead of hitting the sack, I go into manic scrolling mode.. Instagram, TikTok, Facebook, Reddit, becoming increasingly awake and energetic till 2am, effectively ruining my next day. Why is this happening ? How can I stop this?Update: Thank you for insightful comments and great recommendations! I am super grateful for the effort that you guys have put in your replies. I’ve learnt new perspectives from every single comment. This is awesome. Thank you once again 🥰To summarize 1) Go on dopamine fasting. Rewire my brain to get used to lower doses of dopamine hit. Swear off social media2) Replace downtime with something constructive, that I can grow over time. Be deliberate about what the replacement activities are before going on dopamine fast. Examples of replacement activities are reading, journaling, exercising, learning a new language, trying to make art…3) Examine what is causing me to get into social media apps, beyond the dopamine factor. Social media is not my support network. Few books mentioned are Wilpower instinct, Atomic habits, Digital Minimization, the Molecule of more 4) Out of sight out of mind. Keep the phone away, set limits on usage, put on grey mode, tell my brain that I am not missing out anything. Love this quote \"If it's not what you want, are you really sacrificing anything by not doing it?\"",
      "comments": {
        "best_comment": "It is called Revenge Procrastination. Your body (and the body part of your mind, some call it the subconscious) has an idea about a certain amount of free undisciplined time they are owed every day. Once you get your work hours in, try and plan your undisciplined time ahead and stick to it. For eg. I cook a great meal and eat it. That seems to calm things down and it is a win in terms of health and getting my mind ready for the next day. Or you can watch a good movie. Select the movie ahead of time and don't sit in front of Netflix and hit the remote - Netflix algorithms are tuned to push you into long-running and addictive TV series, next thing you know you will be sitting there and it is past 3 am. Workouts are a great way to relax, but the body-mind knows that this is a sort of discipline and often doesn't get the same amount of relaxation points as say a movie or a dinner. If you think you can skip this and get another extra 3 hours out of your day - you will be mistaken and this will be reflected in the next day's productivity which will be not as much as today, even if you sitting at the desk the work might not be in peak mental performance. TLDR: Take breaks, relax. But more importantly, PLAN the break time and the type of relaxation activity you will be indulging in.",
        "percentile_10_comment": "I’m pretty sure the quote they are referring to is the explanation given in the documentary ‘A Social Dilemma’. In it, they do explain the effects of social media scrolling and how it’s akin to slot machines. Here’s a partial explanation by Tristan Harris, an ex-employee for Google who worked as a design ethicist, and is one of the drivers of the documentary:“Each time you’re swiping down, it’s like a slot machine,” he says. “You don’t know what’s coming next. Sometimes it’s a beautiful photo. Sometimes it’s just an ad.” What slot machines and social media share are variable rewards.This feeds into the ‘pull to refresh’ function. Every time we pull down to refresh our timeline—whether that’s on Facebook, Twitter or even by email—we don’t know what we’ll discover. That could be a new email from work, lots of surprising ‘likes’ or even disappointment should there be nothing fresh to excite us. The downward-pull action, created by designer Loren Brichter, has been emulated across many different apps, and its ubiquity has become intuitive for its users. Being drawn into what’s called ‘ludic loops’—where a user is unsure whether they’ll receive feedback (or in the case of a slot machine, cash rewards) following anticipation—is what keeps us hooked. Or, as Harris says: pulling the lever.”Link: https://www.we-heart.com/2019/09/04/social-media-and-the-slot-machine/There’s a wide range of sources online that compare the striking physiological similarities between the rush you feel from slot machines and the rush you feel from scrolling and refreshing your social media. According to the documentary, it was built this way on purpose. As always take these things with a grain is salt, however the documentary is definitely interesting!",
        "comment_o3": "What you’re running into is a mix of revenge‑bedtime procrastination and simple decision‑fatigue. Sixteen hours of heavy thinking drains the part of your brain that says “go to bed,” so the autopilot seeks an easy dopamine drip. Fight it with structure, not willpower. Pick a hard stop for work, then schedule a short decompress window you actually look forward to—maybe 30‑45 minutes of music, a walk, or light reading. When that window ends, the phone goes on a charger in another room, social apps are blocked by something like Cold Turkey, and the bedroom stays screen‑free. Make the shutdown ritual as automatic as brushing your teeth: shower, dim lights, stretch, fiction book, sleep. If you still need novelty during the day, insert micro‑breaks—five minutes outside, quick chat, cup of tea—so you’re not starved for stimulation by night. A tired brain can’t win a fight against infinite scroll, but it never has to if the phone is out of reach and the evening is pre‑decided.",
        "comment_gpt4dot1": "Honestly, after 16 hours of intense work, your brain is probably desperate for something easy and stimulating, which is exactly what social media delivers. It’s like your mind is trying to “rebel” against all the structure and effort by chasing quick rewards. One thing that helped me was setting a hard cutoff time for screens—like, phone goes in another room at 10pm, no exceptions. I also started prepping a “wind-down” routine in advance: a book I actually want to read, a podcast, or even just a shower and stretching. The key is to make the alternative as frictionless as possible, so you don’t default to scrolling. If you slip up, don’t beat yourself up—just reset the next day. Over time, your brain will start to crave the new routine instead. Consistency > perfection. You’ve got this!"
      }
    },
    {
      "id": "t3_zs03uo",
      "title": "[Need Advice] I still live with my mom at 26. I have been trying to earn my independence but I feel like I’m on a treadmill. What do I need to change?",
      "body": "I (26f) still live with my mother (57f). I’m working on becoming independent but I’m doing something wrong because it’s not getting me anywhere. What is my problem? I’m so ashamed of how behind I am in life and how immature and dependent I am. I live at home, work part time (work reduced my hours), am taking one class at a local college (all I can pay for), and am applying for more part time work at other places. I live in Cleveland, so the rent is super high but still not cheap. I pay my mom 500 a month but that is it. My mom doesn’t work herself but does get alimony from her ex, my father (they split up 10 years ago, and we are pretty estranged), and her parents (my grandparents, who I am also not close to because they are devout Jehovah witnesses) pay for her/our rent. The $500 I pay actually covers rent for this big store front-turned-storage-unit with a bunch of stuff from our old house that my mom intends to sell but it’s been many many years (10+).I also obviously pay for any personal things like my clothes/money to go out. I also paid my tuition for one class at a local college. she still pays for my groceries and phone. I’m so embarrassed. She doesn’t want me to move out because she says I’m incapable of functioning and I’m trying to prove both of us wrong. I do housework, try to clean up after both of us, help her whenever I can, but I’m still basically a child and I hate myself for being so behind. I’m grateful, don’t get me wrong, but I’m incredibly ashamed of what it says about me that I am where I am in life.What am I doing wrong? Should I quit school? Should I just try to find better/more work? Or is it stupid to work shitty jobs without a degree. Should I get independence or a degree first?",
      "comments": {
        "best_comment": "I think you would experience less day-to-day stress if you simply let go of the narrative that you need to have it all figured out by now. You’re doing great. Just keep doing your best at whatever you set your mind to and maintain a growth mindset. You are already enough. Work on building healthy boundaries with your family, you might be taking on inherited generational trauma. Keep displaying the courage it takes to be vulnerable, like you did by sharing your story, and it will inspire those around you to do the same. Remember, you don’t need to set yourself on fire to keep others warm!",
        "percentile_10_comment": "I would get a job in construction. It's full-time, pays decent, and if you want to continue taking 1-3 evening college courses to work toward something, you can.You can probably find a roommate for the same $500 you pay your mom.She sounds toxic by telling you that you can't function without her - you can. If you are interested in any construction careers from concrete to carpentry to electrical, shoot me a PM and I can try to give advice if you're interested. I think beyond warehouse work, it's one of the fastest ways to a decent paying career with upward wage growth (apprenticeships, etc). Even drywall work is typically full-time work and good pay. The other fast track to decent income is sales work, but I think it's harder to find the right opportunity, and not everyone is suited for sales work.Construction gets you pretty disciplined, you have to show up on the jobsites early, most work starts at 7am, sometimes 6am, you finish at a respectable time, usually 3:30pm or sometimes you work later, you work a physical job in all weather conditions, you learn skills, work with your hands, and it helps self-confidence in almost everyone who starts.",
        "comment_o3": "First, stop beating yourself up. Twenty‑six with a part‑time job and one class is not a life sentence; it’s just your current snapshot. What you need most right now is a clear one‑year plan that gets you to a livable income and a realistic exit date, while keeping school moving in the background instead of letting it run the show.Income comes first because rent and groceries can’t be deferred. Treat “get to 35–40 hours a week” as Priority A. Apply daily, follow up every 48 hrs, and cast a wide net: retail, call centers, warehouse, temp agencies, hospitality, gig work—anything that starts paying quickly. Use Cleveland’s cost of living to your advantage; plenty of people your age share a house for $600–700 a month. If your current employer can’t give you hours, keep them only if the schedule flexibility helps school; otherwise swap them for a place that will.Once you hit full‑time hours, track every dollar for a month. You’ll see where $100–200 leaks out that could become an emergency fund. Aim to save one month of projected rent before you move; that’s usually enough to keep surprises from sending you back home.Keep school but keep it cheap. Fill out FAFSA, talk to the community college’s financial‑aid office, and see whether you qualify for the Pell Grant—many students in your income range get tuition covered and some money back for books. Take only courses that march you toward a credential employers actually ask for (nursing prerequisites, IT cert classes, accounting, etc.). Evening or online sections let you hold a job without stretching yourself to the breaking point. One or two classes a term is fine; the degree doesn’t matter if you can’t pay the bills.About the $500 storage “rent”: that’s a drain. Offer your mom something concrete—spend two weekends photographing, listing, and selling the items, then split the money and shut the unit down. If she refuses, explain that you’ll have to redirect part of that $500 to your moving fund. You’re not dodging responsibility; you’re reallocating it so you can stand on your own.Daily discipline can be as simple as a three‑line checklist: job hunt tasks, school study block, exercise/house chores. Hit those three and the day is a win. Review progress every Sunday night, adjust, and repeat. Momentum compounds.Independence before degree isn’t an either/or; it’s degree on low simmer while income and savings boil. Give yourself twelve months of focused effort, track the numbers, and you’ll be surprised how quickly the “incapable” label disappears. You’re not behind—you’re just at the starting line and finally facing the right direction. Now sprint.",
        "comment_gpt4dot1": "First off, you’re not as behind as you think—plenty of people are in similar situations, especially with the way the job and housing markets are right now. It sounds like you’re already doing a lot: working, taking a class, paying some bills, and helping at home. That’s not nothing. If you want to build more independence, focus on small, consistent steps. Keep applying for more work, even if it’s not your dream job—having more hours or a second job can help you save up and eventually move out. Don’t feel like you have to choose between school and work; lots of people do both, even if it’s slow going. If you can, keep taking classes, even just one at a time, because a degree can open up more options down the line. But if money is super tight, it’s okay to pause school for a bit and focus on work. The main thing is to keep moving forward, even if it’s gradual. Set small goals each week—like applying to X number of jobs, saving a certain amount, or learning a new skill. Over time, those add up. And don’t let your mom’s doubts define you; you’re already proving her wrong by trying. Independence is a process, not a switch. Keep at it."
      }
    },
    {
      "id": "t3_x6698s",
      "title": "[Need advice] How to to get rid of racist thoughts",
      "body": "Like the title says I’m very judgemental and racist. Eg: I’ll see a video on social media of a group of people doing something bad, first thing ill think to myself is stuff like “of course they are all (insert race)” or thats a very (race) thing to do. Also when I see protests or people defending a certain race I’ll think of reasons why they’re actually bad and discredit the protesters. I’m not vocal about it and have never told or posted my thoughts to anyone but I know its terrible and need to stop",
      "comments": {
        "best_comment": "I don't remember where I read this, but here's some insight from an internet stranger:The thoughts/opinions that best define you're character/personality  aren't your very first thoughts on a subject, but your second ones.The first opinions that come to your mind are usually snap judgements that involve little thought and so they tend to reflect close associations your brain has made, aka biases(even if they might not be logical), and so they are mostly determined by the environment you were raised in.On the other hand, the second opinions you form about a subject require you to put in some more thought into it, which forces you to be more rational in your judgement, because you can apply you're reasoning skills now.Therefore, your second thoughts on a subject are a much better reflection of character because they reveal how rational you are, and how much you let your own biases influence you.If you are already recognizing that you're initial reactions around poc are irrational and caused by your personal bias against them, then you are already going in the right direction.Good luck with your problem, and remember, everyone has their own biases, what's important is that you don't let them override your reason. Biases are just mental hurdles meant to be overcome.",
        "percentile_10_comment": "I had to tell my ex to STOP visiting horrible sites that were so anti-women, red-Pill-ish in nature. His horrible pre-judgements of women were disgusting. How I didn’t see it prior to dating shocks me. Needless to say, he still secretly consumed it like porn, and our relationship failed. Crazy. He was addicted to it. I wish I could remember what it was. It was a meme site generator with HORRIBLE, degrading comments. ifunny?",
        "comment_o3": "Catching yourself slipping into that mental shortcut is already step 1, so build on that with a discipline framework: every time the thought pops up, label it—literally think “stereotype,” then follow it with a pre‑rehearsed counter like “one clip ≠ a whole group.” That pause + replace combo is the same habit loop athletes use to fix form: cue, routine, reward. Keep a quick tally in a notes app; the act of logging keeps you mindful and shows progress.Feed your brain better inputs. Unfollow rage‑bait accounts and add material that spotlights people from the groups you judge doing ordinary or admirable stuff. Algorithms serve what you engage with, so you can re‑train them in about two weeks of deliberate clicking.Schedule weekly reps of perspective‑building: read a chapter of something like “Blindspot” or “How to Be an Antiracist,” watch a documentary that centers voices you rarely hear, or attend a local cultural event. Treat it like gym time—put it on the calendar, set a reminder, track completion.Finally, get proximity. Volunteer, join a mixed sports league, or take a class where you’ll have genuine collaboration with people you’re biased against. Real‑life interactions shred stereotypes faster than any amount of scrolling.Do this consistently for a couple of months and the frequency and intensity of those thoughts will drop. It’s just mental conditioning: identify the bad rep, replace it with a correct rep, and keep showing up.",
        "comment_gpt4dot1": "First off, it’s good that you recognize these thoughts are a problem and want to change—that’s a solid first step. Changing ingrained thought patterns takes discipline, just like building any other habit. One thing that helps is to catch yourself in the moment when you notice a racist or judgmental thought. Don’t beat yourself up, but pause and consciously challenge it. Ask yourself: “Is this fair? Do I actually know the full story? Am I making an assumption based on limited info?” Over time, this kind of self-interrogation can weaken those automatic reactions.Another practical thing is to intentionally expose yourself to positive stories, media, or experiences involving people from groups you’re biased against. The more you see people as individuals rather than stereotypes, the easier it is to break the habit. You can also try journaling your thoughts and tracking your progress—seeing improvement over time can be motivating.It’s not about being perfect overnight, but about consistently practicing better habits of thought. The fact that you’re not acting on these thoughts and want to change is a good sign. Keep at it, and don’t get discouraged if it takes time. Discipline is about showing up and doing the work, even when it’s uncomfortable."
      }
    },
    {
      "id": "t3_uu5woe",
      "title": "[Need Advice] I’m a 29-year-old male that has wasted 16 years of my life in video games, escapism, alcohol, and marijuana use, and feel so behind, I don’t know where to start.",
      "body": "I spent so many years of my life doing the bare minimum when it came to developing my life that I’m almost 30 and have nothing to show for myself. I feel like I’m still a lazy 16-year-old trapped in a 29-year-old body, and that’s the equivalent of how my intelligence feels sometimes, even though I’m for sure smarter than that. On top of that, I’ve relied on those around me to fill in the gaps in my finances as I worked entry-level jobs at minimum wage so I can masquerade as working hard for my future just to have zero control of my finances because I had terrible spending habits (I say had because I’m actively working on myself every day and over time have been making big progress). I suffer from depression because of the weight in which I judge myself. The only really great thing going for me right now is that I lost \\~100lbs since last summer, and I barely want to give myself credit for that because although it was hard work, I spent 3-4 days at a time just not eating and only consuming White Claws to keep me at baseline while I hung around the house and eventually hopped on the computer to spend the night on Call of Duty (that wasn’t that often, just a few week time frame, I did have a more healthy side to my diet than that). I enjoyed the dynamic of competition in video games because I didn’t have to physically compete (adding to my ever-so-growing laziness), I made deep connections with voices and personalities and not actual people in my real life that I can hang out with. I fell in love with computer-generated worlds and stories and wanted to be there more than in real life. I felt more satisfaction in achieving success in GTA than I did putting in the effort at any job because the paycheck was still going to be the same regardless. I feel like that's caused me to observe the world in a way where it's here for everybody else and that sometimes I just don't belong. Of course, though, my childhood had a huge playing role in why I am where I am today. I’m never sure of my next move, I’m usually unsure of my decisions and thoughts more often than being certain of the things I want and am after. My friends are all doing really well and seem to be about 10 years ahead of me in life. I don’t know how to structure my day, so in return, I don’t know if what I’m doing is enough or if I’m cutting myself short. I feel like all of my values are so out of whack and I want to take control of them. Unfortunately with gaming for so long and not having to physically apply myself, my brain became lazier over time, which caused me to just observe and not contribute (more so when I’d always watch movies and youtube through the years). I’m always way too critical of myself, I feel like I’m so far behind in life and it’s really uncomfortable and hard to come to grips with. It makes it uneasy for me to relax because I am confused and don’t know what career path to take, I feel that I need to have a genuine uninterrupted interest in something to be happy enough to truly pursue it with absolute drive. But I also grew up around siblings that are older than me and had a successful business that exposed me to a lifestyle of elevated living and dining with a careless mentality because I was in love with the life I had when I was with them, but I only saw the fun part of it and even though I spent a lot of time in the office spaces, I never really captured the perspective and idea that this lifestyle came from hard work and effort, and I didn’t witness the beginning years of the business and before when they were starting up because I was too young. Also, everybody moved away, my sister is in one southern state, one brother is in a western state, and my other brother is in the same state but we don’t really talk much anymore because of his own issues, unfortunately. Because I lived around enabling environments my whole life, it caused me to slip through the cracks and not get ahead like I was supposed to. I lived with my mother and sister for 19 years of my life. My mother was in a near-fatal car crash in her teens and suffered life-changing disabilities which caused her to become heavily addicted to pain medication and hard liquor. She couldn’t be there for me as much as she wanted because she gained a lot of weight over the years because of her addictions, she was in pain all the time and didn’t have the capacity to really be on my ass with school work and personal development like other parents did with their kids. And my sister wasn’t the most motivated person either, so that’s what I was surrounded by. My father was more of the one to push me academically, but my parents were separated and I only saw my father on the weekends. I just guess what I’m trying to say is I feel like I have all the right resources, but my scatter-brains prevent me from seeing a clear, direct path on how to take initiative. My memory recall is hit or miss, and when I see a new perspective that helps me better understand things, I lose it the next morning when I wake up, which can result in me feeling depressed because I can’t continue to operate in that same perspective. I’m not sure, but I think that causes me to not take the initiative with anything as a result, maybe I disguise that as being lazy. Also, my apologies for being all over the place, I guess since I was lazy with education, I never really learned how to structure my thoughts properly to formulate a coherent body of text. One last thing, I realize people tell me I’m way too in my head, which I agree about, but I can’t help it because my focus is so loose, my mind always takes over. How can I be more present, be a more active listener, and become much more aware of my surroundings?",
      "comments": {
        "best_comment": "PARAGRAPHS OP PARAGRAPHSHonestly though you’re probably better off than you think if you see the problems. Most people aren’t very self aware. Just put one foot in front of the other and don’t give up even when you have the inevitable setback or relapse.",
        "percentile_10_comment": "Video games can be harmful to professional development, yes. But it is also an emotional and social outlet. Not everyone needs to cut it entirely but I agree with the sentiment. Can be harmful and overused, like social media or the internet in general",
        "comment_o3": "First off, the 100‑pound loss is a huge win; don’t brush it aside. It shows you can stick with something hard and get results, which is exactly the muscle you need for everything else. Think of the next year as a “New Game+” run where you keep that willpower stat and start adding new skills.Pick one life area to push forward for the next 30 days and ignore everything else that’s nagging you. Most people in your spot get overwhelmed because they try to rebuild career, finances, social life, hobbies, and mental health all at once. The fastest route is sequential, not simultaneous. Because money touches everything, I’d start there: download a budget app, log the last three months of spending, and give every dollar a job. Even if the numbers look ugly, seeing them in one place turns an invisible enemy into a visible one you can fight.Lock in a daily rhythm that is dead simple, repeatable, and front‑loads the important stuff before your willpower leaks away. Wake up, drink water, make your bed, ten‑minute walk outside, five‑minute journal on paper, then the day can go any direction. Those tiny anchors keep your brain from spinning off first thing and build the “I keep promises to myself” identity. If you still game, park the console/PC in a closet or uninstall weekday access. Removing friction beats relying on willpower over and over.On the career side, forget The One Perfect Passion. Pick any skill that pays reasonably well and has a clear learning path—coding bootcamp, HVAC apprenticeship, forklift cert, whatever sounds least awful—and treat it like grinding XP. Two focused hours of study or practice five days a week will outpace most people in six months. If analysis‑paralysis hits, flip a coin and commit; motion beats mental churn.You mentioned alcohol and weed; those make depression worse and memory fuzzier. Try a 30‑day zero‑tolerance experiment. Tell yourself it’s data collection, not a life sentence. Track mood, energy, and sleep. Most people feel noticeably sharper by week three, which makes every other habit easier.Socially, aim for one real‑life interaction per week that isn’t family or coworkers: a pickup basketball game, volunteer shift, library class, whatever. Face‑to‑face time pulls you out of your head and reminds you the world is bigger than your thoughts. You do not need instant deep friendships; you just need reps.Finally, therapist or support group is a force multiplier. You’re untangling family baggage, addiction, and self‑talk—there’s no prize for soloing that dungeon.If you stay consistent with a budget, a morning micro‑routine, a single marketable skill, and thirty days sober, you’ll be stunned how different life feels by your 30th birthday. Small, boring wins stacked daily beat the huge, flashy overhaul you keep waiting to start. You already proved you can do hard things; now make them the right hard things. Good luck, man—see you on the leaderboard.",
        "comment_gpt4dot1": "First off, give yourself some credit for the progress you *have* made—losing 100lbs is no small feat, and actively working on your spending habits is a big deal. It’s easy to downplay those wins, but they show you’re capable of real change. Feeling behind is super common, especially when you compare yourself to others, but the truth is, everyone’s timeline is different and you’re not “too late” to start building the life you want.If you’re struggling with structure and focus, start small. Pick one or two things you want to improve—maybe it’s getting up at the same time every day, or setting aside 30 minutes to learn something new or work on a skill. Don’t try to overhaul your whole life at once; consistency with small habits builds momentum and confidence. Write down what you want to do the night before, even if it’s just “wake up, shower, eat breakfast, read for 10 minutes.” Crossing things off helps you see progress.For being more present and less in your head, try grounding techniques—when you notice your mind wandering, focus on your senses: what you see, hear, or feel in the moment. Practicing this during conversations can help you become a better listener and more engaged with the world around you. Meditation or even just a few minutes of deep breathing can help train your attention, too.As for career direction, it’s normal to feel lost, especially if you haven’t had a chance to explore much yet. Try out different things, even if they’re just hobbies or side gigs, and pay attention to what actually feels rewarding. You don’t need to have a grand passion right away—sometimes interest grows as you get better at something.Finally, don’t beat yourself up for your past. You can’t change it, but you *can* decide what you do next. Progress isn’t linear, and setbacks are part of the process. Keep showing up for yourself, even in small ways, and over time you’ll build the discipline and self-trust you’re looking for. You’ve already proven you can do hard things. Keep going."
      }
    },
    {
      "id": "t3_vpyfhz",
      "title": "[Need Advice] Strong pull toward inaction when it comes to doing unpleasant activities.",
      "body": "For example, cleaning my room or organizing. I'd legitimately rather stare blankly at the wall for an hour than get started on it. In fact I've done just that before.I realize it will ultimately come to \"just find a way to motivate yourself to do it or form a disciplined routine around it etc etc\" which is fine. But ideally I'd like to stop my mind from having that reaction to begin with. Is there any way to eliminate the pull toward doing nothing instead of something?",
      "comments": {
        "best_comment": "Here’s the thing - it’s totally normal. Procrastination is a reaction that’s stems from fear. So normally people talk about flight or fight but there’s also freeze, and that’s often how procrastination manifests. When you think of doing something, you avoid it or just get locked up. Your reaction toward something that sucks - is just your “lizard brain” reaction.One of the big key pieces of overcoming it is being compassionate toward yourself. When you say I’m an idiot, I’m lazy, I’m scared, I’m a pussy, or any number of self-destructive things it makes the feeling worse because you then feel guilt or shame which makes you even more reluctant to do the task.So here’s the tips:1. Show yourself compassion and say (either in your head or out loud-it’s up to you) I’m afraid, scared, anxious about this thing, whatever it is.2. Think of the positive aspects of your personality - you’re smart, capable, hard working, or whatever it is that you believe is good within you.3. Tell yourself it’s sucks but you can do it. Not necessarily that you believe in yourself or philosophically… but rather functionally that you are capable of the task - period. Telling yourself you can do but removing the emotionality of the task helps removes/reduce the emotional emotional aspects that causss anxiety, stress, etc.4. Just start. Tell yourself you’ll do it for 5 minutes. Make the goal small, quick, and not necessarily the entire thing you want to do. Putting on a distraction like tv or music can help - but avoid the internet or phone or something that’s likely to suck you in.5. When you hit five minutes you might either be like “thank god it’s over” or “I can keep going”. If you say “thank god, it’s over…” try to push through again by going back to the original steps. Show yourself self-compassion, tell yourself your strengths, tell yourself you’re more than capable, and just start again.Eventually it becomes a habit - which is key to it and helps make it less of an obstacle in the future.",
        "percentile_10_comment": "I realised recently my messy room was a coping mechanism. I found it hard to clean up because a messy room was a barrier to entry when I was younger (nothing too sinister just a method of protecting my privacy) maybe you have a similar situation. How far back is your room messy and what did your childhood self feel about the mess",
        "comment_o3": "I get the same “blank‑wall” pull sometimes, and what helps is shrinking the task until starting feels almost silly to resist. Tell yourself you only have to pick up one sock, or set a two‑minute timer and stop when it dings. Starting is the real hurdle; once you’re moving, momentum usually takes over.  Prep the environment so “doing something” is the default. Keep a trash bag open, leave the hamper in the middle of the floor, put the cleaning spray on the dresser—anything that removes the micro‑friction of hunting for tools.  Give your brain a small reward while you work. Play a podcast or playlist you only listen to when tidying; it turns the session into something you partly look forward to.  The urge to do nothing never vanishes, but these tricks let you slip past it before it gets loud. Over time, the reps train your brain to see “just start” as the automatic response instead of “freeze.”",
        "comment_gpt4dot1": "Honestly, that pull toward inaction is super common, especially with tasks that feel boring or overwhelming. The trick isn’t to eliminate the feeling (because it’ll probably always pop up), but to make it easier to act despite it. One thing that helps is lowering the activation energy—tell yourself you’ll just clean for 2 minutes, or only pick up 5 things. Once you start, it’s way easier to keep going. Also, try to make the task less unpleasant: put on music, set a timer, or reward yourself after. Over time, if you consistently act even when you don’t feel like it, your brain starts to expect action instead of avoidance. It’s not about never feeling resistance, but about building the habit of moving through it."
      }
    },
    {
      "id": "t3_124xh6v",
      "title": "can a 37 yo man change his life? [need advice]",
      "body": " so i only have 1.25 US dollars to spend on food today, i cant afford anything else. How did i let my life go to the trash can like this? can i change it now? im certainly gonna try...",
      "comments": {
        "best_comment": "Some people only live to 50 years old. But what if you live to 87? You could live as if today is your first day. That's something I tell myself when I get overwhelmed with decisions I've made or my circumstances. Like others have said here, connect with social services, reach out to friends and family for help, be genuinely thankful for any generosity you receive to those who share it with you. You can find a job, find purpose and be a blessing to others. It's certainly not too late!! You can look back one day on this time and thank the 37 year old you for making some good decisions. One day at a time, and try to find inner peace along the journey. You got this!!",
        "percentile_10_comment": "You can do absolutely anything amigo.  The only limit is your mind.    You have some inertia to overcome. But,  If you commit to your dream more than your nightmare you can bring it to life 🙏🏼🔥",
        "comment_o3": "Absolutely you can change, and it starts with the next tiny decision you make. First, stretch that $1.25: a bag of dried beans, rice, or oatmeal from the discount aisle will keep you fuller than a candy bar or soda. If there’s a food pantry, church, or community fridge nearby, swallow the pride and grab what you need; you can pay it forward later.Tonight, grab paper and list two things: every cent you have or expect to get this week, and every unavoidable expense. Seeing it in black‑and‑white kills the fog. Now circle the single biggest lever you control—usually income. Tomorrow your “discipline rep” is applying to one gig, day labor site, or side hustle, even if it feels beneath you. Repeat that rep every day. Momentum is more important than the size of any one win.Add one habit that costs nothing and builds self‑trust—push‑ups, a ten‑minute walk, reading one chapter at the library—whatever you’ll actually do. Check it off each day. When life feels chaotic, that small daily promise keeps your head above water and builds the muscle you’ll use to handle bigger goals.Plenty of people have rebooted their finances and lives well past 37. The pattern is the same: survive the day cheaply, track the numbers, make one move to raise income, and stack a tiny self‑respect habit. Do that for a month and you won’t recognize yourself in a year. You got this.",
        "comment_gpt4dot1": "Absolutely, you can change your life at 37. Plenty of people have turned things around at all ages, and the fact that you’re willing to try is a huge first step. When things are tough financially, it’s easy to feel stuck, but discipline is built in small, daily actions. Start by focusing on what you can control today—maybe that’s looking for free local resources (like food banks or community meals), or setting a tiny goal like applying to one job or learning a new skill online. Even if progress feels slow, consistency adds up. Don’t beat yourself up for where you are; use that energy to take one small step forward each day. You’re not alone, and change is possible, even if it’s just one decision at a time."
      }
    },
    {
      "id": "t3_vx6uct",
      "title": "[Need Advice] I just turned 31 and my life is a *huge* mess.",
      "body": "Hey guysI’m a 31-year-old man and I’ve reached a point where I’m at my wit’s end and I just don’t know what’s wrong with me or what to do.I’m just going to list the big issues in my life and hope that someone can offer up some advice. Here goes:* **I’ve never been able to finish a degree.**     * I’ve started and dropped out of three courses since I was 18.   * I’ve finally made it through \\*most\\* of a law degree. I have just 6 months remaining (after taking a 2-year break) but cannot bring myself to study AT ALL.* **I constantly feel exhausted and low in energy.**     * I’ve felt “sluggish” my whole life. I process information and learn slowly, I’ve never been able to just get sh\\*t done.   * I have serious sleep issues and can rarely fall asleep before 3am.   * Even when I can get a decent sleep, I wake up feeling unrefreshed.   * My weight has fluctuated a fair bit my whole life. I'm pretty fat now and despite eating very healthy I can't lose any weight this time.   * I’ve been diagnosed with ADHD and I’ve been trying different meds for almost 2 years but nothing has made a difference.* **Zero motivation**:     * I have a full-time job (I’m studying part-time) and I constantly feel on the verge of being fired because I’m hopeless at deadlines and have no motivation to do the work they pay me to do.   * I have big dreams but just feel too lazy to achieve anything. I want to do well and meet my goals so much, but something is holding me back and I just feel paralysed.* **I feel socially weird**     * Work meetings, for example, are a huge source of anxiety - even though people seem to think I’m normal and outgoing. I have the same issues with attending classes.* **I constantly feel like the dumbest person in the room**     * I have a reputation got being smart and everyone seems to think I’m smart, but I feel like I’ve just fooled everyone because, to be honest, I feel like I don’t understand things 99% of the time.* **My apartment and my finances are a f\\*\\*king mess**. My bedroom is disgusting (to the point of being unsanitary) and I have debt collectors after me.**TL;DR:**For a grown who is seen by most people as intelligent, together and competent, my life is secretly a damn mess. I’m always tired and have zero motivation to do anything. Please help me!Thanks so much :)",
      "comments": {
        "best_comment": "Hey, congratulations for expressing yourself, you can be proud of you. That's not an easy thing to do. In my opinion, you lack of self-esteem and self-confidence. Only you can know why and how to improve it. You'll find what's best for you. To know what's best, you have to compare, in order to compare, you have to try different things. Pick what works for you, leave what doesn't. But remember that you become what you do, only actions are effective. And if you feel like not having the will power to try something you have never tried, it's either you evolve trying, or you remain the same. But you can't expect different results by repeating the same actions. It's gonna be a beautiful journey, don't lose faith in yourself. We all have deamons to fight, keep grinding, keep shining. Peace",
        "percentile_10_comment": "I feel like getting to the heart of your sleep problems will help a lot with almost everything else on this list? Like if you can, find some way to access a sleep specialist, spend some money on it if you can, really try to get a decent sleep schedule. Try everything you can, this matters a lot. Sleep is so so so important for physical and mental health. It won't magically fix everything, but I feel like it's a good first step.",
        "comment_o3": "Quick wins first, then bigger moves.Start with sleep. Everything you wrote (energy, focus, weight, mood) gets worse when you’re chronically underslept. Pick a single, non‑negotiable wake‑up time that gives you 7–8 hours if you were asleep by 2 a.m. Even if you lie awake, get up at that set time; the mild pain trains your body to fall asleep earlier within a week or two. Kill screens and bright lights 60 min before bed, caffeine after noon, and alcohol on study nights. If you snore, wake up gasping, or feel dead tired no matter what, ask a doctor about sleep apnea—tons of “overweight, always tired, ADHD that meds don’t fix” folks discover that’s the real culprit.Next, create a 30‑minute morning “launch sequence.” Water, quick stretch, meds, review today’s three priorities, 10‑minute apartment tidy. That little clean‑up stops the shame spiral and gives you a daily victory before work.For ADHD productivity, treat tasks like reps at the gym: short, counted, and timed. Use a 25/5 Pomodoro timer and aim for just two of those before lunch. Put your phone in another room, open only what you need, and start with something that takes five minutes to finish so your brain gets the dopamine hit. Momentum matters more than ambition right now.The law degree feels huge because it’s undefined. Break the remaining six months into weekly deliverables (e.g., “Read and outline Chapter 3 cases by Friday”). Track them on a wall calendar you can physically mark. When you hit four weeks of green X’s, reward yourself with something guilt‑free.About work: spend the first 15 minutes of every day writing the ONE thing that will get you fired if you ignore it. Do that first. Email your boss a short “Here’s what I’m on today” note; light accountability works wonders, and they’ll likely appreciate the visibility.Finances: open a spreadsheet tonight, list every debt, minimum payment, and interest rate—ugly truth on one page. Tomorrow call each collector and set up an autopay plan. Once a payment schedule exists, the mental noise drops dramatically.The apartment: set a timer for 10 minutes after work and fill one trash bag. Stop when the timer rings. Repeat daily. Small doses bypass the overwhelm and, inside a month, the place will look completely different.Finally, don’t try to “feel motivated.” Act first, mood follows. Keep the commitments tiny, track them visibly, and stack small wins. Six months of steady, boring reps will rescue the degree, calm the job situation, clear the room, and shrink the debt. You’ll still be you—just a version that finishes things. Good luck, man.",
        "comment_gpt4dot1": "First off, you’re not alone—so many people feel like they’re barely holding it together, even when they look “successful” from the outside. The good news is, you’ve already done the hardest part by being honest about where you’re at and wanting to change. Here’s what I’d suggest: forget about fixing everything at once. Pick one small, concrete thing you can do every day, even if it feels almost stupidly easy. For example, make your bed every morning, or spend 5 minutes tidying your room, or set a timer for 10 minutes of focused study. The point is to build momentum and prove to yourself that you can follow through, even in tiny ways. Once that’s a habit, add another. For sleep, try to get up at the same time every day, even if you didn’t sleep well—consistency helps reset your body clock over time. For ADHD, meds aren’t magic, but structure and external accountability can help a lot. Use reminders, alarms, or even ask a friend to check in on your progress. As for the law degree, break it down into micro-tasks—like reading one page or writing one paragraph—and don’t worry about the big picture for now. If you’re overwhelmed by your apartment, set a timer for 5 minutes and just start with one corner. Progress is progress, no matter how small. And if you can, talk to a professional about the exhaustion and sleep issues—sometimes there’s a medical piece that needs attention. You’re not lazy or broken; you just need a system that works for you. Start small, be consistent, and don’t beat yourself up for setbacks. You’ve got this."
      }
    },
    {
      "id": "t3_ow4ft3",
      "title": "[need advice] I don’t know what to do after I get out of bed",
      "body": "I can get out of bed sure but I don’t have anything to do I’m on summer vacation I’m 15, but I have barely any responsibilities all I do is workout, do a few quick chores and off I’m scrolling on YouTube I listen to music as a hobby but i want more hobbies I just get up late because I don’t have much to do help",
      "comments": {
        "best_comment": "Maybe try to add a couple hobbies to spend 30-60min every day on? Read a book. Maybe learn the guitar or keyboard or another  language. Take a bike ride or run/walk every day. Try woodworking or building things. Offer yard or car washing services in your area to make some $. Just some ideas :)",
        "percentile_10_comment": "Since you're in high school try volunteering at local areas, it helps with colleges and keeps you active",
        "comment_o3": "Make tomorrow’s plan tonight. Before you go to sleep, grab a piece of paper and block out the next day in hour‑long chunks: wake‑up time, workout time, breakfast, chores, free time, etc. Leave some blank space but give each block a label, even if it’s just “read for 30 minutes” or “walk around the neighborhood.” When you wake up, you won’t need to decide what to do—you’ll just look at the list and start.  If you want new hobbies, treat them like experiments. Pick one that sounds interesting—guitar, coding with freeCodeCamp, sketching with a cheap pencil set, running a Couch‑to‑5K plan, whatever—and stick it in one of those blocks every day for two weeks. At the end of the two weeks decide: keep, modify, or drop it and test something else. Two weeks is long enough to see if it clicks but short enough that you won’t feel trapped.  Scrolling happens because it’s the easiest option, so make it slightly harder. Charge your phone outside your bedroom, use a site blocker on YouTube after a set amount of time, or set a kitchen timer for 20 minutes whenever you open the app. When the timer goes off, switch to your schedule.  You’ve already got a workout habit, which is great—treat everything else the same way: small, scheduled, repeatable. By summer’s end you’ll have tried a handful of hobbies, figured out which ones stick, and built the muscle of deciding your own day instead of letting the algorithm do it for you.",
        "comment_gpt4dot1": "Honestly, summer vacation is the perfect time to experiment and figure out what you actually enjoy doing. Since you already work out and do chores, you’ve got a solid base—now it’s about filling your day with stuff that feels meaningful or at least interesting. Try picking one new thing to try each week: maybe cooking a meal, learning a simple instrument, drawing, coding, or even volunteering somewhere local. You don’t have to commit long-term, just give things a shot and see what sticks. Also, setting a loose routine (like waking up at the same time, planning a morning walk, or reading a chapter of a book) can help give your days some structure. The key is to start small and not overthink it—just pick something and do it for 20 minutes. Over time, you’ll find what you like, and it’ll get easier to fill your days with stuff that isn’t just scrolling."
      }
    },
    {
      "id": "t3_xdxiuz",
      "title": "[Need advice] Has anyone successfully overcome or managed a schema against self-discipline?",
      "body": "Turns out I'm not just lazy, it's not just my ADHD, it's not just that I was spoiled, I've got some sort of childhood-induced massive aversion to discipline as a concept, from within or without. We're talking beyond attitude and effort and willpower. It's cost me every job and hobby I've ever had and it's cost me the love of my life. As soon as anything I do requires discipline to accomplish, the wall goes up and gets taller every day. I've been a game developer for a decade and I've never finished a game. I've been playing musical instruments and singing my entire life but I've never managed to learn sheet music or any scales or arpeggios on anything. Believe me I have tried. The trying never lasts long enough. The shame is overwhelming.I'm sick of not being good at anything. I'm sick of this abstract baseless fear ruling my life. How the fuck am I supposed to overcome a discipline aversion without discipline?! Has anyone conquered something this deeply rooted? What steps did you take?",
      "comments": {
        "best_comment": "I looked at how my life was going and instead of getting angry or resentful, I got motivated. I self-started motivation to build discipline, since the former will eventually give out and die as time goes on — as you seem to well know. I set my sights on smaller goals, rather than large ones like writing a book, earning a certification, fixing everything wrong with my house. I started small. I committed to studying every day for at least an hour. I committed to journaling every morning, writing something reflective, no matter how long it was. I committed to completing simple steps of my projects when I had the time. I committed to reading one chapter of a book per day instead of gaming my free time away. Now, I have the discipline to get up early and journal. I finished a novel and started the second one. My house to-do list is more limited by money than by my discipline and motivation. I’m closing in on a certification, after which I will seek another one.I struggle with ADHD and a natural laziness. I hate getting up early. I’d much rather play video games than study. The task of writing a novel is monumental and I don’t really want to do it all again (despite wanting to finish my story). I’d rather not work at all. Discipline aversion isn’t unique to you. Some people deal with it, but you can overcome it. Gamify it if you must; I didn’t find it particularly motivating, but I know many do. You need to set small goals and remind yourself of them constantly. Accomplishing these small goals will build confidence, which inspires motivation, which is how you build discipline. That’s how I overcame the problem you’re having.",
        "percentile_10_comment": "The shame needs to be addressed. If shame is your motivator, it won't last. If hope is your motivator, it will. A big thing with ADHD (I have it too) is that your likely to get distracted, so stop and start tasks. If you get distracted, notice the task again and feel overwhelming shame it's hugely painful, so you avoid that feeling, therefore avoiding the task. Working through that shame, so that your able to notice the thing you forgot and just go \"oh, I did want to finish that\", that's the game changer. It needs to be ok that you stopped the task. (Which, spoiler, it is)Societal ways of dealing with someone (both yourself and others) forgetful or easily distracted tend to involve making the person \"care\" enough about it, which means feel so bad about it you'll never do it again. You ever had that lector from yourself or others? This doesn't work in the long run and takes a LOT of dedication and time to overcome. It's not that you don't care, it's that you're wired to be distracted and forgetful. Just have to restart a few times, and that's ok.",
        "comment_o3": "I’ve dealt with something similar and a few things finally moved the needle for me. First, stop framing it as “I need more discipline.” The word is loaded in your head, so swap it for “experiments.” Pick a ridiculously small, 5‑minute experiment you can do every day for two weeks. For a game dev that might be opening the project and fixing one line or writing one sentence of a design doc, then you’re allowed to quit. For music it could be playing one scale on a single string. It feels stupidly small, but that’s the point: you’re proving to your brain that showing up doesn’t equal pain.Second, separate outcome from identity. Instead of “I never finish games so I’m undisciplined,” try “I haven’t found a system that lets me finish yet.” Keep a physical notebook and each day write the date and what your 5‑minute experiment was. That growing list is concrete evidence that you can follow through, even if the tasks are tiny.Third, outsource structure until it’s boring. Join a coworking Discord with daily check‑ins, hire a cheap accountability coach on Focusmate, or book a practice session with a teacher who expects a scale every lesson. External eyes lower the bar to starting because someone else is holding the frame.Fourth, treat therapy like a skills coach, not a deep dive into childhood unless you want that. A CBT or schema therapist can help you neutralize the “discipline = threat” association with evidence‑gathering and exposure exercises, the same way people unlearn phobias.Finally, give yourself a single finish line this year: one tiny, shippable game jam entry, one recorded cover that uses sheet music, whatever. Everything you do funnels toward that one finish, no side quests. When the urge to abandon pops up, remind yourself the whole goal is simply to finish something small once, not to make it perfect.It’s unglamorous, but stacking laughably easy reps, using outside scaffolding, and aiming for one concrete finish is how I turned the lifelong wall into a speed bump. You can, too. Good luck.",
        "comment_gpt4dot1": "I relate to a lot of what you wrote, and I think you’re onto something important by recognizing that it’s not just about willpower or laziness. For me, what helped was reframing what “discipline” even means. Instead of seeing it as this harsh, external force or a test of character, I started thinking of it as a set of small, neutral routines—almost like brushing my teeth. I stopped trying to “be disciplined” and just tried to do one tiny thing regularly, even if it felt pointless or too easy. Sometimes that meant setting a timer for 2 minutes and just opening my project, not even working on it. Over time, the wall didn’t disappear, but it got less intimidating because I wasn’t trying to scale it all at once.Also, I had to let go of the idea that shame would motivate me. It never did. If anything, it made the wall higher. So I started tracking the tiniest wins, like “opened the music book” or “wrote one line of code,” and gave myself credit for those. It sounds cheesy, but it helped break the all-or-nothing thinking.If you haven’t already, it might be worth talking to a therapist who knows about schema stuff, but even without that, you can experiment with making discipline as low-stakes and non-threatening as possible. You don’t have to “overcome” the aversion all at once—just make it a little less scary, one small action at a time. You’re definitely not alone in this, and it is possible to make progress, even if it’s slow."
      }
    },
    {
      "id": "t3_s8sprf",
      "title": "[need advice] I’ve fallen into a deep trap with being lazy and I can’t get out of it.",
      "body": "I find myself procrastinating with everything. I feel guilt not doing the things I know I need too, but the issue is with the productivity level I’m at, I can skim by forever. I want to do more but every time I think about the all the things I want to get done, I get overwhelmed and do none of them. Where do I start? How do you just build a different mindset? Is this the right subreddit for this post? Someone help please!Ty",
      "comments": {
        "best_comment": "I am right there with you fighting the same battle. The only things helping me move forward (slowly) are these 3 things:1. I deleted all social media beside Reddit. No Tik Tok, no Instagram, no Facebook- nothing that will allow me to mindlessly scroll. It has actually caused me to pick up a book and read. 2. When I find myself unmotivated, lounging, slacking etc, I ask myself “What is something small I can do right now?”. This has helped feel some sense of accomplishment. No, I am not going to clean my entire house, but I can go unload the dishwasher real quick. No, I’m not going to finish prepping for a big work meeting all in 1 go, but I have at least get the background slides done. These small wins make me feel like I am doing something. 3. This one might sound silly, but to curb my place from becoming a disorganized mess, when I have things out or finish making a meal etc, I actually say aloud “Don’t put it down- put it away.” This forces me to physically not let go of an object until it is back in its place. Maybe these will help you move forward. It’s a small start.Also, the book Atomic Habits is slowly but surely changing my life and making even these tiny gains happen. I recommend running to get it. Before I started to read it, I wondered if maybe I was depressed. And truthfully, maybe I still am. But this book is helping me realize that it is not a lack of goals or motivation that is my problem, it is a lack of good systems in my life. Maybe the book and those 3 starters can help you begin building up your systems too. Sending good thoughts your way!",
        "percentile_10_comment": "I'm about to do the reverse, reddit got to go it's mindless scrolling for me, even the \"news\" is filled with mindless drama and banter. Pages and pages of tits and ass I'll don't know and will never know. Outlandish rage inducing video that suck you in to scroll hours of dumb comments. At least with facebook it's real friends and Instagram it's my buddy's posting things about there life I can relate too.",
        "comment_o3": "Yep, you’re in the right place. A simple way to break the paralysis‑by‑overwhelm loop is to shrink the size of the first move until it’s almost laughably easy. Pick one task that actually matters this week—say, reading for class, cleaning the desk, updating a résumé—and commit to touching it for five minutes today. Set a timer, do the five minutes, then walk away guilt‑free. Most of the time you’ll keep going because starting is the hard part, but even if you stop you’ve still logged a win and proved to your brain that “I do what I say.”Once you have a couple of five‑minute wins under your belt, schedule them for the same time each day so it turns into a default routine rather than a decision. Stack a cue you already do (morning coffee, lunch break, shutting the laptop at night) with the tiny task, then reward yourself immediately after—something as small as a stretch, a song, or scrolling Reddit. That cue‑routine‑reward loop is what slowly rewires the mindset you’re talking about.Next level: create tomorrow’s to‑do list tonight and limit it to three items max. Anything else you finish is a bonus. When the list is short you spend less energy choosing and more energy doing. Use an actual timer (Pomodoro, 25/5, whatever) so you can’t wander into YouTube or TikTok without noticing.Keep tracking the streak on paper or in an app; humans hate breaking streaks. Expect off days and treat them like speed bumps, not roadblocks—just restart the streak the next morning without the self‑talk spiral. Discipline is basically momentum plus memory: the more often you see evidence that you can start, the easier it is to believe you’ll keep going.Try this for two weeks, then widen the time block or add a second five‑minute habit. Slow growth feels frustratingly small in the moment, but it compounds faster than sporadic bursts of motivation. Good luck, and see you back here with progress updates.",
        "comment_gpt4dot1": "This is definitely the right subreddit for this kind of post—lots of people here are working through the same stuff. The overwhelm you’re describing is super common, especially when you’re trying to break out of a rut. One thing that helps is to stop thinking about “doing everything” and just pick one small, specific thing to do today. It could be as simple as making your bed, writing a to-do list, or spending 10 minutes on a task you’ve been putting off. The key is to make it so easy you can’t really say no. Once you do that, you’ll start to build a little momentum, and it gets easier to add more over time. Also, try not to beat yourself up for not being perfect—progress is way more important than perfection. If you slip up, just reset and start again the next day. You’ve already taken the first step by posting here, so keep going!"
      }
    },
    {
      "id": "t3_w15zh2",
      "title": "[Need Advice] Forming the habit of working out at 5am",
      "body": "I have picked up two habits since last year, flossing daily and cold showers daily. However I just can’t seem to make the habit of working out at 5am stick. I’ve seen how completing the 5am workouts has given me more energy throughout the day and also made me more conscious about my food choices. I want to make this a habit. I am a morning person so no problem waking up at 5am but I do find myself gravitating towards work rather than working out. Appreciate your advice!",
      "comments": {
        "best_comment": "1. Alarm rings2. Get up within 30 seconds3. Pee/poop4. Drink some water5. Put on workout clothes6. Work out (or drive to gym)At no point do you look at your phone, have breakfast, turn on the TV or anything else. You do everything above in order, no exception. You cannot give yourself even a moment's pause where you can think \"Oh, lemme just check reddit first, I'll work out in 20 minutes...\" Because then you won't work out. It needs to become automatic. Alarm rings = immediate workout.",
        "percentile_10_comment": "I switch the water and bathroom time. Down a nice tall glass of cold water (a bit more than it feels like is necessary). Wakes you up like a cup of tea!",
        "comment_o3": "You already know how to lock in habits, so treat the 5 a.m. workout the same way: engineer the cue, lower the barrier, and attach a reward. Set out your clothes, shoes, and a written plan the night before so the first decision is made for you. Keep your laptop and any work materials out of sight until the workout is finished—make the path to exercise the path of least resistance and the path to work slightly annoying. Tie the session to an existing habit: alarm rings → bathroom → quick splash of cold water → straight into workout gear. Promise yourself you only have to do ten minutes; once you’re moving, momentum usually carries you through the full session, but the tiny commitment prevents negotiation. After you finish, allow yourself something you like—a good coffee, the green light to open your inbox, whatever feels rewarding—so your brain pairs “workout complete” with a payoff. If you still struggle, add accountability: post the workout you did in a shared doc with a friend, or snap a timestamped photo and send it to a group chat. A few weeks of this loop and the 5 a.m. workout will start to feel as automatic as flossing.",
        "comment_gpt4dot1": "First off, props for nailing flossing and cold showers—those are both tough habits to stick with, so you clearly have discipline. Since you’re already up at 5am, it sounds like the main challenge is redirecting your focus from work to working out. One thing that can help is prepping everything the night before: lay out your workout clothes, set up your space, and have your routine ready to go. Try making your workout the absolute first thing you do—don’t check emails or start any work tasks until you’ve finished. You could even set a rule for yourself: no work before workout. If motivation is an issue, consider making your workouts shorter at first, or picking something you genuinely enjoy. Over time, the consistency will make it automatic, just like your other habits. Keep at it!"
      }
    },
    {
      "id": "t3_13q8io6",
      "title": "[Need Advice] How do I manage my work and housework?",
      "body": "I am a 27yo working female living alone in a metropolitan city in India. My work timings are usually 10-6 but it’s not very in terms of when I reach. However, I usually reach home by 7-7:30pm. I recently moved into a 1bhk and set it up completely( a first for me). I realised that my eating habits were not healthy and very expensive as I would order everything from outside, so I decided to start cooking for myself. However, it takes a lot of my time and it’s very difficult to manage with work, even if I try making simple things. I know I can cut vegetables and everything from before and keep for a while. But everything is taking so much of my mind space. I think more about food and shopping for food rather than work. I also don’t have a maid currently and am doing the dishes and house cleaning on my own. I can afford a maid(it’s cheap in India) but I don’t want to coz I have had bad experiences before in Delhi and it’s another hassle to manage. I just want to know how to save time physically and mentally and concentrate on my work while also cooking for myself and also getting some me time along with some workout in the morning .Is it too much to ask ? Please help.Also, I find it difficult to wake up super early so I usually try to wake up by 8am. I am trying to wake earlier though.",
      "comments": {
        "best_comment": "Cook in Batches like for 2/3 days. It saves a good chunck of time and you can use it for purposes. Also once you get all your veggies, clean and arrange them so you can quickly prepare and start making the food immediately. Some veggies also come precut.",
        "percentile_10_comment": "Clean dishes + stockpiled fruits, vegetables, meat = easy and quick cooking whenever you need it",
        "comment_o3": "I’m in the same boat with a full‑time job and no outside help, and the only way I’ve made it work is by turning everything into a system instead of a daily decision. Pick one grocery day and one bulk‑cooking block per week—Saturday morning, Sunday evening, whatever—and treat them like non‑negotiable appointments. On grocery day you buy for a fixed menu of 3‑4 simple dishes that all share ingredients (for example: chana masala, stir‑fried veggies, and lemon rice use overlapping onions, tomatoes, peppers, and spices). On cooking day you batch‑cook double or triple portions, portion them into individual containers, and stack them in the fridge/freezer. Reheating when you get home takes five minutes, so dinner and tomorrow’s lunch are sorted and the mental chatter about what to eat disappears.A cheap pressure cooker or Instant Pot pays for itself in time: throw soaked lentils + veggies + spices in the morning, set delay timer, and it’s ready when you walk through the door. One‑pot dishes also mean almost no dishes—lid, pot, spoon, done. For the rest of the kitchen mess, wash as you cook; you’re standing there watching something simmer anyway.Housework is the same “small daily, bigger weekly” system. Set a 10‑minute timer every night for a quick reset of the living room and dishes, and a 30‑minute timer on Sunday for sweeping, mopping, and bathroom wipe‑down. That’s under two hours total per week, far less than the mental load of wondering when you’ll clean. If you ever fall behind, hire a maid for a one‑off deep clean, then go back to your maintenance routine.For workouts, don’t chase a perfect 90‑minute gym session. A 20‑minute bodyweight circuit or yoga flow right after waking will move your energy up a notch. Lay out clothes and a mat the night before so 8 a.m. you roll out of bed and start, no thinking required. Once that habit sticks you can decide whether getting up earlier is worth the extra training time.The common thread is front‑loading decisions. Decide once a week what you’ll eat, when groceries happen, when cooking happens, when cleaning happens, and when you exercise. Put those blocks on your calendar the same way you’d schedule meetings, then run the script. It feels rigid at first, but the payoff is all the free headspace after work to actually relax instead of juggling chores.",
        "comment_gpt4dot1": "Honestly, what you’re describing is super common when you first start living alone and taking on all the responsibilities yourself. It’s not too much to ask to want a balance, but it does take some trial and error to find a routine that works. For cooking, try meal prepping on weekends or your least busy day—make a big batch of something simple (like dal, sabzi, or khichdi) that you can eat for a couple of meals. You can also chop veggies and store them in the fridge for a few days, so daily cooking is faster. For cleaning, set a timer for 10-15 minutes each day after dinner and just do a quick tidy or dishes—don’t let it pile up. If you can afford a maid, maybe consider hiring one just for cleaning (not cooking), so you have less to manage. As for workouts, even a 10-minute routine in the morning is a good start; consistency matters more than duration. Waking up earlier is a gradual process—try moving your alarm 10-15 minutes earlier every few days instead of a big jump. Most importantly, don’t aim for perfection. Some days will be messy, and that’s fine. The key is to build small, sustainable habits that make your life easier, not harder. You’ve already taken the hardest step by being aware and wanting to improve—just keep tweaking your routine until it feels manageable."
      }
    },
    {
      "id": "t3_v3f7wv",
      "title": "[need advice] how to effectively lessen time on social media ¿",
      "body": "I use my phone when I get tired of doing tasks but I realized that I waste most of my time just scrolling down my phone and I tend not to notice how much time it consumes. I want to get disciplined but I just keep on doing the same thing every day. wish anyone could help me out.",
      "comments": {
        "best_comment": "Try putting your phone away when doing tasks. I keep my phone outside of my room (where my desk is) inside my bag by the front door. It's many walks away from me when I'm working which makes it inconvenient to use. Another inconvenient tactic - I moved all my social media apps on my phone to the third page of my home screen inside the 5th page of a folder. It takes me 5 swipes to get to my distracting apps. Definitely helps!",
        "percentile_10_comment": "Use the mobile browser version of social media apps. The experience is so garbage you won’t want to use it for long",
        "comment_o3": "What worked for me was attacking the problem from two angles: shrink the temptation window and give my brain a better‑quality break. First, make the phone slightly annoying to use. Log out of the social apps, bury them in a folder on the last screen, turn off all non‑essential notifications, and set the display to grayscale. If it takes an extra 10–15 seconds of friction to open Instagram, you’ll often decide it isn’t worth it. Second, decide ahead of time what “tired” you really means—do you need movement, stimulation, or just a pause? Pick a replacement activity you can start in under a minute: a five‑minute walk, ten push‑ups, a short guided breathing video on YouTube (downloaded so you don’t wander), or even standing up to stretch while listening to one song. Couple this with a timer like Pomodoro: work 25 minutes, then take a five‑minute intentional break that you’ve chosen in advance. When the break ends, phone goes face‑down in another room or desk drawer until the next cycle. Finally, track it. Each day note how many cycles you ran without scrolling—seeing the streak build is surprisingly motivating. You won’t be perfect, but every session you redirect is time you’ve reclaimed, and momentum compounds quickly once you have a few wins under your belt.",
        "comment_gpt4dot1": "One thing that helped me was making it just a little harder to access social media. Try moving the apps off your home screen or logging out after each use so there’s an extra step before you can start scrolling. You could also set app timers or use features like Focus Mode to limit your usage. When you catch yourself reaching for your phone out of habit, try swapping in a different quick break—like stretching, getting a glass of water, or stepping outside for a minute. It’s normal to slip up, but the key is to notice when it happens and gently redirect yourself. Over time, those small changes add up and it gets easier to stay off your phone. Good luck!"
      }
    },
    {
      "id": "t3_x5oxom",
      "title": "[Need Advice] How do I control myself from buying unnecessary things and improve my spending habits?",
      "body": "Idk if this is the right sub but I have trouble controlling my spending habits. Every time I have money I always spend it to buy unnecessary things because it made me feel good. Idk why but shopping is just satisfying and I just can’t help it. I think it’s just me coping with my negative feelings like whenever I feel sad or mad at someone because these are the times I usually decided to get something for myself to feel better. It made me feel good for a moment until I realised that I’ve spent a lot of money and could have saved it for something more important. Can anyone help and give me tips on how to control myself? How do I become more responsible and save money?",
      "comments": {
        "best_comment": "Every time you want to buy something, add it to the list. And then keep adding things to the list as you think of things to buy. I don't actually buy them though. And then eventually you'll realize that these things have been on the list for a really long time but you never really needed them so you'll be fine. You can do this thing where you just don't spend any money for a month called No buy month",
        "percentile_10_comment": "get yourself into severe debt",
        "comment_o3": "What helped me break the “spend‑to‑feel‑better” loop was building delays, barriers, and substitutes into the process. Start by moving a chunk of each paycheck to a separate savings account the moment it arrives; money you never see in your checking account is a lot harder to blow. For anything that isn’t rent, bills, or groceries, impose a 48‑hour rule: you can add it to a wish list, but you can’t buy until two full days have passed. Nine times out of ten the urge fades and you never hit “checkout.” Delete saved cards from online stores, unsubscribe from promo emails, and leave your credit card at home when you don’t need it—those tiny bits of friction buy your rational brain a few extra seconds, which is usually enough. Finally, find a quick, free mood‑boosting activity you can default to when you feel the itch to shop: a short walk, a five‑minute meditation, a call to a friend, anything that changes your state without costing money. Combine automatic saving, forced cooling‑off periods, and a go‑to emotional outlet, and you’ll notice your impulse buys drop fast and your bank balance climb just as quickly.",
        "comment_gpt4dot1": "This is a super common struggle, so you’re definitely not alone. One thing that helps is putting a “cooling off” period between the urge to buy and actually making a purchase—like, wait 24 hours before buying anything that isn’t essential. A lot of the time, the urge passes and you realize you don’t really want it. Also, try tracking your spending for a month, even if it’s just in your notes app. Seeing where your money goes can be a wake-up call and help you spot patterns. If you notice you shop more when you’re feeling down, it might help to have a list of other things you can do when you’re upset—like going for a walk, calling a friend, or even just watching a show. Building discipline is about making small changes and sticking with them, so don’t beat yourself up if you slip. Just keep practicing and it’ll get easier over time."
      }
    },
    {
      "id": "t3_ommucw",
      "title": "[Need Advice] How to make myself choose the harder but better choice for myself",
      "body": "It's 4:40am right now on a Sunday and I'm realizing how much of a mess my life is. I gained a ton of weight in the past 3 months from working in retail to working in a bank, I have mismanaged my funds due to overeating as a coping mechanism, I buy food at the grocery that I don't eat and they end up as waste, I use Uber Eats a lot despite grocery issue, I use Uber a lot in the morning, my room is a mess, I'm a smoker, I'm pondering if buying a gaming laptop would be good for my mind, and I'm having joint and body pains from being a fat mess with an injured knee from a sports accident a year ago. All of these I'm aware that they may all result in my early death. I'm also aware that I can make better choices by doing the opposite of those but why can't I? Why can't I choose something that'll better myself it just doesn't make sense to me. I just want this to stop. I want to get better and be disciplined with my life.",
      "comments": {
        "best_comment": "Your mind hates uncomfortable things right now, but in the future not so much. That's called the present bias. The good things long term are often unpleasant now and your brain steers you away from the \"pain\" associated with those.For bad habits, it will take discipline, but there are some things you can do:As you've pointed out, bad habits are almost always coping mechanisms. So what are the emotions, events and situations that are at the root? If you can tackle even some of those, you should see less of the bad behaviour. Second, try to find an alternative. For a better understanding: smoking and eating can help deal with stress. That goes back to prehistoric times when there was often danger. If you were eating, it was because you found a safe place to do so. Even today eating or smoking send signals to your brain like \"I'm eating/chewing, so I must be safe right now\" which helps against stress.Chewing gum would give you a similar effect but without the bad consequences.And probably the easiest thing to start with, change your environment. What barriers can you put in place that make the bad behaviour harder to do or unpleasant? And how can you make the good choices easier to do?It's gonna take time to break bad habits, but it should get better once you start seeing some results.",
        "percentile_10_comment": "One step further: actually reward yourself. When I started running I rewarded myself with a TV show I wasn't allowing myself to watch until the run, or a chocolate protein shake (I love chocolate). Find the things you love doing in the day, and save them as rewards for doing the new habit - no matter how small the new habit is.",
        "comment_o3": "Trying to overhaul everything at once is like sprinting the first mile of a marathon—you’ll gas out fast. Shrink the battlefield and win one skirmish at a time.Anchor on a single daily habit that gives the most return. Cooking one meal at home is a solid candidate: it saves cash, trims calories, and forces you into the kitchen instead of the drive‑thru. Decide what that meal is before you go to bed, lay the ingredients out, and promise yourself you can order Uber Eats only after you’ve eaten the food you made. Most days you won’t bother opening the app, and the money you would have spent can be moved into a separate “reward” account.Attach tiny add‑ons to things you already do. While coffee brews, knock out two minutes of body‑weight squats or push‑ups—adjust for the knee as needed. After brushing your teeth at night, set a five‑minute timer and put away whatever’s on the floor. When the timer dings, stop, even if the room isn’t perfect; consistency beats marathon cleaning sessions.Make bad habits inconvenient. Keep cigarettes somewhere you have to walk to get them, or only buy singles; friction gives you time to rethink. For impulse buys like the gaming laptop, use a 48‑hour rule: write down the item and price, revisit in two days, and buy only if it still feels worth it.Track streaks on a calendar or in an app and tell a friend what you’re working on—external eyes turn “hope” into “I said I would.” When you miss a day, don’t spiral; just restart the streak the very next meal, the very next cigarette decision, the very next five‑minute clean.Build systems that make the better choice the easy choice, layer habits one at a time, and let the wins compound. A year from now you’ll barely recognize the guy who wrote this post.",
        "comment_gpt4dot1": "First off, it’s good that you’re aware of what’s going on and want to change—most people don’t even get that far. The thing about discipline is that it’s not about making the “harder” choice every single time, but about making the next choice just a little bit better than the last. Trying to overhaul everything at once is overwhelming and usually backfires. Pick one thing that feels most doable right now—maybe it’s prepping a simple breakfast for tomorrow, or just tidying up your desk. Do that, and let yourself feel good about it. Once that’s a bit more automatic, add another small habit. Also, don’t underestimate the power of environment: if junk food is in your house, it’s way harder to resist. If you can, try not to buy it, or at least put it out of sight. For the smoking and joint pain, it might help to talk to a doctor or counselor, but even small steps like swapping one smoke for a walk (even a short one) can help. The urge to buy a gaming laptop might be a way to escape, but ask yourself if it’ll actually help you feel better long-term. Progress is slow and messy, but every small win counts. You don’t have to be perfect—just a little better than yesterday."
      }
    },
    {
      "id": "t3_13iiiex",
      "title": "[Need Advice] Went from extreme discipline to basically zero. Very unhappy with myself and my life.",
      "body": "I'm learning to play the guitar.",
      "comments": {
        "best_comment": "Sounds like you’re experiencing burn out. You worked really hard, you still work really hard, so first thing first, give yourself some credit. I recommend sleeping a little bit more, force yourself to go to bed before 11 PM, you are not resting enough. Working for 12 hours is definitely too much; work is draining your energy. If you’re independent and have the opportunity to decide your time, i suggest you to stop working at most within 8 PM. If the place you live in is not enjoyable for you and you live alone, consider to move in a less expensive environment.By now, your mental and physical health needs to be your number one priority. Find a hole in your routine to take a moment for sport, jogging, yoga, quick workout at the gym (45 min is enough), boxe (even at your home if you want to!), there are many choices. If you don’t have much time to cook, which is a super relaxing and fun hobby, you can try meal prep, so you can make healthier choices and don’t have to think about cooking everyday; you can prep during the weekend. If there are other details that could possibly help me to understand your situation and maybe give u better advice, feel free to respond. Also, i’m italian so my english skills are pretty shitty, i hope you understand!",
        "percentile_10_comment": "Fuck the people who say grind more.Fuck the 12 hour day.Fuck 300K if it gets you this.Fuck the current zip code.Use your money. Get a cook. Get time off every week. Get into a cheaper place. This will be very bad for your future health, not to mention it's killing you now. Get off this train immediately, friend. If I made more than slave's wages, I'd make people work for me and make this work.How can people help you, in real time? I always remember what a kid at my christian youth group camp said to me, \"people are great, if you know how to use them.\"gross, I know, but he's got a point. If you have the resources, you have a way out. He's probably running some divinely fostered MLM scheme now....Here's a hug. I hope you figure it out soon.",
        "comment_o3": "A good way to jump‑start your old discipline is to use the guitar as your anchor habit. Tell yourself you only have to pick it up for five minutes every single day. Five minutes is so small it’s almost impossible to skip, but once you’re holding the instrument you’ll usually play longer. Put the guitar on a stand in the middle of the room so it’s the first thing you see after work or school, and make a rule that you touch it before you touch your phone or the TV remote. Keep a notebook or a simple spreadsheet where you jot down what you practiced each day and how long you played—seeing a streak grow is motivating and makes skipping feel like breaking something valuable.Once that five‑minute guitar streak feels automatic, piggyback another micro‑habit right after it—maybe ten push‑ups, a five‑minute walk around the block, or writing two sentences in a journal. The idea is to rebuild your discipline muscle with wins that are too small to fail, then gradually layer them until you’re back to a routine you’re proud of. If you ever fall off again, return to the five‑minute rule instead of beating yourself up. Consistency beats intensity, and tiny, locked‑in habits give you a foundation you can always rebuild on.",
        "comment_gpt4dot1": "It’s totally normal to go through ups and downs with discipline, especially when you’re picking up something new like guitar. One thing that can help is setting really small, specific goals—like practicing for just 5 or 10 minutes a day, even if you don’t feel like it. Consistency matters more than intensity at first. You might also try tracking your practice sessions on a calendar or app, so you can see your progress over time. If you miss a day, don’t beat yourself up—just get back to it the next day. Building discipline is a process, and every little bit counts. Keep at it, and you’ll start to feel that momentum again."
      }
    },
    {
      "id": "t3_12k7iil",
      "title": "[Need Advice]I cant even get myself to work 3 hours a day consistently.",
      "body": "Hello, I started since Monday a goal to work at least 3 hours a day of pure work. The first two days I did will and actually worked for 4 hours. But by Wednesday i couldn’t even get myself to work more than an hour. I spent so much energy forcing myself to work that day and I couldn’t do it. Almost like I was constipated mentally.Should I lower down the work hours (even tho 3 is so small). And try to gradually increase the minimum time working? Or is it because I just don’t care enough about this business I’m working on. I’m amazed how people can work 6 hours a day of pure focused work. Sometimes I think there’s something wrong with me.When it comes to gym, eating healthy I can see those benefits immediately right after and feel good. But with work I feel like shit after and I don’t really care about making bank. I do feel good sometimes but for the most part its a chore that makes me dislike life more.Thank you!",
      "comments": {
        "best_comment": "Look up Atomic Habits. The real goal right now is to just convince yourself to show up to your work setting and not worry about how long. Maybe a few times a day to return. Maybe you get some in, maybe not. But good chance while you're at it without the pressure you will.Next make it fun, find something to reward yourself ONLY when you do some work. That's it. The only time. Associate it with doing the Thing (work) and you'll enjoy work a bit more knowing what you get out of the deal",
        "percentile_10_comment": "Start so small that you laugh at it, do it for a week, increase by 10min, do it for a week, rinse & repeat until you’re at your goal of 3h. It’ll take longer but it’ll be a habit.You can also look up the pomodoro technique, think of ways to make it fun (reward yourself etc but not every time), have a deal made with someone that you pay them £xx.xx or donate to something you dislike if you miss 2 days in a row or 2 days from the same week. We can work a lot better with a drive to do it (the fun part) and a drive to not miss it (the punishment of losing money/whatever you decide).Try to make sure you enjoy the work you’re doing too if you’re lucky enough to be in that situation, definitely helps a whole lot!EDIT: Forgot to mention finding out ‘Why’ you’re doing this work, what drives you? Write that down and look at it everyday. So, when you’re having a bad day and ask yourself “what the f am I doing this?” Your brain replies with the answer and continue.",
        "comment_o3": "Three hours of “pure work” sounds small on paper, but it’s a marathon if you’re not used to sustained focus. Most people who claim they can crank out six deep‑work hours got there by building up in small blocks, not by flipping a switch. Instead of lowering the daily goal, try reframing it: commit to one focused 25‑minute sprint, then decide whether to do another. Stack those sprints until you hit three hours or until you call it for the day. If you only manage two sprints, you still practiced the skill and logged exactly how long you lasted, so you have real data to beat tomorrow.Make the sessions easier to start. The night before, write down the single most specific task you’ll attack first—e.g., “Write introduction paragraph,” not “Work on website.” When you sit down, there’s zero decision fatigue; you just press play. Pair that with a short pre‑work ritual (brew coffee, put phone in another room, open only the files you need). Linking the ritual to the first sprint cues your brain that “this is work time,” the same way tying your shoes cues your brain it’s gym time.The lack of immediate payoff is normal for knowledge work, so manufacture one. Keep a visible log of completed tasks or minutes—crossing them off provides the quick dopamine hit you get from a pump in the gym. Schedule a small, guilt‑free reward after your last sprint: a walk, a game, whatever. The brain starts associating the end of a work session with something pleasant, making the next session easier to initiate.As for not caring about “making bank,” focus on the reason this business exists for you besides money. Is it learning a skill, earning freedom, solving a problem you find interesting? If you can’t identify a why that resonates, you may be forcing yourself toward a goal you don’t value, and no productivity hack will fix that. Either uncover a motivating purpose or pivot to work that does matter to you.Finally, expect fluctuation. Professional writers, developers, and academics have off days too; they just show up anyway and protect the habit. Treat each session as practice, not a performance. If you string together weeks of consistent 25‑minute blocks, you’ll look back and realize you’re already doing the three‑hour days you thought were impossible.",
        "comment_gpt4dot1": "Honestly, it’s super common to hit a wall after a couple of good days, especially when you’re trying to build a new habit. Three hours of focused work is actually a lot if you’re not used to it, so there’s nothing wrong with starting smaller and ramping up. You might find it easier to break your work into shorter chunks—like 25-30 minutes with breaks in between—rather than trying to power through hours at a time. Also, if you’re not feeling much reward or meaning from the work itself, it can help to set up some kind of immediate payoff for finishing your sessions, even if it’s just a small treat or a bit of downtime. Not everyone is wired to grind for hours on end, and that’s fine. The key is consistency, not perfection. If you can reliably do even an hour a day, that’s a solid foundation to build on. Over time, you’ll probably find your capacity grows as the habit gets stronger."
      }
    },
    {
      "id": "t3_s2mn65",
      "title": "[need advice] how do you ppl get the energy to cook on weekdays?!",
      "body": "Before you say, cook on weekends. I’ve tried meal prepping once a week and it makes me feel a bit gross to eat stale food. So my ideal routine would include 2 meal prep  per week. I finished work this evening and I’m exhausted.  And not just physically, it’s just my eyes are tired from looking at a screen all day long. When my eyes feel tired, i know I’m out for the day.  If I’m just physically tired, i can still push through.I’ve decided to stop ordering takeouts and eating healthier (to help with energy). And i dont want to make cheat meals full of empty nutrients. If you’ve managed to make this work in your routine, any tips?",
      "comments": {
        "best_comment": "Blue apron helps me because I know if I don't cook I'll lose meals. Other than that, the answer is wine and not having energy for anything else 😆",
        "percentile_10_comment": "1. Make rice, stew etc for 3-5 days on weekends (3 cups of rice is enough for 1 person) 2. Prep everything on the weekends. Marinade what you can for Mon & tuesday. 3. Literally, just steam your marinated meat and veggies, heat up your rice. Leave it on the stove for 10-20 mins and you're ready to eat it.It's a lot less work than it seems. You don't have to do much.I'll try kimchi, because I think you can keep it for months.",
        "comment_o3": "What helped me was separating “decision” energy from “cooking” energy. On Sunday I spend 15‑20 minutes writing down exactly what I’ll eat the whole week, then I shop once. When I walk in the door on Tuesday night I’m not debating what to make—I’m on autopilot. I aim for dinners that take 30 minutes max, dirty only one pan, and reheat well for lunch the next day. Think sheet‑pan chicken + veg, curry in an Instant Pot, or a sauté where canned beans replace half the chopping. I portion half straight into tomorrow’s lunch container while it’s still hot, so it never feels like “stale leftovers” sitting for four days.The other trick is front‑loading the annoying parts. I wash and chop produce right after I unload the groceries, store it in clear containers, and measure out spice mixes into little jars. Weeknight cooking then feels like assembling a kit, not starting from scratch when my eyes are fried.Finally, pick a cue that signals “kitchen time” before exhaustion sets in. For me it’s changing clothes and starting a podcast the moment I shut the laptop. If I let myself sit on the couch first, game over. Once dinner is done I’m free to crash, and the healthier food does noticeably help the next day’s energy. It isn’t glamorous, but after two weeks the routine starts to run itself. Good luck.",
        "comment_gpt4dot1": "Honestly, I relate to this a lot. Cooking after work can feel impossible, especially when your brain is fried from screens all day. What’s helped me is lowering the barrier as much as possible—think super simple meals that take 15-20 minutes max, like stir fries, sheet pan veggies with protein, or even just assembling stuff (like wraps or salads) instead of “cooking” from scratch. I also prep ingredients instead of full meals: chop veggies, marinate protein, cook a big batch of rice or quinoa, so when it’s time to eat, I just throw things together. Two meal preps a week is totally reasonable—maybe Sunday and Wednesday? Also, don’t underestimate the power of a good playlist or podcast to make the process less of a chore. The first week or two is the hardest, but once you get a rhythm, it gets easier. And if you have a night where you just can’t, having a healthy frozen meal or something easy on hand is way better than defaulting to takeout. You got this!"
      }
    },
    {
      "id": "t3_140lzrf",
      "title": "[Need Advice] Why is it so damn difficult to stay consistent with exercise?",
      "body": "As the title states...WHY?!  The first 2 - 3 weeks I'm all-in, all gung-ho. I'm loving how I'm looking and feeling. But after a while I get burnt out and take a couple days off. Those days then become weeks and weeks and then I'm back to square one. I'm an early morning work out type person, I can't stand the packed & crowded gym after work and I don't have the same energy either as I do in the am. For those that STAY consistent,  what is your advice? Thank you all in advance for your time and responses.Edit : I wasn't expecting so many replies. Thank you all for being very helpful!",
      "comments": {
        "best_comment": "Don't overdo it and when you're not feelig fully up to it accept that somethign is better than nothing. Perfect is the enemy of good.",
        "percentile_10_comment": "I started doing this with my workout clothes and my clothes for the office the night before, and then with my breakfast cooking setup (same thing every day, takes a bowl, measuring cup, spoon, skillet, cooking spray, coffee tumbler, pour over). It’s just makes the mornings so easy and automatic, helps me get out of the house earlier, no mental energy used",
        "comment_o3": "Most people fall off because they rely on the rush of novelty instead of building a routine that survives low‑motivation days. Start by lowering the bar: decide what your “minimum viable workout” is—something so easy it feels almost silly (10 push‑ups, a 15‑minute jog, a few kettlebell swings). On days you feel great you can do the full session; on days you don’t, you still do the minimum and keep the habit chain intact. That stops a two‑day break from turning into two weeks.  Schedule your training like a meeting and build the logistics the night before: clothes laid out, water bottle filled, playlist or podcast queued. When the alarm goes off you’re on autopilot instead of negotiating with yourself.  Use an actual program with planned rest days and a deload week every 4–6 weeks. Programming takes the guesswork out and prevents the “all‑in until I crash” cycle. Tracking your lifts or run times in an app/notebook is another quiet motivator—seeing numbers creep upward makes you want to protect the streak.  If you miss a day, just do the next scheduled workout. No extra punishment, no “starting over,” no guilt. The goal is to act like someone who works out, not someone chasing a perfect record. Consistency isn’t never missing; it’s resuming quickly after you do.  Treat the habit as identity (“I’m a morning lifter”) and logistics (“alarm at 5:30, gym at 6”) rather than willpower. Do that and the early sessions become as routine as brushing your teeth, and missing them starts to feel weirder than showing up.",
        "comment_gpt4dot1": "Honestly, this is super common—motivation is high at first, but it fades, and then the routine falls apart. What’s helped me (and a lot of others) is making the habit as easy and automatic as possible. For early morning workouts, try prepping your clothes and gear the night before so there’s zero friction when you wake up. Also, don’t go all-in every single session; it’s better to do a “minimum viable workout” on days you’re not feeling it, even if it’s just 10-15 minutes. That way, you keep the streak alive and reinforce the habit. Consistency beats intensity in the long run. Lastly, try to tie your workouts to something you already do every morning (like right after brushing your teeth) so it becomes part of your routine, not a decision you have to make each day. Progress isn’t about never missing a day—it’s about getting back on track quickly when you do. You got this!"
      }
    },
    {
      "id": "t3_slz1uo",
      "title": "[Need Advice] Why do I always feel the need to sleep after lunch?",
      "body": "As the title says, i really don't know why I feel tired every afternoon. Like as soon as I finish eating I need to go to sleep or spend at least 30-60 minutes on the bed.I tried studying or doing something that I like as soon as lunch was over, but I always keep coming back to my bed. Any advice is appreciated, like why is this happening, how can I fix this etc...",
      "comments": {
        "best_comment": "Food intake(especially carbs) increases blood sugar(transient hyperglycemia). This is brought under control by insulin released by special cells in the pancreas. It is hypothesized that hyperglycemia reduces the level of orexin, which plays a major role in maintaining alertness. You can call it the alertness hormone.How to manage this? Cut down on carbs, sub it with protein, reduce servings ideally. I skip lunch entirely and have breakfast and an early dinner. Haven't needed an afternoon nap unless really exhausted.",
        "percentile_10_comment": "I would suggest avoiding sugar and carbs.For breakfast and lunch, I go for low calorie meals high in protein and fiber with a little at. My breakfast during the week is a Quest bar, and my lunch varies but is usually something like a chicken soup, chili, meat and cheese (skip the crackers though), something like that. I'd also recommend spice for lunch. Eating something extremely spicy will help keep you alert. Peppers are really good for you, too.The one exception is in the early summer when it's in season I like to have fresh fruit, especially berries, and whipped cream, because that is just one of my favorite things.For dinner after you are mostly done being productive for the day is the time to eat your carbs.",
        "comment_o3": "The post‑meal crash is usually a mix of biology and habit. Around 1–3 p.m. your circadian rhythm naturally dips, and a big carb‑heavy lunch spikes insulin, shuttles tryptophan to the brain, and you get sleepy. If you’re already carrying some sleep debt, that dip feels like a brick wall. You can’t delete the biology, but you can blunt it enough to stay productive.First, audit the meal itself. Swap out huge portions of rice, bread, or pasta for more protein, veggies, and healthy fats, and keep the total calories reasonable. Chase it with a full glass of water—dehydration amplifies fatigue. If you’re a coffee drinker, have the cup right after eating; caffeine takes ~20 minutes to kick in, lining up nicely with the dip.Second, move immediately. Stand up the moment you finish the last bite and take a 5–10 minute brisk walk, ideally outside for sunlight. The combo of light and movement tells your brain it’s still “go” time and evens out blood glucose.Third, give yourself a controlled outlet. A 15–20 minute “permission nap” (set an alarm, lie on the couch, not the bed) can recharge without letting you drift into a full sleep cycle. If you’re afraid you’ll over‑snooze, hold a pen or your phone loosely—when it drops, you wake up.Fourth, safeguard the environment. Keep study materials in a different room, or leave the house entirely for a library/coffee shop sprint session after lunch. When the bed isn’t within arm’s reach, the friction of going back to it often overrides the impulse.Finally, check the foundation: 7–9 hours of consistent nighttime sleep, same wake‑up time daily, and no marathon bedtime phone scrolling. When nightly rest is solid, the afternoon slump becomes a speed bump instead of a ditch.Tweak one variable at a time for a week so you know what’s actually helping, then stack the wins. You probably won’t erase the dip completely, but you can shrink it from 60 lethargic minutes to a quick reset and get on with your day.",
        "comment_gpt4dot1": "This is super common—lots of people get sleepy after lunch, and there are a few reasons why. Big meals, especially ones high in carbs or sugar, can make your blood sugar spike and then crash, which leads to that drowsy feeling. Digestion itself also diverts blood flow away from your brain for a bit. If you’re eating heavy or greasy foods, that can make it worse.A few things that might help: Try eating a lighter lunch with more protein and veggies, and less simple carbs. Drink water instead of sugary drinks. After eating, get up and take a short walk, even just around your room or outside for five minutes—it really helps wake you up. If you can, avoid lying down right after eating, since that signals your body it’s time to rest. If you’re not sleeping well at night, fixing your sleep schedule can also make a big difference in afternoon energy.Building discipline here is about setting a post-lunch routine that keeps you moving, even if it’s just a small task or a change of scenery. It’ll feel tough at first, but if you stick with it for a week or two, your body will start to adjust. Good luck!"
      }
    },
    {
      "id": "t3_10sae8b",
      "title": "Too many interests, not enough time [need advice]",
      "body": "I have so many skills and interests but I feel like there’s not enough time to work on any of them.I work full time and my job is pretty taxing, I usually work 9-5 but usually stay working until 5:30 sometimes 6. I wfh so thankfully theres no commute.i have a dog which takes up an hour after work to walk, feed, play with him. Since I wfh I try to finish up most of my chores during the day when I can so I dont have much to do after work. By the time I’m done it’s usually around 8, sometimes around 7. I like to be In bed by 11, this gives me 3-4 hours a day.i have so many things I want to do in life. I love music and play two instruments and want to find time to continue playing them. I love reading and writing. I was learning French and am at an intermediate level, I really want to be fluent and even learn more languages.i love learning new things and would love to take some online courses, physics, bio, chem, philosophy, etc.i would also love to start my own company. I feel like this would allow me to control my work and control my hours. Ik its A grind but I would be willing to do it.clearly, I have too many goals and not enough time. i often get option paralysis and end up doing nothing but watching tv. Some days I feel so burnt out by work that I do nothing but watch tv.Any advice on managing this would be appreciated.",
      "comments": {
        "best_comment": "One thing at a time. You can't do everything. Have priorities. Less is more. You can always learn a third language after you finish learning your second. You're not saying no to other things forever by doing the first thing now.",
        "percentile_10_comment": "I’m happy to hear of someone who devotes an hour a day to their dog. That’s an awesome use of your time. Beyond that, I agree strongly with some of the other commenters - start working on 1 thing at a time. See how it goes doing it consistently for, say, 6 months. At that point, you can do it more or less and/or add a new thing to try and do consistently. Also stick with the things you’re already doing if you like them, or scale back on those to make more time for yourself if you feel you could better invest your time elsewhere",
        "comment_o3": "The trick isn’t to squeeze everything in; it’s to accept that you can’t do everything at once and then pick what matters most right now. Treat your evenings like a limited‑edition resource: 3–4 “units” a night. Choose one main focus per season (say, the next 12 weeks) and one small daily habit that’s almost frictionless. Example: this quarter your primary is French, your daily mini‑habit is 20 min on guitar. Block 60–90 min for French right after the dog walk when your brain is still alert, set a timer, then stop. The guitar session can live later as a wind‑down. After those two slots, whatever time’s left is guilt‑free: read, watch TV, whatever. Next quarter you might shift the 90‑min block to “write the first draft of a business plan,” keeping the guitar mini‑habit alive.  If you’re wiped after work, protect 10–15 min for a transition ritual—stretch, quick shower, snack—before the focused block. It signals the day job is done and helps you walk into the next task with more energy.  Track progress weekly, not daily: “Did I hit four French sessions and four guitar sessions this week?” Checking boxes daily can crush motivation when life happens, but a weekly score lets you stay flexible.  Finally, cap your idea intake. Keep a running “later” list for courses, books, and business ideas so they’re not rattling in your head demanding attention. Every quarter when you review goals, you can promote one item from the list and demote another. That way you’re always learning, always practicing, and never drowning in choices.",
        "comment_gpt4dot1": "This is a super common struggle, especially for people with a lot of curiosity and ambition. The reality is, you *can* do a lot, but not all at once. The trick is to pick 1-2 things to focus on for a set period (like a month or two), and let yourself rotate interests over time. For example, you could dedicate 30 minutes a night to music, and 30 minutes to French, and let the rest be free time or for winding down. Or, you could do music on Mon/Wed/Fri, and French or reading on Tue/Thu. The key is to make a simple, repeatable schedule that you can stick to even when you’re tired. Don’t underestimate the power of small, consistent effort. Even 20 minutes a day adds up over months. Also, try to set a “minimum viable” version of each habit—like playing one song, reading 5 pages, or doing 10 minutes of Duolingo—so you can keep momentum on low-energy days. If you’re feeling burnt out, it’s okay to just rest sometimes, but try to avoid defaulting to TV every night. Maybe set a rule: do one productive thing before you turn on the TV.As for starting a company, that’s a huge goal and will require a lot of time and energy. It might help to treat it as a long-term project and just start by dedicating a small, regular slot each week to brainstorming or research. Once you get momentum, you can ramp up.TL;DR: Pick a couple priorities, make a simple schedule, keep your daily goals small, and rotate interests over time. You’ll make way more progress than trying to do everything at once."
      }
    },
    {
      "id": "t3_oexyx3",
      "title": "[need advice] how do you force yourself to wake up early without feeling miserable",
      "body": "I’ve always been a night owl for as long as I can remember. I love staying awake at night, and I naturally tend to fall asleep around 2 to 3 AM and wake up around 10-11AM feeling well-rested. But lately I’ve really had a desire to try to become a morning person so that I can be more productive throughout the day. Do you guys have any tips on how you wake up early, like 6 AM? How do you force yourself out of bed when all you feel like doing is sleeping for “five more minutes.”Edit: just wanted to thank everyone for taking the time out of their day to contribute such helpful comments! I may not be able to comment on each individual post, but I will try to read as many tips as I can and incorporate them. I hope others find these tips just as helpful as I did :)",
      "comments": {
        "best_comment": "I’m the same as you. I used to spend the whole night scrolling the internet, binge watching, buying useless stuff, whatever. Waking up at 1pm easily. Over the past year I’ve decided to get my life in order. Didn’t especially focus on my sleep schedule issues, but on my general well being. I listen to my body more, I rest more and quit drinking, I take the time to do painting / drawing, whatever creative activity calms me down. Cut out all social media except for Reddit sometimes, never at night. I started feeling more relaxed in the evenings, and I came to enjoy reading a book at 10pm as much as I used to enjoy binge watching Netflix all night. Being far from screens, I get tired, I fall asleep. Naturally, I wake up earlier and earlier every week, step by step. My point is, I’ve used every technic I could find to become a morning person before, and it never worked (I was late EVERY day to my job for 4 years). It is only when I started taking care of myself globally and on a more spiritual level too that it has changed. Feeling good and proud about yourself is the best way to actually want to get out of bed and face the day.",
        "percentile_10_comment": "* A normal sleep schedule* An accountability partner getting me to follow said schedule, who also is my partner* A happier partner* More time do to the fun stuff with said partner* Nice breakfasts together* Two squabbles less* Also what the others said",
        "comment_o3": "I used to be on the 2 a.m.–10 a.m. schedule too, and the thing that finally stuck was treating the wake‑up time as an immovable appointment while changing the environment around it.Pick one time—say 6 a.m.—and get out of bed at that time every single day for three weeks, weekends included. When the alarm goes off, stand up, turn on bright lights, splash your face, and open a window or step outside for a couple of minutes. Morning light is the strongest signal to your body clock; the earlier you hit it, the sooner you’ll start getting sleepy at night.Because “willpower in the dark” isn’t reliable, prep the night before. Put the alarm across the room, set out clothes, fill the kettle, and have something you actually look forward to waiting—good coffee, a playlist, a quick walk with a friend. Tiny rewards beat mental negotiations.Shift the bedtime gradually: aim to feel drowsy 30 minutes earlier every few nights. Cut caffeine after early afternoon, dim lights and screens an hour before bed, keep the room cool and dark. One late Netflix binge can reset the whole experiment, so try to stay consistent even on Friday and Saturday.The first week is rough, the second is tolerable, and by the third your brain usually gives in. Stick it out and you’ll wake up before the alarm wondering why you ever thought 6 a.m. was early.",
        "comment_gpt4dot1": "I used to be a hardcore night owl too, so I get the struggle. The biggest thing that helped me was shifting my bedtime gradually—like 15-30 minutes earlier every few days instead of trying to make a huge jump all at once. Also, try to get sunlight as soon as you wake up (even just opening your curtains or stepping outside for a few minutes), because it helps reset your internal clock. At night, dim your lights and avoid screens for at least 30-60 minutes before bed. As for getting out of bed, putting my alarm across the room forced me to physically get up, and I’d immediately splash cold water on my face or start making coffee. The first week or two can feel rough, but your body does adjust if you stick with it. Consistency is key—even on weekends. Good luck!"
      }
    },
    {
      "id": "t3_13lfafr",
      "title": "[Need Advice] How to get into a good routine after work?",
      "body": "I want to be more productive outside of work. I want to workout, cook, take my dog out, learn a new hobby. I’ve been working out inconsistently. I try to take the dog out for a walk when I can. My **biggest** challenge is walking early. I feel like I **can not** get myself to wake up early.",
      "comments": {
        "best_comment": "You gotta fix your schedule, there's no way around it, even your free time needs to be scheduled. The main tip to wake up early is to sleep early and always the same time, including weekends, in a few days you'll naturally wake up the same hour everyday, the problem is that usually when our system is understanding our new routine we screw up during the weekend.   Talking about the routine after work, you have to optimize your activities in a way that you lose time as little as possible like going to the gym after work, go home straight to shower or shower in the gym; right after, you start to cook and if possible cook more meals, this way you save gas/electricity and saves time the next day; schedule what you have to do earlier in the night or maybe during the cooking so you still have a bit of energy like maybe a class or learning a hobby, and the last 1 or 2 hours you have left you rest, watch something dumb, play something, maybe read and slowly let the sleep routine take over.   In a few days you'll love your new routine and you'll realize the more you do the more can be done. Idk why but this happens a lot, when we are lost and without a routine we tend to think we don't have time. but when we figure it out, we understand that there's always a little windows to stick something new you want to try. Be curious, test it, try new things, improvise but always follow your schedule, I like to organize my week during my sunday, this way I know exactly what have to be done in the following days, including when I'll rest.",
        "percentile_10_comment": "You might wanna check out Nuj Alarm Clock.It’s an app I built that charges money if you don’t get up and scan a barcode (e.g. your toothpaste) within a few mins of your alarm.",
        "comment_o3": "I’d stop worrying about the 5 a.m. club for now and build a repeatable “after‑work block” instead. Pick a start cue you can’t miss—say, the moment you set your keys down at home—and lock in a fixed 90‑minute chain: 30 min workout, 20 min dog walk (counts as cooldown), quick shower, then 40 min to cook dinner. Treat that block like an un‑skippable meeting: prep gym clothes and the leash near the door before you leave for work so there’s zero friction when you arrive. Once this is running on autopilot three to four times a week, add a short hobby session right after dinner. Keep it tiny at first, like ten minutes of guitar scales or a language lesson; consistency matters more than duration early on.If you still want mornings later, approach it the same way—shift bedtime 15 minutes earlier every few days, keep the bedroom dark and cool, put the alarm across the room, and give yourself a guaranteed reward (good coffee, a podcast you enjoy) that only happens when you get up. But earn that upgrade by nailing the simpler after‑work routine first. Momentum is discipline’s best friend.",
        "comment_gpt4dot1": "Getting into a good after-work routine is definitely doable, but it helps to start small and build up. If waking up early is a struggle, don’t force it right away—focus on making your evenings more structured first. Try picking one or two things you want to do after work (like a short workout and a dog walk), and set a specific time for them, almost like appointments. Prepping your workout clothes or dog leash ahead of time can make it easier to follow through. Once you’re consistent with your evening routine, you might find it easier to shift things earlier if you want, but there’s nothing wrong with being productive after work instead of before. Consistency is more important than timing. Also, don’t try to overhaul everything at once—add new habits gradually so you don’t burn out. You’ve got this!"
      }
    },
    {
      "id": "t3_xt9y8l",
      "title": "[Need Advice] To people who do work or activities that require immense amounts of discipline frequently , what trick did you employ to get into that flow state",
      "body": "I'm having difficulty turning occasional habits into daily consitent habits and was wondering what others  who were in my situation did to tackl the problem.[Edit] Thank you to everyone who took their time and contributed to the post. I've received some very insightful advice on the techniques i can use to boost my discipline. I will make full use of them",
      "comments": {
        "best_comment": "That’s a tough one. Seems like the best thing I’ve done is to create a first step that is simply too small to fail. I want to walk? I just focus on putting on my shoes. Once I’ve done that I’m much more likely to actually continue on with the task.",
        "percentile_10_comment": "I notice I’m deepest in the flow state when I use mind muscle connection in any physical sport",
        "comment_o3": "I used to wait for that magical “flow” feeling too, but what finally stuck was making the habit so easy to start that my brain couldn’t argue. I pick a cue that already happens every day—first cup of coffee, lunch break, whatever—and as soon as it hits, I do the habit for just two minutes, non‑negotiable. Ninety percent of the time those two minutes turn into a full session and flow shows up; the other ten percent I still get the rep and keep the streak alive.  Before bed I set the stage: gear laid out, doc open, phone out of reach. Removing those micro‑decisions cuts the friction that usually kills momentum. I track each session on a wall calendar so the progress is literally in my face; if I miss a day I treat it like a flat tire—fix it at the next chance, don’t slash the remaining three. After a few weeks the habit feels weirder to skip than to do.  Flow is really just the reward for showing up consistently, so focus on protecting the start, keep the bar low, and let momentum handle the rest.",
        "comment_gpt4dot1": "One thing that really helped me was lowering the activation energy for my habits—basically, making it as easy as possible to start. For example, if I wanted to work out in the morning, I’d set out my clothes and shoes the night before. If it was writing, I’d open my document and jot down a sentence or two before bed. The trick is to make the first step so small that it feels almost silly not to do it. Over time, those small starts add up and your brain gets used to the routine. Also, tracking your streaks (even just with a calendar or an app) can be surprisingly motivating. Don’t worry about perfection—just focus on showing up consistently, even if it’s for a few minutes. The flow state comes more often once the habit is automatic."
      }
    },
    {
      "id": "t3_125e8y1",
      "title": "[NEED ADVICE] how do I balance work, studies and sleep?",
      "body": "I managed to land a wfh job with decent hours. Hours are roughly from 9 am - 7-8 pm. It’s insane how sleepy I feel - at 11 AM, after lunch, then again at 9 PM. How am I even alive? How do I function? I stop caring about things when I feel sleepy. Please advise.",
      "comments": {
        "best_comment": "Youre working long hours. You're working 50-55h a week. Most people are going to feel sleepy from that. Some people will adapt, others wont. There is no magic formula except getting enough sleep and good nutrition",
        "percentile_10_comment": "I would advise against studying before shortly before you head to bed. It's proven that your brain doesn't retain as much information and has a hard time remembering what you read/studied. So for the 1 hour you study before heading to bed its actually like 40 minutes of studying time.",
        "comment_o3": "The drowsiness usually isn’t a will‑power problem, it’s a systems problem, so tweak the system first. Aim for a true 7–8 hours of sleep in one block; for most people that means lights out around 10:30 pm if you’re logging back on at 9 am. Give yourself a 30‑minute wind‑down without screens so you’re actually asleep when you think you are. When you wake up, get bright light and a glass of water immediately. Hold off on the first coffee for 60–90 minutes; that lets your natural cortisol wake you up first and keeps the crash away.The 11 am slump is often blood sugar. Keep breakfast protein‑heavy and go easy on simple carbs at lunch. Think chicken/veg, not a big bowl of pasta. Right after eating, walk around the block or do a quick set of push‑ups; a couple of minutes of movement blunts the post‑meal crash better than more caffeine.Use the fact you’re WFH: stand for calls, stretch every hour, open the curtains. Tiny movement breaks keep circulation up and stop the “office‑chair coma.” If you’re still nodding off, schedule a 15‑minute power nap before 2 pm—set an alarm, lie down, eyes closed. It’s surprisingly effective and won’t wreck nighttime sleep.On study time, pick one primary slot and protect it. If you’re a night owl, shut the work laptop at 7:30 pm sharp, grab dinner, then study 8:30–10 pm. If you’re wiped by then, flip it: study 7:30–8:45 am, log in to work at 9. Either way, time‑box it and treat it like a meeting. Weekends become your longer, deeper study blocks so weekdays only need maintenance sessions.Finally, audit your work hours. Many remote gigs sprawl because we let them. Decide on a finish time, tell coworkers you’ll reply next day, and log off. A hard stop gives your brain permission to switch modes, which makes both studying and sleeping easier.Dial in sleep, food, light, and boundaries first; discipline gets a lot easier when the body isn’t fighting you every few hours. Good luck—you’ll feel a difference in a week of consistent tweaks.",
        "comment_gpt4dot1": "Honestly, those hours are a grind, especially if you’re trying to fit in studying and still get enough sleep. The sleepiness you’re feeling is super common, especially with WFH where it’s easy to blur the lines between work and rest. First, try to set a consistent sleep schedule—even if you can’t get a full 8 hours, being regular with your bedtime and wake-up time helps a lot. If you can, squeeze in a short nap (15-20 mins) during a break; it can make a huge difference in alertness. Also, pay attention to your meals—heavy lunches can make you crash hard, so lighter, protein-rich meals might help. For studying, see if you can carve out even 30-45 minutes before or after work, and use techniques like the Pomodoro method to stay focused. Lastly, get some movement in, even if it’s just a quick walk or stretching—physical activity can help fight off that sluggish feeling. It’s all about small adjustments and being consistent. You’ve got this!"
      }
    },
    {
      "id": "t3_sfvs5f",
      "title": "[Need Advice] My sleep schedule is flipped and the lies I’m telling to avoid anyone finding out is ruining my life",
      "body": "I’ve been chronically sleep deprived since March 2020. Up until recently I would get 3-5 hours a night for 1-2 weeks before it all caught up and I’d have a 24+ hour sleep. I was going to bed like 2-4am and waking up at 8am to get to work by 9am.Well since I went back to school in September I no longer have any structure in my life as everything is online and pre recorded. I was still going to bed by 4-5am and wake up for 11am.January, things have changed. I don’t remember the last time I went to bed without the sun in my eyes. I’m sleeping at 7am-10am and waking up like 4-6pm everyday. I keep missing my one non-recorded class. I’m depressed because I wake up and it’s dark. And when I have plans at, for example, 6pm, and I wake up at 5:45, I have to make up an excuse bc the truth is too embarassing. I’ve been making up excuses since 2020 but I could also tell the truth sometimes since waking up at 12 can be understandable, especially bc I was working ~60hrs/week.Now I’ve got all these lies and it’s hard to keep track of what I’ve said. Add in the sleep deprivation and I don’t even remember saying half of them, and if any are actually true. Im so sick of being like this but every time i reset my sleep schedule it’s messed up again within a day. One time i started my day at 4am and still went to bed at 7am the next morning. Please help me. Also I have ADHD which I know is a large contributing factor",
      "comments": {
        "best_comment": "You’re right, a lot of people with ADHD have Delayed Sleep Phase Syndrome (DSPS)! It sounds like you were really burned out too and you were likely experiencing revenge bedtime procrastination. I wouldn’t be surprised if you were left feeling under stimulated and unable to sleep by the end of the day because of having to work so many hours without getting to do anything personally interesting?         Anyway, it sounds like maybe you should just come clean to some people about what’s been going on if you can. Sometimes we just have to swallow our pride and expose the embarrassing truth because we need help. And there’s nothing wrong with that. Please be kind to yourself, because it sounds like you’ve been trying your best and it’s been really difficult!    Also, have you considered getting professional help from a therapist? If you find the right one, they’re great for helping to teach the right tools to keep yourself from spiraling into bad situations like that and managing ADHD. And also the depression. I’ve been there, and I know it’s not fun, and I know that it can be hard to take the initiative to try to make things better on your own, so consider getting help!    Maybe also try posting this to the ADHD sub, as I’m sure you’re not alone in this. I’m not the best with sleep hygiene myself, given that I also have ADHD.Edit: as another commenter said: exercise is important! Never used to like to do it, but I sleep so much better and I actually really like working out now. Provides some good stimulation for that ADHD brain!",
        "percentile_10_comment": "Hey brother wow I’m exactly the same. It’s almost like I’m wired to be awake at night still alert. I don’t like winters either short days. My advice to myself & you is to put an alarm 30 minutes earlier everyday & put timer when using phone at night. Eat healthy, must exercise to get tired 😴. Socialize when you can to destres",
        "comment_o3": "I’ve been in that “sleep at sunrise, wake at sunset” loop before, and what finally got me out was treating the wake‑up time as non‑negotiable instead of focusing on bedtime. Pick a realistic hour you want to get up (say 9 a.m.) and set multiple alarms far from the bed. No matter how little you slept, get out of bed at that time, expose your eyes to bright light immediately (sunlight or a 10 k‑lux lamp), and move your body for a few minutes. The first day will be rough, the second a little less so, and by the third or fourth your body will crash earlier in the evening because it’s short on sleep. Keep the wake‑up time identical for at least two weeks—even weekends—so your circadian clock can reset.At night, give yourself a strict “screens off” cutoff an hour before the earliest time you’d be okay falling asleep. Use that hour for something boring and dim‑lit: paperback reading, light stretching, journaling. If you’re still wide awake after twenty minutes in bed, get up, do a low‑stim activity until drowsy, then try again; lying there frustrated trains your brain to associate bed with wakefulness.ADHD makes sleep hygiene harder because impulse control is already taxed, so make the path of least resistance the one you want. Put the phone in a different room, schedule Do‑Not‑Disturb, set up an automatic computer shutdown at a certain hour, and lay out morning clothes and a caffeine source the night before.About the lies: the cleanest exit is a brief truth. “My sleep schedule went off the rails during online classes; I’m fixing it now.” Most people will shrug and move on, which frees you from juggling stories and lets you use that brainpower for the actual reset.Finally, use accountability so the new rhythm sticks. Text a friend a selfie on your morning walk, book an early study group, or join a Discord where people post daily check‑ins. Consistent external pressure keeps ADHD brains on track until the habit feels normal again.Give it one solid month of identical wake‑ups and light exposure, and the 7 a.m.–10 a.m. bedtime will start to feel as weird as it should. You’ve already pulled 24‑hour sleep marathons; that shows your body desperately wants the rest. Align it with the clock, keep it boringly consistent, and the energy (and honesty) will follow. Good luck—you’ve got this.",
        "comment_gpt4dot1": "Honestly, you’re not alone—ADHD and the lack of structure from online classes can absolutely wreck a sleep schedule. The lies and shame spiral are rough, but you can break out of it. First, try to stop beating yourself up for the current state of things; it’s a tough combo of circumstances, not a personal failure. The most important thing is to add some structure back, even if it’s artificial. Pick a “wake up” time that’s earlier than now but not extreme—like 1-2pm—and stick to it for a week, no matter when you fall asleep. Use alarms, put your phone across the room, and get out of bed as soon as you wake up. Once that’s consistent, gradually move it earlier by 30-60 minutes every few days. Also, get sunlight ASAP after waking, even if it’s just standing by a window, and avoid screens for an hour before you want to sleep. If you can, schedule something small but non-negotiable in the morning (even a call with a friend or a daily walk). It’ll take time, and you’ll probably slip up, but consistency is more important than perfection. And if you haven’t already, talk to your doctor about ADHD and sleep—sometimes meds or therapy can help a ton. You’re not doomed to this forever, and you can get back on track."
      }
    }
  ]
}