{
  "posts": [
    {
      "id": "t3_13sx2du",
      "title": "[NEED ADVICE] need to learn real discipline especially without medication. Need to rewire my brain",
      "body": "I really feel like a complete failure. I Can’t handle it. I was diagnosed with adhd and binge eating disorder. I take vyvanse 5 days a week. My issue is, even when I do take my vyvanse I’m not as productive as I’d like to be. I take two days off so the vyvanse can keep working. On those days off, I eat so much. I’m just so disappointed in my self. It’s hard to drink water. I’m lethargic on my days off. I only work out on the days I take vyvanse. I’m trying to learn to trade but I need to be more focused and put my time into it. My diet is shit. I’m tired. I need to know how to do things at least decent without my medication and I need to utilize my time and be more productive when I do take my medication. Food makes me feel like shit. I’m just mad at life. I’m not depressed I’m just disappointed. \n\nI’m a ball full of energy. I’m an attractive lady. I am in college part time I have a job I have a car I have a plan. I am not dirty. But I am unorganized. I am reasonable and realistic and I think about my future a lot and my future responsibilities towards my future family. I take care of my body , skin, shower, teeth, but I suck at eating well and I suck at drinking water so my body feels like shit. But I’m just doing so bad. My binge eating ruins me. I’m a caffeine addict. I don’t know how I will function without my meds when I’m pregnant without wanting to kill myself from all the binge eating and laziness I will become and I will hate my body. I am 22 years old haven’t even gotten my associates degree yet.\n\nHow do I just reset my stupid brain? From food And phone and simple easy dopamine pleasures like sugar and food and my phone. How do I have energy? How do I get motivated ? How do I stay focused and not side tracked? How do I reset my brain to be able to handle boringness and discipline? Discipline is doing what u don’t wanna do. I’m not disciplined. \n\nHow do I rewire my brain to be able to handle discipline? And how do I stay focused and get back on track if I fall off? I feel hopeless but I care so much. I don’t feel good . I would feel so guilty being a horrible wife and mother who can’t take take of her family and her self. Like I just want to be able to have ups and downs but consistently be disciplined in all areas of life and just deal with the pain and boringness of it until I get used to being disciplined. HOW do I do this? I’m\nTired of going in circles :/ I have so much wrong with me but I wanna fix it",
      "comments": {
        "best_comment": "Re: the meds part, why?  Genuine question, as a reliant Vyvanse taker myself.\n\nYou wouldn't expect a diabetic to just learn to live without insulin, or a paraplegic to suddenly get up out of their wheelchair and start walking.  So what's wrong with taking Vyvanse to correct the chemical imbalances in your brain?\n\nThat's how my psychiatrist justified it to me at least though, lol",
        "percentile_10_comment": "Main thing you need to focus on is getting rid of caffeine.  Your body becomes extremely dependent on it.  That’s why you feel like you have no energy.  It’s hard to cut caffeine addiction but trust me it’s worth it.",
        "comment_gpt4o": "Hey there! First off, it's great that you're reaching out and looking to make positive changes. It sounds like you're juggling a lot, and it's understandable to feel overwhelmed. Here are a few steps that might help you build discipline and manage your habits better:\n\n1. **Start Small**: Focus on one habit at a time. For example, try drinking a glass of water first thing in the morning. Once that becomes routine, add another small habit like a 5-minute walk or a short meditation session.\n\n2. **Plan Your Days Off**: Since you feel lethargic on your Vyvanse-free days, plan low-energy activities that still keep you engaged. This could be reading, light stretching, or organizing a small area of your room.\n\n3. **Mindful Eating**: Try to be more conscious of your eating habits. Keep a food journal to track what you eat and how it makes you feel. This can help you identify patterns and make healthier choices.\n\n4. **Limit Phone Time**: Set specific times for phone use and stick to them. You can use apps that limit screen time to help you stay on track.\n\n5. **Exercise Regularly**: Even on days you don't feel like it, try to do some form of physical activity. It doesn't have to be intense; even a short walk can boost your mood and energy levels.\n\n6. **Celebrate Small Wins**: Acknowledge and celebrate your progress, no matter how small. This will help you stay motivated and build confidence in your ability to change.\n\nRemember, discipline is a skill that takes time to develop. Be patient with yourself and keep pushing forward. You've got this!",
        "comment_gpt5_verbositylow_efforthigh": "Good news: you don’t need a “reset,” you need guardrails that work with your brain. Think floor and ceiling. A floor for off-med days (bare minimums so you don’t spiral) and a ceiling for on-med days (structured deep work so you use the focus well).\n\nOff-med floor: before you touch your phone, chug a big glass of water, eat a protein-first breakfast (eggs/Greek yogurt/protein shake + fruit), and take a 10–15 minute walk outside. Then do one 25-minute focus block on the most important thing for the day. That’s it. Use the 5-minute rule to start anything. If you do only that on off days, you’re winning.\n\nOn-med ceiling: plan the night before. Two 50–60 minute deep-work blocks early in the day for trading study/backtesting with the phone in another room, Freedom/Forest/Focusmate on, clear checklist, then stop. Schedule your workout at a fixed time and treat it like a class you can’t miss. Keep start and stop times; don’t try to “go all day.”\n\nFood: control the environment, not your willpower. Don’t keep trigger foods at home; if you must, buy single-serves and put them out of sight. Pre-plan tomorrow’s meals before bed: 3 meals + 1 snack, protein + fiber at each. Eat before you’re ravenous. When an urge hits, delay 10–15 minutes, drink water or a diet soda/tea, have a protein option, then decide. Brush your teeth after dinner. Track only three things for now: did I eat protein each meal, did I binge, what was the trigger.\n\nHydration and caffeine: make “water before coffee” a rule. Aim for 1 liter by noon and another by 6 pm. Get a big bottle, add a squeeze of lemon or electrolytes if that helps. Taper caffeine, don’t quit cold turkey; cut 25% per week and set a 2 pm cutoff, swap to tea/decaf later in the day.\n\nEnergy: fixed wake time all 7 days, get morning light, and move a little even off meds. A 10-minute walk after meals is huge for energy, mood, and appetite. If the gym feels impossible, do one set of squats, pushups, and a plank at home. Minimum viable movement counts.\n\nPhone: precommit to scroll windows (e.g., 12:30–1 pm and 8–8:30 pm). Everything else blocked. Charge the phone outside the bedroom. Use grayscale and app blockers during work blocks.\n\nWhen you slip, apply “never miss twice.” After a binge or lazy day, do one piece of your floor within the hour—glass of water, 5-minute tidy, 10-minute walk—and move on. Perfectionism is the trap.\n\nDo a 20-minute weekly reset on Sunday: plan meals, order groceries, pick your two deep-work blocks for each on-med day, lay out workout clothes, and set one priority for each off-med day.\n\nAlso, loop in pros. The two-day med breaks might be making appetite swings worse—ask your prescriber about dosing or whether breaks are necessary. For binge eating, CBT-E or a dietitian who knows ADHD/BED helps a ton. Starting that now sets you up well for the future, including pregnancy.\n\nFor the next 14 days, lock in three non-negotiables regardless of meds: water before coffee, protein breakfast, and a 10-minute walk. Stack from there. You’re 22 with time on your side—boring, repeatable systems will beat motivation every time."
      }
    },
    {
      "id": "t3_ydi7ga",
      "title": "[Need Advice] How do I fix my life",
      "body": "I don't really have any friends. I have nojob. The only thing going for me is that I'm not ugliest guy in the world and im in ok shape physically. My parents are also old but still alive and we talk occasionally which im grateful for in a lot of ways but feel like once they are gone I'll have absolutely no support system.  I have a bit of savings as well which is helping me get by but life feels confusing and difficult at times. I also feel old because I'm 31 and I don't have any parts of my life figured out at all. I lost all my relationships in 20s because I was depressed from making stupid decisions snd feeling confused about life. I was also ghosted by a girl recently who was pretty attractive but didn't want to put up with my shit apparently. I think she only wanted sex anyways which is a strange thing to say and im kind of over that part of my life... or she just thought i was a loser. She wouldn't really say other than she didn't want anything serious and I was too serious...\n\nI wish felt like I was making a difference in people's lives even though I feel lost. Fitness is what I do currently but outside of that I don't very many other positive habits or routines . At times I feel like I'm crazy cause I can be somewhat miserable on more than one occasion and can't interact very well with other people. People are fed up for good reason. I dont have a life",
      "comments": {
        "best_comment": "if you're good at physical training and like to help people, learn to be a fitness instructor and help ppl that way",
        "percentile_10_comment": "It is never too late to start as long as you move in the right direction. A 10 or 100 small steps in the right direction  will still be 10 or 100 steps better then where you were before.\n\nHaving said that, make a list of things or goals in major areas of your life physically, mentally, emotionally, financially, spiritually. Break these into  20 small actionable steps.\n\nE.g Physical goal: Want to get fit? Get up an hour early. Go for a walk, excercise or jog everyday for 30 minutes. Avoid junk food. Eat healthy. If you can do this for a month consistently, you would have done 15 hours of exercise and had an improved diet. Over a long term these add up and count.\n\nList down similarly what you can do. In terms if finances, try getting a job. Create a resume. Update it to all job portals. Look an hour for all jobs available and apply. Ask friends for job openings.... you will land something.\n\nTry going to mall or retail outlets and look for or ask for job. \n\nEveryday have a sense of accomplishment. Try saving one dollar a day, and put it in a jar where it is visible to you....\n\nJoin a library and read 2-3 pages of a book you like.\n\nListen to uplifting music.\n\nAvoid wasting time.\n\nCut negative thinking and be friends and supportive to your self. \n\nEveryday try to encourage yourself and do better and be in a better place than yesterday. Remember every step ahead is progress. \n\nBelieve in yourself. Change your mindset for a better you. \n\nI may not know you, but believe in you. Because you took the effort to write and get better. You can do it bro.",
        "comment_gpt4o": "Hey there! First off, it's great that you're reaching out and looking to make positive changes. It sounds like you're in a tough spot, but the fact that you're in decent shape and have some savings is a solid foundation to build on. Here are a few steps you might consider:\n\n1. **Set Small, Achievable Goals**: Start with something manageable. It could be as simple as waking up at the same time every day or dedicating 30 minutes to reading or learning something new. Small wins can build momentum.\n\n2. **Explore New Interests**: Since fitness is already a part of your life, maybe look into related fields like nutrition or personal training. This could open up new career opportunities and help you meet like-minded people.\n\n3. **Build a Routine**: Having a daily routine can provide structure and a sense of purpose. Include activities that promote well-being, like exercise, meditation, or journaling.\n\n4. **Reconnect with People**: Try reaching out to old friends or family members. Even a simple text or call can help rebuild connections. You might also consider joining local groups or clubs related to your interests.\n\n5. **Consider Professional Help**: If you're feeling stuck, talking to a therapist or counselor can provide guidance and support. They can help you work through past decisions and plan for the future.\n\nRemember, it's never too late to make changes and improve your life. You're not alone in feeling lost, and taking small steps can lead to big changes over time. Keep pushing forward!",
        "comment_gpt5_verbositylow_efforthigh": "31 isn’t old. You don’t need a grand fix—just a boring plan you can repeat.\n\nRun a 12‑week reset with two tracks: stabilize and build. Stabilize means income and structure. Build means skills and people.\n\nEvery weekday, set three protected blocks: 90 minutes for job search, 60 minutes for one skill, and your workout. Add two tiny non‑negotiables: 20 minutes outside and 10 minutes tidying. Track these on a wall calendar with an X each day. If motivation is low, use the two‑minute rule to start; once you’ve begun, ride the momentum.\n\nGet income within 14 days. Don’t chase perfect. Apply to five roles a day and walk into places. Because you’re into fitness, hit local gyms, rec centers, and PT clinics for front desk, attendant, or trainer aide roles; get CPR/AED this week. If coaching interests you, register for a basic CPT and study during your skill block. If not, pick something that hires fast and gives structure—warehouse, delivery, moving, hospitality—while you upskill.\n\nMake a difference and build a support system by showing up where help is needed. Commit to one weekly volunteer shift at a food bank, animal shelter, Habitat build, or youth program. You’ll meet good people and leave each shift feeling useful. On top of that, join one recurring group where the same faces appear: BJJ, CrossFit, climbing, run club, Toastmasters, or improv. The rule is simple: be on time, ask two questions, thank the organizer.\n\nUse your fitness to connect. Offer a free Saturday park workout for friends or neighbors. Post a simple invite, keep it beginner‑friendly, and be consistent. It scratches the “make a difference” itch and can evolve into training experience or paid clients.\n\nPause dating for 6–8 weeks while you lock this routine. Put that energy into friendships. Text three old acquaintances this week with a low‑key invite like coffee or a walk. Keep conversations light, avoid dumping, and aim to be the person who follows through. Call your parents weekly.\n\nGuard your mind. Fixed sleep and wake times, sunlight in the morning, decent food, and limits on alcohol/weed/doomscrolling will do more for your mood than you expect. If depression keeps hanging around, book a therapist or doctor; that’s not a moral failure, it’s a performance tool.\n\nStart today by updating your resume, booking one volunteer shift, and laying out tomorrow’s clothes. Tomorrow, do your three blocks. Then do them again. Boring plus consistent beats lost plus intense. Give it 12 weeks and reassess—your life will look very different."
      }
    },
    {
      "id": "t3_xhwj1a",
      "title": "[Need advice] any unconventional ways to beat brain fog quickly?",
      "body": "I've seen all the basic stuff like sleep more, diet, exercise, meditation, going to doctor etc. but none of them have really worked, so when brain fog hits I just have to accept I'm worthless and that's getting annoying. I have also tried drinking lots of caffeine and that doesn't help either. The only thing that seems to work most of the time is taking a shower and I can't take a shower like 3 times a day just for brain fog. What can I do? I'm so tired of this",
      "comments": {
        "best_comment": "Maybe Vitamin b? A methylated version with multiple variants of b in it worked for me a few years back",
        "percentile_10_comment": "Can absolutely second this. Sleep+hydration are the longer term cures imo but a b vitamin will work wonders!!",
        "comment_gpt4o": "Have you tried experimenting with your environment or routine when brain fog hits? Sometimes a change of scenery or a quick walk outside can help reset your mind. You might also want to try a short, focused breathing exercise or a quick session of stretching to get your blood flowing. Another unconventional method is to engage in a brief, stimulating activity like a puzzle or a game that requires concentration. These can sometimes help clear the fog by giving your brain a different kind of workout. Remember, it's about finding what uniquely works for you, so don't hesitate to try different things until you find your go-to solution. Keep at it, and don't be too hard on yourself—you're definitely not worthless!",
        "comment_gpt5_verbositylow_efforthigh": "If showers help, you probably respond to fast “state change.” Build a 3–5 minute reset you can do anywhere. Step outside for bright light and fast movement for two minutes (stairs, brisk walk, a quick set of air squats). Then hit cold on your face/forearms for 30–60 seconds (ice pack, cold tap, or a wet washcloth). Drink a big glass of water with a pinch of salt or an electrolyte packet; if it’s been a while since you ate, add a small protein-plus-carb snack. Chew strong mint gum, set a visible 5‑minute timer, and write the very next physical action in one short sentence, then start it. This combo mimics the temperature, novelty, airflow, and sensory jolt of a shower without needing one. \nTwo extra quick levers if you’re stuck at a desk: do 30–60 seconds of horizontal eye movements (look left-right repeatedly) to wake up attention networks, and stand to work for the first 10 minutes to break the “slump posture” loop. If caffeine alone doesn’t help, a caffeine nap can: drink a small coffee, set a 20‑minute timer, close your eyes. The caffeine kicks in as you wake. \nDiscipline angle: pre-make a “fog list” of low-cog tasks (tidy desk, inbox triage, laundry, scheduling). If the reset doesn’t clear it in 10 minutes, switch to that list so the day still moves forward. Treat fog as a cue to run your protocol, not a verdict on your capability."
      }
    },
    {
      "id": "t3_vv187j",
      "title": "[Need advice] How do I reward myself after accomplishing a small goal I set to better myself?",
      "body": "",
      "comments": {
        "best_comment": "Try this tip. Every time when my salary is in, I allocate $100 to a separate savings account. This is the bonus I will receiveto spend however I want if i complete a certain mission, if I don't then it rolls over to the next month. Essentially you are setting time aside to work on yourself, to pay yourself.",
        "percentile_10_comment": "A man by the name of Andrew D. Huberman who is a Neuroscientist at the Standford school of medicine has a great podcast about this topic of creating goals, achieving goals, and how to reward/punish yourself according to those goals for the most productive results. I’ll try and find the episode title and number and edit it into this response.\n\n[The Science of setting and achieving goals.](https://open.spotify.com/episode/6cO0BC9EEedrKhxQtjuo80?si=-cobxXi_Q-yNMRMs9AgIUw)",
        "comment_gpt4o": "Great question! Rewarding yourself is a fantastic way to reinforce positive habits. The key is to choose rewards that are enjoyable but don't undermine your progress. For small goals, consider simple pleasures like taking a relaxing walk, enjoying a favorite snack, or watching an episode of a show you love. If you're working on a bigger habit, you might save up for something more substantial, like a new book or a day trip. The important thing is to make sure the reward feels special and is something you genuinely look forward to. Keep it balanced, and you'll find it helps maintain your motivation and discipline over time. Keep up the great work!",
        "comment_gpt5_verbositylow_efforthigh": "Make rewards immediate, brief, and aligned with your goal. Use a simple rule: “After I do X, I get Y for Z minutes.” For example, finish a study block → make a fancy tea and sit outside for 5 minutes; finish a workout → hot shower and one favorite song; finish cleaning → one short YouTube video. Set a timer so the treat doesn’t swallow your next task.\n\nCreate a small “reward menu” ahead of time so you don’t negotiate in the moment. Pick things that replenish you without fighting the goal: stretch, quick walk, 10 minutes of a show, a chapter of fiction, a game round, texting a friend. If you’re saving money or improving nutrition, keep it free and non-food.\n\nLayer it: a tiny reward after each small win, a slightly bigger one if you complete your daily plan, and a weekly treat for keeping a streak. Put a cap on bigger treats so it’s sustainable. Temptation bundling also helps—only listen to a favorite podcast while doing the habit.\n\nFinally, make progress itself rewarding. Track a streak on paper or an app and write one sentence: “Today I did X; it helped because Y.” That visible win is a powerful reward."
      }
    },
    {
      "id": "t3_13nhprw",
      "title": "[Need advice] I need to learn how to control and suppress emotions and feelings",
      "body": "When I (30s M) have feelings, whether it be love, betrayal, happiness, sadness, etc, I feel it deeply, to the point my emotions affect my thought and decision making processes. My emotional response to what would be the logical actions to take prevents me from making what deep down I know would probably be the best decision, but my feelings and emotions focus on the hope of what I desire, instead of looking at the reality of what I actually receive. Now I'm at the point where I'm losing myself because of how confused and distraught I have allowed myself to become due to inaction one way or the other. How can I check my emotions to be able to think clearly and logically in order to be able to make the best decisions for myself? Any and all advice is appreciated.",
      "comments": {
        "best_comment": "I'm not a therapist but I don't think you need to suppress your emotions, that will only make things worse. I think a better approach would be to process the emotions. You can even set up a time and date in your calendar to process those feelings, as if it were a meeting or appointment, that way you show up.\n\nThe advice given by others is good but I'd like to add some that I haven't seen mentioned:\n\n1. Use the voice recorder on your phone and just talk, cry, whatever you need to. Talk to yourself or pretend you're talking to someone and let all the emotions out. Then after you can even try listening to the audio pretending you're listening to a friend venting since we tend to be harsher on ourselves but when it comes to others, we can be more patient and less judgmental. Then ask questions. Whether it's questions to fix the problem or questions that help you get to the root of things to try to heal on your own. (why do you feel this way, when was the last time you felt like this, where might this come from? Is there a pattern?, etc...it all depends on whether you want to brainstorm on how to fix a problem or if you wanna go back in your past and try to understand the why so then you give yourself some slack and actively start working on what you can control to change your situation)\n\nThat's what I do sometimes and it works. Just talking or recording yourself. Again, I'm no therapist. I'm just sharing what has worked for me.\n\n2. Sometimes I also try to pretend I'm my own daughter. No, I'm not a mother but I believe all humans want the best for their offspring, even if it's hypothetical ones. So, if you were your own daughter/son, as a parent, what would you think is best for your child? Do that.\n\n3. Meditation as well is very helpful. Set an intent before you meditate, state the question you want answered and then clear your mind and focus on your breathing. Your brain usually comes up with an answer during the meditation session or you stumble upon one days later. That also works for me.\n\nGood luck!",
        "percentile_10_comment": "Try journalling. Write or talk to someone about it, don't suppress it, it will just bottle up and that's not good. Writing things helps me see it as it is and not with emotions but with logic and rationale.",
        "comment_gpt4o": "It sounds like you're dealing with some intense emotions, and it's great that you're looking to find a way to manage them better. One approach you might find helpful is practicing mindfulness. This doesn't mean suppressing your emotions but rather acknowledging them without letting them control your actions. Start by taking a few minutes each day to sit quietly and focus on your breathing. When emotions arise, notice them, but try not to judge or react immediately. This can help create a bit of space between feeling and action, allowing you to make more thoughtful decisions.\n\nAnother technique is to develop a habit of journaling. Writing down your thoughts and feelings can help you process them and see patterns in your emotional responses. Over time, this can give you more clarity and help you identify when your emotions might be clouding your judgment.\n\nLastly, consider setting small, achievable goals for yourself that align with your logical decisions. This can help build confidence in your ability to act despite emotional turbulence. Remember, it's a process, and it's okay to take small steps. You're on the right path by seeking ways to improve, so keep at it!",
        "comment_gpt5_verbositylow_efforthigh": "Don’t aim to suppress emotions; aim to separate the feeling from the choice. Emotions are data, not directives.\n\nWhen you feel a spike, impose a no-action window. Ten minutes minimum; 24 hours if intensity is above 6/10. Do five slow breaths and move your body for a few minutes. Then write before deciding: split a page into Facts vs Story and What I Want vs What I’m Getting. List your options and the most likely outcomes in 1 week and 1 month. Decide after you’ve written.\n\nCreate personal policies so tricky calls are pre-decided: no big decisions after 10 pm, no texts or emails when angry, no commitments when sleep-deprived, and if emotion is above 6/10, wait until morning.\n\nBuild reps. Use the protocol on small stuff daily so it becomes automatic. Keep a decision journal (date, emotion rating, your prediction, outcome) and review weekly to calibrate.\n\nSupport it with basics: consistent sleep, regular exercise, solid meals; keep alcohol and caffeine moderate. A calmer body makes clearer choices.\n\nIf you want more structure, look up CBT/DBT emotion regulation skills or Stoic morning/evening reviews. This is a trainable skill, and consistency beats intensity."
      }
    },
    {
      "id": "t3_xc1fsf",
      "title": "[Need advice] Scared of making any attempt so I procrastinate",
      "body": "So, what I’ve noticed is that I get very scared to do anything with studying or homework. \nI just get scared to even make an attempt at things… \n\nUsually, when it’s the day something is due, that fear of getting a bad grade overcomes that fear of making an attempt at doing things. \nIt’s struggle though, and I end up hurting a lot. \n\nI’m just wondering about how I can just do things with school even if there is no due date to scare me into trying even though I get so afraid to (because I want to get things done earlier and not last second) \n\nI just don’t know how to get over that fear of doing anything at all, of even making an attempt…..\n\nIt’s not that I just want to play games or do something else, it’s just fear of doing it at all…..",
      "comments": {
        "best_comment": "I don't know if the experience is similar or not but I will share my incidents with exams.\n\nIn my third year, Few weeks before exams, I used to start worrying  and used to make a schedule. Then another day I used to procrastinate saying I will do it next day. Slowly the time went shorter and more fear gripped me, but I used to deliberately ignore them by distracting myself with social media, movies ,series, booze, friends etc . Then when there was little time left I started thinking I'm not gonna make it. Although some part of me was saying just do whatever you can do with remaining time , but there was gripping fear in one hand and comfort of distracting myself on another. I choosed comfort and spend watching Simpson with fear still inside of me.  In the end I didn't even went to give my exams \n\nFirstly you need some motivation and need to believe in yourself. You may not believe but I passed 3 major subjects of my final mbbs exams just by reading for a day. I hadnot touched books in years. I read while walking in room. I first read every points 3 -4 times then recalled it two times without looking at book. Then I used to speed revise hard topics in every few hours, like just taking a quick glance. In the morning I revised all of it with rapid speed reading.  In exam I could recall more than 60% \n\nSo whatever time you have left, believe me you can manage. The first and foremost thing is to get started ,once you complete some topics it will give you a boost, thats for sure  but that boost may lead to waste time , so first make a schedule of every hour and day. You may not meet all of it but it will keep you on track. \n\nIf you are finding really hard to start then try this. Think about the fear , think about the consequences, imagine the consequences, relate it with your past. Don't  distract yourself with comfort. I repeat it don't distracting yourself with comfort this time. Just meditate upon the thoughts. You may feel very bad , but do it. Face the fear completely  and feel the sense of responsibility. Have a hope that if I start it now I will make it. And trust me ,you will make it. \n\nNow you need a boost to motivate yourself past the fear. Get a cold shower, just stay in that shower for long time, saying I'm gonna do it. Once you complete it your mind will sense the result of your effort and motivate you somehow. Then just go and start it. \n\nGood luck bro , you can do it.",
        "percentile_10_comment": "Pretend you are playing an acting role, or are controlling a robot, and your character/bot puppet is studying or doing whatever project. They are miserable, but getting on with it, putting in a C+ effort.\n__\nSometimes making it a weird game like this works for me, or at least just accepting it's going to be miserable at first like like jumping in a cold pool, or telling myself giving 75% of my best effort is fine. Usually end up  going beyond that after getting into the groove of it.",
        "comment_gpt4o": "Hey there! It sounds like you're dealing with a pretty common issue, and it's great that you're reaching out for advice. One thing that might help is breaking your tasks into smaller, more manageable pieces. Instead of thinking about the entire assignment, focus on just starting with the first step, like reading the instructions or gathering your materials. This can make the task feel less overwhelming and help you build momentum. \n\nAnother strategy is to set a timer for a short period, like 10 or 15 minutes, and commit to working for just that amount of time. Often, once you get started, you'll find it easier to keep going. Also, try to remind yourself that it's okay to make mistakes or not be perfect on the first try. The important thing is to start and learn from the process. \n\nLastly, consider rewarding yourself for completing tasks, even the small ones. This can help create a positive association with getting things done. You've got this!",
        "comment_gpt5_verbositylow_efforthigh": "Been there. The trick isn’t to erase the fear but to make “attempting” tiny and automatic. Use a 10‑minute Starter Timer: sit down, put your phone away, open the assignment, write a one‑line plan or the ugliest first sentence, and work until the timer ends. Full permission to stop after. Your only grade is “Did I start?”\n\nSchedule a daily 15‑minute Start Session at the same time/place, even when nothing’s urgent. You’re practicing the skill of beginning. Track it with a simple X on a calendar—keep the chain alive.\n\nCreate real stakes before the due date. Break each assignment into mini‑deadlines (outline, first page, problems 1–3) and send proof to a friend, study buddy, or TA by specific times. Body‑double sessions (library, Focusmate, “study with me” videos) help a lot.\n\nEnd every session by writing the next physical action on a sticky note—like “open PDF to p.12 and highlight definitions”—and leave the file open. Lowering the next start’s friction kills dread.\n\nWhen the fear spike hits, use a simple script: 5‑4‑3‑2‑1, breathe out, start the timer, do the next action badly on purpose. You don’t need to feel ready; you need one small rep. Do this for seven days and you’ll already be starting earlier."
      }
    },
    {
      "id": "t3_vyhoxf",
      "title": "[Need advice] I'm a 26 year old failure and I don't know what to do anymore.",
      "body": "I'm 26 years old and I am a failure who is completely useless to society. What should I do?\n\nI'm a stereotype loser. I'm 26. I still live with my parents. I have a low paying job that doesn't translate to anything useful. I have zero interest. I have zero real life experience. I hate everything about my life and most of the time I only think about either commiting suicide or hoping I die peacefully. \n\nIt's not like I didn't try. When I went to college I tried getting into a decent STEM field, but because I was a dumbass I couldn't even pass basic math, so I flunked the barrier to entry for basically every major that's worth attending college for. Instead I got a journalism degree which is the worst decision I have ever made in my life. There are no jobs for this field and now they lowered the requirements to allow even high school grads to get the jobs so now it is literally a useless degree. So at this point I am 30k in debt as well from a dogshit degree that I regret everyday I wake up. \n\nI have no idea what to really do because I mostly hate life and everything about it. I'm tired of popping anti depressants that only keep me just above water in terms of mental stability because without them I can't even sleep because I have rapid thoughts of suicidal and sometimes even homicidal ideation in my head. \n\nHow can I turn my life around while also trying to focus and push through my own mental state.\n\nEdit: I didn't think I would get a huge response from this post so I want to thank everyone who posted. There are a lot of people who posted really thoughtful things and I appreciate that.",
      "comments": {
        "best_comment": "26 is young. Plenty of time to turn your life around. Figure out what you want out of life and work backwards. If you're most people, what you want will involve some amount of money and working on your social skills.\n\nLife is short, but it's longer than you think. The secret to nearly everyone's success (except the very lucky) is consistency.\n\nFigure out what you want - it doesn't have to be something huge like world peace. It could be \"to travel the world\" or \"to buy a house\" or \"get married and raise a family\" or as simple as \"get a job that lets you live comfortably\". Figure out what it is.\n\nConsistency compounds quickly. Reaching your goal may only take a couple years depending - if you really stick to it. Then you can move on to the next thing, maybe something bigger. Being successful itself is a skill - the more you are successful and reach your own goals - the easier it is to be successful. Just decide what's important to you and start today, then do it every day.\n\nBreak down the goal into smaller chunks - if it's get a good job maybe that involves picking a skill you can self-teach fairly easily, then committing to that skill and the job search. If it's getting a girlfriend, maybe that includes getting into good shape and improving your social skills. The point is - pick one thing, right now, and stick to it. \n\nThe secret is consistency and you feel the way you feel because you have not been consistent in developing any aspects of your life up to this point. That's okay. In 3 years time your life can be entirely different and nearly unrecognizable. You could be thirty and in a happy relationship with a good job doing what you want. The only difference between that version of you and today is the little bit of work you put in every single day between now and then.\n\nAnd if I had to recommend a self-taught job to go from 0 to 100k salary - there are thousands of jobs for front-end JS developers on the market right now - and hundreds of free resources to learn how to be a front end developer. If I was in your position, I would start there.",
        "percentile_10_comment": "It's hard to do something you like when you don't even know what you like 😔",
        "comment_gpt4o": "Hey there, first off, I'm really sorry to hear you're feeling this way. It sounds incredibly tough, but I want to remind you that you're not alone in this. Many people have felt stuck and found a way forward, and you can too. \n\nLet's start small. It might help to focus on building a routine that gives you a sense of control and accomplishment. Start with something simple, like setting a consistent wake-up time or dedicating 10 minutes a day to a new hobby or skill. It doesn't have to be perfect or big, just something that you can stick to and gradually build on.\n\nConsider exploring interests outside of your current job. There are tons of free resources online to learn new skills, whether it's coding, graphic design, or even something like cooking. This could open up new opportunities and help you discover what you enjoy.\n\nAlso, reaching out to a mental health professional can be a game-changer. They can provide support and strategies tailored to your situation. It's great that you're already on medication, but therapy can offer additional tools to help manage those tough thoughts.\n\nRemember, progress is progress, no matter how small. Celebrate the little wins and be kind to yourself along the way. You've taken a big step by reaching out here, and that's something to be proud of. Keep going, and take it one day at a time. You've got this.",
        "comment_gpt5_verbositylow_efforthigh": "26 isn’t late. You’re not a failure; you’re stuck. Here’s a simple plan to get traction even when your mood is trash.\n\nFirst priority is safety. If you’re at risk of hurting yourself, call/text 988 (US) or use findahelpline.com for your country, or go to the nearest ER. Also tell your prescriber about the intrusive thoughts—meds/therapy plans can be adjusted.\n\nBuild a “minimum viable day” to stabilize: consistent wake/sleep, 10–20 min walk outside, real meals with protein, one small chore. That’s it. When that’s steady, add a 60–90 min “skill block” at the same time daily. Phone in another room, timer on. If it feels impossible, commit to 5 minutes and see if momentum carries you.\n\nCareer-wise, you don’t need calculus to get into solid roles. With a journalism background, look at technical writing/UX writing, content operations, grant writing, customer support → IT/help desk, SDR/sales, project coordination, or QA. Pick one lane. Do one beginner-friendly course/cert and make 2–3 tiny portfolio pieces that match job postings. Examples: Google IT Support or CompTIA A+ (help desk), HubSpot Content Marketing + Google Analytics (content), an intro software testing course (QA), a sample grant or product docs (writing).\n\nJob search discipline beats intensity. Every weekday: one tailored application, one short outreach (a 10–15 min chat request), and your 60–90 min skill/portfolio block. Track everything in a simple sheet. Aim for 20–30 quality applications in a month, not 200 sprays.\n\nDebt: if federal loans, enroll in SAVE (income-driven repayment) and set autopay. Consider a temporary shift/side gig to build a 1–2 month cushion; less panic = more discipline.\n\nIf you want to reopen STEM doors later, do 10 minutes of Khan Academy arithmetic/pre‑algebra after your walk. No pressure—just reps.\n\nIf the dark thoughts spike, pause the plan and get help immediately: 988 (US), your local emergency number, or someone you trust. You don’t need to “earn” help by fixing everything first.\n\nTomorrow’s start: wake at the same time, 10‑minute walk, protein breakfast, 60 minutes skill block, one tailored application + one outreach, one chore, lights out at the same time. Do that for 7 days, then iterate. Small, boring wins stacked daily will move you out of this. You’ve got time."
      }
    },
    {
      "id": "t3_t0mi6z",
      "title": "[Need Advice] How are you supposed to do EVERYTHING?!",
      "body": "How are you supposed to study, and work, and spend time with your family, and learn a musical instruments, and clean the house, and cook, and read books, and watch movies, and buy groceries, and workout, and ....\n\nthis is not a complain or anything. I'm generally interested in how is it possible to live like this...\nlike I really want to study, and I do want to work, and also I want to learn piano, and so on...\nbut it just doesn't seem possible. either there's not enough time, or I forget, or I'm to tired from one task that I just wanna go to sleep or ...\n\nso how does someone go about living like this? how can you do everything? \n\n\nim 22, I've been trying to turn my life around for the past year. I have done many things I'm proud of since last year. I got way more productive than I ever was.\nBut here's the thing, whatever I do, it doesn't seem like I can manage to do everything I want to....",
      "comments": {
        "best_comment": "Random Advice:  get a Slow cooker and a rice cooker. You can go out to work or stuff come back and food is ready. \n\nI still have no idea how people do so many things. Work takes the majority of my time but I still want to go back to school and do many other things too!",
        "percentile_10_comment": "This is the way, particularly with new habits.\n\nWrite a list of things you would like to do/ do more of, prioritise it, then start adding things into your schedule slowly.\n\n15 mins every day doing one new thing. Once you have done that for a couple of weeks you can think about adding the next thing.\n\nThat said, don’t stress over not doing all things you want to all at the same time - there are going to be times that you don’t have time to practice piano, or cook, or whatever and that’s fine.\n\nI go through phases of being at the gym 5 days a week, and phases when work gets in the way and it is only once a week, and that’s fine because I can get back on it the following week. \n\nBe persistent at trying to be consistent. You haven’t failed until you stop trying.",
        "comment_gpt4o": "Hey there! It sounds like you're juggling a lot, and it's great that you're motivated to do so many things. The key here is to prioritize and manage your time effectively. Start by identifying your top priorities—what's most important to you right now? Focus on those and be okay with not doing everything at once. It's also helpful to create a schedule or routine that includes time for rest and relaxation. Remember, it's not about doing everything perfectly, but about making consistent progress. You might also want to try habit stacking, where you pair a new habit with an existing one, to make it easier to incorporate into your day. Lastly, don't forget to celebrate your achievements, no matter how small. You're already doing great by being more productive than before, so keep building on that!",
        "comment_gpt5_verbositylow_efforthigh": "You don’t. No one does everything every day. People pick a few priorities, put the rest on rotation/maintenance, and make peace with trade‑offs.\n\nPick your top 3 for the next 8–12 weeks (e.g., work, study, health). Give everything else a minimum effective dose so it doesn’t die: piano 10–15 min three days a week, a 15‑min nightly tidy, one weekly shop + 2–3 meal preps, movies on the weekend, one standing family block.\n\nBuild a weekly template instead of trying to cram it all daily. Example: Mon/Wed/Fri gym + two 25‑min study blocks; Tue/Thu piano + one 50‑min study block; Sat morning groceries/clean/meal prep; Sun dinner with family; every night a 15‑min reset and plan tomorrow. That’s plenty.\n\nTimebox it on a calendar with alarms. Do deep work when you’re freshest, chores when you’re tired. Protect 7–8 hours of sleep. Keep one capture tool for tasks and do a short weekly review so you stop forgetting.\n\nAutomate and cap: recurring grocery list or delivery, lay out clothes, prep snacks, limit scrolling/TV to a set window. If you miss a block, skip the guilt and hit the next one.\n\nYou won’t do everything every day, but across a week or month you’ll touch it all. Consistent “good enough” beats trying to juggle everything daily and burning out."
      }
    },
    {
      "id": "t3_w1n869",
      "title": "[Need advice] was doing great and now I'm depressed",
      "body": "\n\nWas doing pretty well, started going to the gym and studied a bit.But then my hair started falling out in huge amounts :( , I'm losing so much hair and everyone pointing out that my hair is everywhere is getting me even more anxious and depressed.How to push through unforseen circumstances which drag you into slumps like this.",
      "comments": {
        "best_comment": "It wasn't your fault. Don't blame yourself for things that are out of your control.",
        "percentile_10_comment": "When you get stressed, don’t look at the whole staircase; just look at the next step. Soon enough you’ll feel better. Then another challenge will come. And another. You get better at dealing with it after you go through it enough times. Good luck!",
        "comment_gpt4o": "I'm really sorry to hear you're going through this. It sounds tough, but it's great that you're reaching out for advice. When unexpected challenges like this come up, it's important to focus on what you can control. First, consider seeing a doctor or dermatologist about your hair loss to get some professional advice. It might help ease your anxiety to know what's going on and what you can do about it. In terms of discipline, try to maintain the habits you were building, even if it's at a reduced level. Going to the gym and studying, even in smaller amounts, can help maintain a sense of normalcy and control. Also, remember to be kind to yourself. It's okay to have setbacks, and taking care of your mental health is just as important as physical health. Keep pushing forward, and don't hesitate to seek support from friends, family, or professionals if you need it. You've got this!",
        "comment_gpt5_verbositylow_efforthigh": "That’s a brutal curveball. When life hits like this, don’t aim for PRs—switch to maintenance mode so your habits survive until the storm passes.\n\nMake a simple “slump protocol” you can run on autopilot. For the next 14 days, do non‑zero basics every day: 10 minutes of movement (walk, bodyweight circuit, or a light gym session), 10 minutes of focused study, and 5 minutes of quick cleanup. Pick a fixed time, set a timer, and don’t negotiate with it. Use if‑then rules: if I feel overwhelmed, I still do 2 minutes; if I miss a day, I don’t miss two. Track it on paper to get visible wins.\n\nReduce the hair‑related friction so it stops hijacking your focus. At the gym, wear a cap/hood/buff and lay a small towel on benches. At home, brush or rinse hair before leaving, keep a lint roller by the couch, and run a 5‑minute vacuum sweep in high‑traffic spots. When people comment, have a one‑liner ready: “I’m dealing with some shedding and handling it—let’s not make it a thing.” Then change the subject.\n\nAlso handle the root issue. Book an appointment with a dermatologist or GP to check common causes and options. Having it on your calendar gives your brain a plan, which makes it easier to keep showing up.\n\nYour goal right now isn’t to crush it—it’s to keep the identity and the routine alive. Stack small, boring wins, keep the chain going, and let the bigger effort come back when the anxiety calms down. Two weeks of maintenance will feel a lot better than two weeks of quitting. You’ve already shown you can start; this is how you keep it."
      }
    },
    {
      "id": "t3_yk8w5j",
      "title": "[need advice] I (30f) feel lost and don’t even know where to start changing my life",
      "body": "I really don’t have any self worth or self esteem. A lot stems from me being a failure in life. I’m in my early 30s and only have a bachelors in art history. I have worked as an admin coordinator and don’t make much money. I definitely need a better job but don’t have skills or an education to get one. Other than that I don’t have any friends except for my boyfriend. Lately I signed up for a dance class so I hope I can make a friend there (I’m really shy and have a hard time reaching out). I need to rehaul my life because I’m not the person I want to be, but I just don’t know where to start.",
      "comments": {
        "best_comment": "It sounds like you're putting a lot of pressure and self worth into what would be better described as a logic problem.   \n\nIf what you're doing isn't making you happy, then what might you do differently?  I know we're all creatures of habit, and it's hard to break a rut, especially if you need big changes, but stable homes get built brick by brick, and stable lives are built day by day.   \n\nTry to find the least disagreeable change in the right direction you can tolerate and make it.   As yourself what your daily life would be if you were satisfied, and seek to mirror those actions until they become habit.",
        "percentile_10_comment": "I hear ya, Life can be hard. I recently felt quite the same so i can relate to you. I'm gonna give you what I did to myself and maybe you can take parts of it and apply to yourself. Basically breaking it down it went:\n\n1. Assess my current situation\n2. Map out where I want to be in 1 year from now on, and what is my ideal self\n3. Create SMART goals \n4. Do a daily review of the day\n\n**Assess the situation**.  \nThis is where you want to assess what it is that your currently doing in your life to know which parts to reduce and what to start improving.  \nI started by drawing out a big Chart, where i marked  \nInfrequent on the left side of the chart, and frequent on the right side  \nThen i marked little on the bottom side of the chart, and Alot on the top side.  \nAfter that i started to plot in my daily habbits. What do i actually do often that has a big impact on my life, good or bad. For instance I spent alot of time working overtime, eating unhealthy and watching youtube, where as i spent alot less time reading books, going to the gym and working on sideprojecs.\n\nThis gave me a good overview of my current situation and let me know which of my daily habits that we're the biggest issues in my life.\n\n**Map out your ideal self**  \nI basically made a mindmap consisting of me in the middle with parts, Family & Social, Career, Health, Economy. Here I basically maped out in an ideal world, what would I do, what would I look like, what would my relationships with others be like. I did it for my ideal self and also another version for 1 year from now on. This gave me quite a boost of motivation to actually know where I ideally would want to take things. No actions planed, just a vision of what I want my life to be like.\n\n&#x200B;\n\n**SMART Goals**  \nWay to many times I've created goals and never followed up. SMART goals enable me to make my goals more tangible by making sure my goals are very specific, that they're measurable(how else can i expect to know if i've achived them), Achiveable - I can't expect to be a worldclass athlete in 1 year, but I can start going to the gym 15 times a month.  \nRelevant, I don't want to set a goal of losing x amount of pounds, but rather focusing on living a long life for my family. Timebound, this is to give myself a deadline of when this needs to be achived, which makes you accountable.   \n\n\n**Daily Review**  \nThe hardest part of making sure this new routine sticks is def in the begining I just made a simple spreadsheet where i put in my goals, and date, and when i Achive them i mark the day as green, and when i fail i mark it as red. It feels awesome to mark a day as green, and it also gives myself a remainder each day of the goals that I've set up for myself.  \n\n\nSo these are the 4 steps that I took to get back on track and start rehauling my life. Feel free to reach out if you wanna chat some more about it.",
        "comment_gpt4o": "Hey there! First off, it's great that you're taking a dance class—that's a fantastic step towards meeting new people and building confidence. Remember, everyone starts somewhere, and it's okay to feel a bit lost. Here are a few ideas to help you get started on your journey:\n\n1. **Set Small, Achievable Goals**: Start with small, manageable goals that can help build your confidence. It could be something like reading a book related to a skill you want to develop or setting aside 10 minutes a day to practice a new hobby.\n\n2. **Skill Development**: Consider online courses or workshops that can help you gain new skills. Websites like Coursera or Udemy offer affordable courses in various fields. This could open up new job opportunities and help you feel more accomplished.\n\n3. **Networking**: Since you're shy, try online communities related to your interests. They can be a less intimidating way to connect with others and might even lead to friendships or job opportunities.\n\n4. **Routine and Self-Care**: Establish a daily routine that includes time for self-care. This could be exercise, meditation, or simply a moment to relax. Taking care of yourself can improve your self-esteem over time.\n\n5. **Celebrate Small Wins**: Acknowledge and celebrate your progress, no matter how small. This can help build your self-worth and motivate you to keep going.\n\nRemember, change takes time, and it's okay to take things one step at a time. You're already on the right path by reaching out and seeking advice. Keep pushing forward, and you'll find your way. 😊",
        "comment_gpt5_verbositylow_efforthigh": "Skip the life overhaul. Build a simple 12‑week system and let the reps change how you feel.\n\nMake three anchors you can keep even on low‑energy days: same wake time every day, a 25‑minute “career block” on weekdays, and one deliberate social rep each week. If you miss, do a 5‑minute version and don’t miss twice.\n\nUse the career block to move from admin to higher‑paying coordinator roles that value what you already do: project coordinator, operations coordinator, HR/recruiting coordinator, or marketing ops. Pick one path and focus. Rotate learning and building. Learn Excel basics that actually get used (sorting, filters, conditional formatting, VLOOKUP/XLOOKUP, pivot tables) and one project tool like Asana, Trello, or Jira. Build small artifacts: a sample project plan, a simple SOP for a process, and an Excel dashboard on a dataset you care about. Free/cheap options: Google Project Management certificate on Coursera, and YouTube channels like Leila Gharani for Excel.\n\nBy week two, start the job pipeline. Update your resume to be achievement‑based and quantified: “Supported a team of 12; coordinated 3 calendars; created a shared inbox SOP that cut response time from 3 days to 1; tracked 120+ requests/month; maintained reports in Excel using pivot tables.” Each week, send five targeted applications and two short informational messages to people in your chosen role. Track it in a simple spreadsheet. Every Friday, review what got done and set next week’s targets.\n\nFor social, your dance class is perfect. Show up ten minutes early and ask one person a tiny question about class or shoes, then volunteer one sentence about yourself. After class, suggest a low‑effort next step like, “I’m grabbing tea down the street—want to join?” or “I’m practicing on Saturday at the park if you want to run the combo.” Do that once a week; familiarity plus repetition does the heavy lifting. If you can, add one more recurring group activity so you see the same faces.\n\nKeep basic energy habits so discipline feels doable: 7–8 hours of sleep with a fixed bedtime, a 20‑minute walk most days, and a simple meal template you repeat. Put your phone to charge outside the bedroom and lay out clothes the night before to lower friction in the morning.\n\nTrack your reps with a calendar or habit app and keep a short “done list” each day. That turns vague self‑judgment into concrete progress and builds evidence that you follow through.\n\nGive this 12 weeks. You’ll exit with a couple new contacts, a handful of portfolio pieces, a sharper resume, and a steady application rhythm. That’s the foundation for the better job, more friends, and a you that feels built, not imagined. You’ve already started by signing up for dance—keep stacking small, boring wins."
      }
    },
    {
      "id": "t3_q0nupo",
      "title": "[Need advice] I'm only living life for the next weekend",
      "body": "I work a corporate 9 - 5 job, but because of covid and WFH, it's been more of a 9 - 9 kinda deal. I'll not get too much into it but I'm miserable during the weekdays. I'm also in a new job so I'm constantly worried about underperforming while actually underperforming which further adds to the worrying. Here's what my week looks like - \n\nMonday to Thursday is a struggle to get through. I sleep 8-9 hours, struggle to wake up the next day and count the hours before it's time to sleep again. I wake up happy on Friday, work for 3-4 hours, and then just fuck around for the rest of the day. This part of the weekend is my personal favorite. I'm not too excited because it is still technically a work day but I'm also not drowned out by the fast approaching Monday. Saturday is hype but it's way, way too short and the 18-20 hours I'm awake usually feel like 3-4 hours of productive fun. Sunday first half is mostly recovering from the previous day, and the second half can be best described as pure irrational mental agony. Rinse and repeat. \n\nI want to stop glorifying the weekends and want to live a more balanced life where I look forward to each day and where I am not trying to maximize entertainment over the weekend. \n\nMy current way of living has also gotten me into some weird mental health situations, for example I now depend on food to cope with feeling sad. I've been overweight all my life and this is greatly accelerating the problem. Also, I stay in bed for 9-10 hours because my mind refuses to get out of bed after 8 hours.\n\nHow do I accept that this is what life is going to be for the next 35-40 years and respect each day equally regardless of how boring/fun it is going to be?",
      "comments": {
        "best_comment": "I personally don't think that discipline is what is going to fix your situation. Unless your long work hours are imposed by WFH hurting your mindset and making it easy to slack off, then maybe so. If that's the case, I recommend you look for things to do outside of work. WFH makes a lot of us feel really repressed, so maybe you would enjoy to start going for walks in the morning. That could be something to motivate you to get out of bed for example. Try to give your day some structure, like a kind of schedule. It doesn't have to hour-by-hour, just whatever works for you. You could start reorganizing yourself by simply adding one new habit at a time.\n\nI can't speak for your career because you know your situation, but if it is your job putting you through this, maybe looking for a new one is a good option. Even if the paycheck is less, decreased stress will improve your quality of life much more than the pay difference",
        "percentile_10_comment": "You need discipline, a hobby and work-life balance. The discipline will allow you to set personal targets at work and structure your days accordingly and finish at a reasonable time (8.30-5.30 works well for me with 30 mins for lunch and a few 10-15 min breaks throughout the day). Your hobby/hobbies allow you to have an actual life outside of work on the evenings (soccer, gym, DnD.. Whatever - just try and pick something that takes you out of the house since you WFH). The combination of a disciplined work day and a hobby or planned evening gives you work life balance (voila!).",
        "comment_gpt4o": "Hey there! It sounds like you're in a tough spot, but it's great that you're looking to make a change. Here are a few ideas that might help you find more balance and enjoyment in your weekdays:\n\n1. **Set Small Goals**: Start by setting small, achievable goals for each day. This could be something as simple as taking a 10-minute walk or reading a chapter of a book. These small wins can help break the monotony and give you something to look forward to.\n\n2. **Create a Routine**: Try to establish a morning routine that energizes you. It could be a quick workout, meditation, or a healthy breakfast. A consistent routine can make waking up easier and set a positive tone for the day.\n\n3. **Limit Work Hours**: If possible, set boundaries for your work hours. Communicate with your employer about your workload and see if there's a way to manage it better. It's important to have time for yourself outside of work.\n\n4. **Mindful Eating**: Since food is a coping mechanism for you, try to practice mindful eating. Pay attention to what you eat and how it makes you feel. This can help you develop a healthier relationship with food.\n\n5. **Plan Weekday Activities**: Schedule small activities during the week that you enjoy. It could be a hobby, a virtual hangout with friends, or a new recipe to try. Having something to look forward to can make weekdays more enjoyable.\n\n6. **Seek Support**: If you're feeling overwhelmed, consider talking to a therapist or counselor. They can provide strategies to manage stress and improve your mental health.\n\nRemember, change takes time, so be patient with yourself. You're taking a positive step by seeking advice, and that's a great start!",
        "comment_gpt5_verbositylow_efforthigh": "You don’t need to accept “weekend-or-bust” for the next 40 years. Fix the system around your days first, then your motivation will follow.\n\nSet a hard stop time on work and defend it. Put a calendar block at, say, 6:30, wrap up with a 10-minute shutdown (write tomorrow’s top 3, clear inbox, close the laptop, say “done for today”), then do a 10-minute “fake commute” walk. If your team expects 9–9 by default, ask your manager for clear weekly priorities and what “good” looks like in 90 days so you’re not overextending out of fear.\n\nReduce underperformance anxiety with a simple work spine: pick three MITs by 9:30, do 60–90 minutes of focused work first thing with notifications off, and end the day with a quick “wins + plan” note to yourself (or your manager). Use 25-minute sprints if your brain resists starting.\n\nGet out of bed with a tiny activation routine. Same wake time daily, phone outside the bedroom, feet-on-floor within five seconds, water + bright light + a 10-minute walk or mobility. You’ll stop lingering in bed and feel human sooner.\n\nMake weekdays worth living by scheduling one small joy after work every day. A 30–60 minute hobby, workout, walk with a podcast, cooking a new recipe, learning a skill—on the calendar right after your shutdown. Keep weekend wake time within an hour of weekdays so Saturday doesn’t evaporate and Sunday dread shrinks.\n\nTurn food from coping into a plan. Eat at set times, aim for protein + produce each meal, and keep trigger snacks out of reach or pre-portioned. Use an if-then: if I want to stress-eat, I make tea and take a 10-minute walk; if still hungry, I eat the planned snack. For two weeks, write down what you’ll eat before you eat it—awareness alone helps a lot.\n\nDefang the Sunday scaries with a Sunday reset and a Monday cushion. Late Sunday morning: groceries, laundry, tidy, plan Monday’s top three. Then put something pleasant on Monday after work so Monday isn’t only pain.\n\nRun this as a 14-day experiment: one hard stop + shutdown, one deep-work block, one 10–30 minute movement session, one planned joy, and planned meals. Track with a simple daily checklist and aim for 70–80% completion, not perfection. Review after two weeks and adjust.\n\nIf the job truly requires 12-hour days long-term, start quietly planning a change. But get these baselines in place first. You don’t have to love every weekday—just control a few levers. Small, repeatable wins will make your weeks feel like a life you own, not a countdown to Friday."
      }
    },
    {
      "id": "t3_v8z22p",
      "title": "[Need Advice] How do you stop depression from stopping you?",
      "body": "Hi guys,\nI’m 21F who has struggled with severe social anxiety disorder for as long as I can remember. It’s bad because i’ve let it go on for too long. Luckily, I recently enrolled in a serious program. I’ve been able to stick with it, everyday, for a month now. It was cognitive strategies at first, and now it’s getting into behavioral things. Going out and socializing. Exposure to my fear. And I can’t help but be upset at myself because I can feel myself slipping into depression atm, which is a symptom of my SA, because I feel like I can’t do this.\n\nBut I want it so bad. Tonight I was sitting in bed after scrolling on my phone for hours and I’ve decided I’ve had enough. I need things to change. I have a list of 4 things I want to do everyday (therapy program, meditation, work out, and doing one social thing as simple as going into a store). The thing is I don’t wanna slip. Because for me, slipping even once is a huge fall back into my depression and isolation.\n\nFor any of you who have successfully achieved your goals and stuck to a schedule, how did you do it? Are there apps that can help, communities that hold you strongly accountable, a method or something you discovered that finally made you not quit? Especially those of you who have a mental illness, how did you stop it from getting in your way? Any help or advice is appreciated. I wanna start tomorrow.\n\nEdit: Thank you all for the amazing advice. I feel very motivated and supported. :)",
      "comments": {
        "best_comment": "Having a structure like your program is a huge help. It gives you something to grasp onto and you slide into and out of depression. \n\nOne thing I will say is that it’s a journey. It’s going to take awhile. You are going to take some steps forward and some steps back. It’s completely normal so try to not beat yourself up about it. It’s going to happen, it’s going to be ok, and it does get better. \n\nFor myself, what has made the most difference is to not a ridged, self-enforced schedule. I can’t ever do it well enough for that to fix anything. The self-anger from messing up just Leads to more depression. What I can do is try to break away from my daily life as much as possible. I see new things, even if I am alone. I go to a local bar a few times a week. It was awkward at first but someone will take you under their wing at some point and give you the comfort to get to know others there.",
        "percentile_10_comment": "Every time I get into a rut, I realize my sleep has been poor. \n\nI’m not naive and condescending enough to suggest sleep is the only thing that’s making you feel bad. But it’s a good place to start when trying to get on track. \n\nProtect your sleep. Do that by:\n\n- Going to bed at the same time every night. \n- Waking up at the same time every day. (For the most part.)\n- Getting up when your alarm goes off. (I have one old-school alarm in my bedroom and my phone alarm set for one minute later out in the kitchen. Also, my bedroom alarm is an ascending beep, meaning it starts at low volume and gradually increases.)\n- Protecting yourself from screens for an hour before you go to bed. (This is an important one. Even with apps that protect you from blue light, the screen is still too much stimulation before bed. Give yourself an hour, even if you’re not really doing anything in that hour.)\n\nAlso, allow yourself to break one of these rules on occasion. Be disciplined, but don’t be rigid. That will help break you of the all-or-nothing mindset that causes you to feel you’ve lost all progress when you screw up once. \n\nProtecting your sleep is easy and makes you feel better, period.",
        "comment_gpt4o": "Hey there! First off, kudos to you for taking such proactive steps with your program and recognizing the need for change. That's a huge first step. When it comes to sticking with your goals, especially when dealing with mental health challenges, consistency and small wins are key. \n\nStart by breaking down your list into even smaller, manageable tasks. For example, if going to a store feels overwhelming, maybe start with just stepping outside for a few minutes. Celebrate these small victories because they build momentum. \n\nApps like Habitica or Streaks can be great for tracking habits and keeping you motivated. They turn habit-building into a game, which can make it more engaging. Also, consider joining online communities or forums where you can share your progress and get support from others who understand what you're going through. \n\nRemember, it's okay to have off days. The important thing is to not let a slip turn into a fall. Be kind to yourself and focus on getting back on track the next day. You've got this!",
        "comment_gpt5_verbositylow_efforthigh": "Nice work sticking with the program for a month. The key now is designing your system so low days still count. Set a floor and a ceiling for each of your four habits. Floors should be tiny: program = one prompt or five minutes; meditation = 60 seconds; workout = one set or a five‑minute walk; social = step into a store and ask one simple question like “Where’s the almond milk?” On rough days, the floor is a full win; on good days, do more.\n\nAttach each habit to a cue and an if‑then. After breakfast, open the program for five minutes; when you close it, immediately do your 60‑second meditation; later, change clothes and do at least your workout floor; right after the workout, do the store micro‑exposure. If you catch yourself doomscrolling, put the phone in another room and start a two‑minute timer on the next floor. Choose the store and script the line the night before to remove friction.\n\nTools that help: a simple habit tracker to keep the chain visible (Loop on Android, Done/Streaks on iOS, Habitica if you like gamified). Focusmate for showing up to the program session. Block distracting apps during your habit window with Freedom/Opal or built‑in Focus modes. For accountability, post daily check‑ins here, join r/socialanxiety for exposure ideas, or find a buddy via Focusmate/Discord. Beeminder or StickK can add small money stakes if that motivates you.\n\nIf you miss, restart at the next cue the same day—never miss twice. Your job is to show up; intensity is bonus. Tonight, write your floors on a sticky note, lay out clothes, set your app blocks, and pick tomorrow’s store and exact line. Start tiny, keep the chain alive, and let the practice grow."
      }
    },
    {
      "id": "t3_soop8x",
      "title": "[Need Advice] how to find your pasisons",
      "body": "I need some help here. Currently 27.\n\nThings I've tried:\n1. Programming\n2. Designing (did that for most of my extracurricular. Don't see myself doing it for a career) \n3. Song writing & audio engineering (I wrote songs as a kid and teen. I'm pretty OK with the analog board) \n4. Psychology (degree level) \n5. Economics (microeconomics) \n6. Physical sciences (pre-u level. This is the last time I truly felt interested in something, maybe pursue this one further?)\n\n\n[Edited] Things I know about myself:\n\nArea of interest: ???\nValues to keep: honesty. \nScope: ideally can connect to a lot of people.  \nSkills: problem solving, creating too why not. \nYears of commitment: ideally LONG Term \n\nRN I identify 'disinterest' as a dry hole in my chest, or a heavy feeling of 'why am I here'. I need a sense of purpose I guess? \n\nHobbies: I've been watching videos on history, conspiracy shit, self help, and some kpop stuff. \n\nJobs I've already tried: \n1. sales (making money for a just a company is not fulfilling. Scope of influence is a little small for me.)\n2. market research (large scope! I like learning about consumer and economic insights, but got pretty tired after 2 years. I'm analysing - always a plus, but not implementing solutions)\n3. customer service (absolutely no. Pretty dry for me.)\n\nCurrent job: online business (ahhhhh..... I don't like to lie to customers, so I really research the products I bring in if its health related)\n\nPotential pursuits: self-help vids, or post daily routine on yt. I'm just sitting on this idea for now. When I'm ready then I'll do it. And hopefully make more $$$$$",
      "comments": {
        "best_comment": "I’d recommend reading a book called So Good They Can’t Ignore You by Cal Newport. He makes the claim that this idea of finding your passion is mostly nonsense. Instead, real passion is forged through years of effort and dedication. (He gives a more nuanced take in the book though)",
        "percentile_10_comment": "GYM GYM GYM GYM",
        "comment_gpt4o": "Finding your passion can be a journey, and it’s great that you’re exploring different areas. Since you mentioned a past interest in physical sciences, maybe revisiting that could reignite some excitement. You could start by taking an online course or joining a local science club to see if it still sparks your interest. Also, your skills in problem-solving and creating could be a great fit for fields like data analysis or product development, where you can see the impact of your work. As for your idea about self-help videos or daily routines on YouTube, it sounds promising! It could be a way to connect with people and share your journey, which aligns with your values. Just start small, maybe with a few videos, and see how it feels. Remember, finding your passion is often about trying new things and being open to where they might lead. Good luck!",
        "comment_gpt5_verbositylow_efforthigh": "You don’t “find” passion first; you build it by doing useful reps and paying attention to what energizes you. Set up a 12‑week small‑bets sprint. Pick two themes that fit your values and background, then test them in public. For you I’d try: evidence‑based consumer health (honest reviews, myth‑busting, decision guides), and science/econ explainers for everyday choices. Those hit honesty, impact, problem‑solving, and your audio/content skills.\n\nTime‑box 60–90 minutes a day, five days a week. Each week, ship one tiny thing: a 3–5 minute video, a short article, or a simple visual. Create before you consume. Keep a quick log after each session, rating Energy, Meaning, and Progress 1–5. At week 4, cut the lower‑scoring theme; at week 12, commit six months to the winner.\n\nIf you want YouTube, do a 30‑video challenge: thirty 3‑minute vids in 30 days, each answering one specific question with sources. Repurpose to Shorts/TikTok, and don’t worry about polish—your audio background already gives you an edge. Your differentiator is honesty plus citations.\n\nTo move from analysis to implementation, bake in small experiments: include a call‑to‑action, gather feedback, iterate. After the sprint, deepen the path for six months: one course to upskill, one collaboration a month, one portfolio piece a week, and one concrete ask (freelance, PM/user‑research application, or monetization test).\n\nUse the “dry hole” feeling as data: if a track stays low on Energy/Meaning for three straight weeks, drop it without guilt. Hit 100 hours and 12 shipped pieces—you’ll have enough signal to choose, and the discipline to stick with it."
      }
    },
    {
      "id": "t3_136fhqy",
      "title": "I'm weak mentally and physically [Need Advice]",
      "body": "Hey everyone, I'm a 24 year old male, and I really need some wisdom words because I think I'm at the bottom of my life. Last February, I had a breakup. It was a 1-year relationship, and she was my first true love ever. I really wanted us to work so badly, but it didn't happen. It was a \"healthy\" breakup, but I just couldn't accept it. She wanted us to stay \"friends,\" but I said no. Even if it hurt me so fucking bad. The thing is that I felt safe during her. I showed too much emotion. I was vounrable all the time thinking it was ok to show her my real feelings.I know it was my fault. I just don't want to be that person anymore. I don't want to be famous and get easily affected by my emotions. I want to know how to control my mind and my emotions so people can rely on me in the future. And I have absolutely no idea where to start because I feel lost every time.I don't really know if it's the right sub to post in, but I like how the guys think here.\nthanks,\n ",
      "comments": {
        "best_comment": "If you tell yourself you're weak, you're gonna be weak. Give yourself a break mate, no one else is going to.\n\nThe word you're looking for is stoic. And try meditation and mindfulness for though control.\n\nYou can be yourself, you're just fine. Just need to be around people who appreciate who you are. \n\nDon't change for others, just be yourself.\n\nAre you in the UK by any chance?\n\nPaul",
        "percentile_10_comment": "Not sure what you mean by weak? Telling your partner where you're at emotionally isn't weak, that's just being in a relationship. Unless it's to the point where you're using your partner as a trauma dumpster when you really need to be in therapy, medicated, and in the gym to help manage your emotional help then you aren't weak. You're just human.",
        "comment_gpt4o": "Hey there! First off, it's great that you're reaching out and looking to make positive changes. Breakups can be really tough, and it's normal to feel lost afterward. The good news is that you can definitely work on building mental and physical strength, and it all starts with small, consistent steps.\n\nFor mental discipline, try starting with mindfulness or meditation. Even just 5-10 minutes a day can help you become more aware of your emotions and learn to manage them better. Journaling is another great tool; it can help you process your thoughts and track your progress over time.\n\nPhysically, consider setting a simple fitness goal. It could be as basic as a daily walk or a short workout routine. Exercise is a powerful way to boost your mood and build resilience.\n\nRemember, it's okay to show emotions and be vulnerable. It's part of being human. The key is learning how to balance them and not let them control you. Be patient with yourself, and celebrate small victories along the way. You've got this!",
        "comment_gpt5_verbositylow_efforthigh": "Breakups suck, and choosing not to be “friends” was the right call if you want to heal. You don’t have to become emotionless; you just need reps at controlling your actions when emotions spike.\n\nFor the next 30 days, run a boring-basics reset. Same wake time every day. Get sunlight and a 10–20 minute walk first thing. Do 10 minutes of breathing or meditation (box breathing or a guided app). Write a 3-line plan for the day: the top 3 tasks you’ll actually finish.\n\nTrain your body because it’s the fastest way to build mental stability. Lift three days a week (full-body: squat/hinge, push, pull, core; programs like StrongLifts 5x5 or any beginner full-body plan work). On the other days, do 30 minutes of easy cardio or a long walk. Track weights and reps; add a little each week. Eat real meals with a solid protein source, drink water, and cut alcohol for the month. Aim for 7–8 hours of sleep and put screens away an hour before bed.\n\nUse a simple emotion-control protocol. When a wave hits or you want to text her, STOP: stop, take 10 slow breaths, observe what’s happening, proceed with your plan. Add a 15-minute rule for urges—set a timer and do a pre-chosen action (walk, shower, journal, call a friend). Most urges pass if you don’t feed them.\n\nProtect your environment. Go no contact for now, mute/unfollow, delete reminders. Keep your phone in another room while working, use app blockers, and turn on Do Not Disturb at night. Make your default behavior the disciplined one.\n\nDo a 10-minute weekly review: what worked, what slipped, one tweak for the next week. If you miss, don’t spiral—never miss twice. Optional but helpful: Atomic Habits for systems, The Daily Stoic for mindset, or a few CBT/DBT sessions to sharpen skills fast.\n\nYou want to be someone others rely on? Start by keeping small promises to yourself every day. Stack those wins for 30 days and the “mentally and physically weak” story will start to fade. You’ve got time, and this is a solid place to begin."
      }
    },
    {
      "id": "t3_14eo6ut",
      "title": "[need advice] my shameful secret: I never went to high school.",
      "body": "Bullet points so you don’t have to read the whole thing:\n\n-I was homeschooled and my parents didn’t hold me accountable with my schoolwork \n\n-I think I made it to 6th or 7th grade until I stopped school completely\n\n-I want to go to college spring 2024, but I don’t know where to start\n————\n\nI’m not sure if I’m even in the right subreddit for this but I’m kind of desperate and genuinely just truly embarrassed at this point. I’m 24 y/o and never went through high school.\n\nI grew up in a Christian homeschooled household and to make a very long story short, since middle school my parents never kept me accountable with my school work. I believe I had some learning disabilities that made it hard for me to do my schoolwork which led me putting it off. That coupled with my parents never checking up on how I was doing/if I was completing my schoolwork, my education just slipped through the cracks. I started working and moved out when I was 17. And that’s how it’s been till now. I honestly don’t remember what grade I got to in school before I dropped out, I’m assuming 6th or 7th. \n\nNow that I’m nearing my mid twenties I’m realizing I’d like to go to college in spring of 2024 but I have no idea where to even start. I was hoping I could get some advice on first steps. \n\nI know I need to get GED but where do I go for that? Is there a program for people like me? Am I too far gone? Please help.",
      "comments": {
        "best_comment": "Hit up your local community college and tell an entrance counselor you need to take some assessment tests due to non-traditional schooling.  I guarantee you they’ve heard this story before and they will help you figure out what remedial courses are necessary.  Also ask how to get assessed for learning disabilities so you can get accommodations as necessary.",
        "percentile_10_comment": "Yo homie I also didn't get past 7th grade, I got my GED at 30, then started college 2 years after that. I'm an engineer now. It's possible for you as well, learn about passing the GED as an exam instead of trying to learn what's on it (the big books the give you are intimidating), being in college is rewarding as you are around people motivated to learn. Community college will be a better resource at first until you are ready to transfer to a university.",
        "comment_gpt4o": "Hey there! First off, it's great that you're taking this step towards your education—it's never too late to start. Getting your GED is a solid first move. You can find GED prep classes at local community colleges or adult education centers, and there are plenty of online resources too. Websites like GED.com can guide you to official practice tests and study materials. Once you feel ready, you can schedule your test through the same site. \n\nAs for college, many community colleges have programs specifically designed for adult learners and those returning to education. They often offer support services to help you transition smoothly. It might be worth reaching out to a few to see what they offer. \n\nBuilding discipline will be key, so try setting small, manageable goals for your study routine. Consistency is more important than intensity at first. Remember, you're not alone in this journey, and there are resources and people ready to help you succeed. Good luck!",
        "comment_gpt5_verbositylow_efforthigh": "You’re not too far gone. Plenty of adults earn a GED and do great in college. Here’s a clean path and a simple discipline plan.\n\nStart at GED.com. Make an account, choose your state, and you’ll see whether your state uses GED or HiSET, approved test centers or online proctoring, costs, and local prep classes. If it’s HiSET, go to hiset.ets.org. Call your nearest community college and ask for “adult education/GED prep.” Many programs are free and may even cover exam fees.\n\nTake the official practice tests to get a baseline (Math and Reasoning Through Language Arts first). Study with Khan Academy (Arithmetic/Pre‑Algebra), a GED prep book from your library, and the official practice questions. Prioritize fractions/decimals/percents/ratios, reading comprehension, and writing a simple 5‑paragraph essay; science/social studies are mostly reading.\n\nBuild a routine: 60–90 minutes, 5 days/week, same time/place, phone away, Pomodoro 25/5. Track it on a wall calendar. Don’t miss twice. Book your first subject exam 4–6 weeks out to create urgency. Do one subject at a time and take two full practice tests the week before.\n\nIf you suspect learning differences, ask GED/HiSET about accommodations and talk to the community college disability office about documentation. You can start studying now while that process runs.\n\nOnce you pass a subject, meet with community college admissions for placement testing, start dates, and degree options. When you’re close to finishing the GED, fill out FAFSA at studentaid.gov; a GED counts as a high school credential.\n\nFor accountability, use free adult‑ed classes, your library, r/GED, or text a friend “study done” daily. Keep it simple: set tomorrow’s study time, lay out materials tonight, sit down when the timer says, and reward each session with a small treat. First step: do 20 minutes of Khan Academy fractions today, then put the next session on your calendar."
      }
    },
    {
      "id": "t3_qiy0vv",
      "title": "[Need Advice] After a month of studying, I think I'm Burned Out. What can I do? I literally feel physically too weak to do anything and would just lie in my bed",
      "body": "Lectures are getting annoying as they are \"dry\" af (only writing out really long and exhausting proofs, or professors who simply cannot fascinate someone)\n\nAnd I start feeling like wanting to just lie in bed and to watch Netflix. If I sit at my desk, I feel so so tired and weak, even during lectures, I am having trouble even holding my pen and writing\n\n(don't worry, I'm not sick, I feel 100% fine)\n\nCoffee used to give me that kick in the a**, but it stopped working\n\nWhat should I do to charge batteries?",
      "comments": {
        "best_comment": "Make sure you eat well and drink enough water, also get enough sleep.",
        "percentile_10_comment": "I take one whole day off after a month of anatomy and physiology classes given by professors with deep accents, contemplating whether I should just quit or continue. It is okay to take a break. Sometimes we just need a rest. Maybe just acknowledging that we have a power to choose what we want with our life. So, all the best.",
        "comment_gpt4o": "It sounds like you're hitting a wall, which is totally normal when you're pushing yourself hard. First, try to incorporate some short breaks into your study sessions. The Pomodoro Technique (25 minutes of focused work followed by a 5-minute break) can help keep your energy up. Also, make sure you're getting enough sleep, eating well, and staying hydrated—these basics can make a huge difference in how you feel. If coffee isn't doing it for you anymore, maybe try switching to green tea or just taking a brisk walk to get your blood flowing. Lastly, mix up your study routine. If lectures are dry, try supplementing with videos or podcasts that cover the same material but in a more engaging way. Remember, it's okay to take a step back and recharge. Your health and well-being come first!",
        "comment_gpt5_verbositylow_efforthigh": "You’re probably under-recovered and caffeine-tolerant, not “broken.” Treat it like overtraining: do a 3–5 day deload. Sleep 8–9 hours at the same times, get 30–45 minutes of brisk walking and daylight daily, eat real meals with protein + carbs, hydrate, and taper caffeine to near-zero so tolerance resets. Do at most one short active study block per day in that window, then stop guilt-free.\n\nWhen you restart, switch from passive to active learning. Use lectures to mark questions and structure, not to absorb everything. After class, learn from resources that click (textbook, OCW/YouTube, classmates) and jump into problems immediately. Boil each proof into a 5–10 step outline and make cards for key lemmas; explain it to a “rubber duck.”\n\nWork in sprints: 25/5 or 50/10, with 3–4 high-quality hours total at first. Use a simple start ritual: set a timer, do 10 bodyweight squats, sit and write the first line. Change locations if you get drowsy, sit near the front, keep water on the desk. After the reset, cap caffeine at 1–2 cups before noon. Schedule Netflix as a reward after your blocks so it’s deliberate, not default.\n\nIf the heavy fatigue sticks around after two weeks of sleep, movement, food, and lower caffeine, get a quick checkup. Otherwise, this combo of recovery + active study usually brings energy back fast."
      }
    },
    {
      "id": "t3_s8sprf",
      "title": "[need advice] I’ve fallen into a deep trap with being lazy and I can’t get out of it.",
      "body": "\nI find myself procrastinating with everything. I feel guilt not doing the things I know I need too, but the issue is with the productivity level I’m at, I can skim by forever. I want to do more but every time I think about the all the things I want to get done, I get overwhelmed and do none of them. \n\nWhere do I start? How do you just build a different mindset? Is this the right subreddit for this post? \n\nSomeone help please!\nTy",
      "comments": {
        "best_comment": "I am right there with you fighting the same battle. The only things helping me move forward (slowly) are these 3 things:\n1. I deleted all social media beside Reddit. No Tik Tok, no Instagram, no Facebook- nothing that will allow me to mindlessly scroll. It has actually caused me to pick up a book and read. \n2. When I find myself unmotivated, lounging, slacking etc, I ask myself “What is something small I can do right now?”. This has helped feel some sense of accomplishment. No, I am not going to clean my entire house, but I can go unload the dishwasher real quick. No, I’m not going to finish prepping for a big work meeting all in 1 go, but I have at least get the background slides done. These small wins make me feel like I am doing something. \n3. This one might sound silly, but to curb my place from becoming a disorganized mess, when I have things out or finish making a meal etc, I actually say aloud “Don’t put it down- put it away.” This forces me to physically not let go of an object until it is back in its place. \n\nMaybe these will help you move forward. It’s a small start.\n\nAlso, the book Atomic Habits is slowly but surely changing my life and making even these tiny gains happen. I recommend running to get it. Before I started to read it, I wondered if maybe I was depressed. And truthfully, maybe I still am. But this book is helping me realize that it is not a lack of goals or motivation that is my problem, it is a lack of good systems in my life. Maybe the book and those 3 starters can help you begin building up your systems too. Sending good thoughts your way!",
        "percentile_10_comment": "I'm about to do the reverse, reddit got to go it's mindless scrolling for me, even the \"news\" is filled with mindless drama and banter. Pages and pages of tits and ass I'll don't know and will never know. Outlandish rage inducing video that suck you in to scroll hours of dumb comments. At least with facebook it's real friends and Instagram it's my buddy's posting things about there life I can relate too.",
        "comment_gpt4o": "Hey there! It sounds like you're in a bit of a rut, but the good news is that you're already taking the first step by reaching out for advice. Here's a simple approach to get started: \n\n1. **Start Small**: Pick one small task that you can complete today. It could be as simple as making your bed or organizing your desk. The key is to build momentum with small wins.\n\n2. **Set Clear Goals**: Break down your tasks into manageable chunks. Instead of thinking about everything you need to do, focus on one thing at a time. Use a planner or an app to keep track of your tasks and prioritize them.\n\n3. **Create a Routine**: Try to establish a daily routine that includes time for work, rest, and leisure. Consistency is crucial in building discipline.\n\n4. **Limit Distractions**: Identify what usually distracts you and find ways to minimize these interruptions. This might mean setting specific times to check your phone or social media.\n\n5. **Be Kind to Yourself**: It's normal to feel overwhelmed, but don't beat yourself up over it. Celebrate your small victories and understand that building discipline is a gradual process.\n\nThis subreddit is definitely a good place for your post, and you'll find a lot of people here who have been in your shoes. Keep pushing forward, and remember that progress, not perfection, is the goal. You've got this!",
        "comment_gpt5_verbositylow_efforthigh": "Yes, this is the right sub. You don’t need a new mindset first—you get one by doing small, repeatable reps.\n\nStart with a 7‑day “show up” streak. Pick one area that matters most. Set a tiny, non‑negotiable daily minimum (10 minutes), same time and place each day. Use a timer. Stop when it ends; continuing is optional. Track it on paper so you can see the streak.\n\nTo kill overwhelm, do a 5‑minute brain dump, then pick 1–3 Most Important Tasks for tomorrow. For the top one, write the first tiny next action you’ll do. If it still feels heavy, shrink it until you can start. Two‑minute rule: if it takes under two minutes, do it now.\n\nMake starting easy: prep the night before, put your phone in another room, use a site blocker, and have a simple start ritual (water, open doc, headphones, start timer).\n\nClose your day with a 5‑minute shutdown: capture loose tasks, pick tomorrow’s top 3, set your start time. Do a short weekly review to reset.\n\nAccountability helps: tell a friend or post updates, and give yourself a small reward after hitting your daily minimum. Consistency beats intensity—never miss twice.\n\nExample for tomorrow: at 9:00, sit down, open the project doc, set a 10‑minute timer, write three headings. Done. Momentum will follow the reps."
      }
    },
    {
      "id": "t3_w15zh2",
      "title": "[Need Advice] Forming the habit of working out at 5am",
      "body": "I have picked up two habits since last year, flossing daily and cold showers daily. However I just can’t seem to make the habit of working out at 5am stick. I’ve seen how completing the 5am workouts has given me more energy throughout the day and also made me more conscious about my food choices. I want to make this a habit. \nI am a morning person so no problem waking up at 5am but I do find myself gravitating towards work rather than working out. \n\nAppreciate your advice!",
      "comments": {
        "best_comment": "1. Alarm rings\n2. Get up within 30 seconds\n3. Pee/poop\n4. Drink some water\n5. Put on workout clothes\n6. Work out (or drive to gym)\n\nAt no point do you look at your phone, have breakfast, turn on the TV or anything else. You do everything above in order, no exception. You cannot give yourself even a moment's pause where you can think \"Oh, lemme just check reddit first, I'll work out in 20 minutes...\" Because then you won't work out. It needs to become automatic. Alarm rings = immediate workout.",
        "percentile_10_comment": "I switch the water and bathroom time. Down a nice tall glass of cold water (a bit more than it feels like is necessary). Wakes you up like a cup of tea!",
        "comment_gpt4o": "Hey there! It's awesome that you've already nailed flossing and cold showers—those are no small feats! For the 5am workout habit, since you're already up at that time, maybe try setting up your workout gear the night before so it's the first thing you see in the morning. You could also schedule your workout like an important meeting, blocking that time off just for exercise. If you find yourself gravitating towards work, maybe set a rule that you can't start work until after your workout. Lastly, consider finding a workout buddy or joining a class to add some accountability. Keep at it, and soon it'll be as automatic as your other habits!",
        "comment_gpt5_verbositylow_efforthigh": "Nice work on flossing and cold showers—proof you can build habits. The issue isn’t waking early; it’s competing priorities. Make 5–6am a no‑work zone. Put your laptop in another room, power cord in a drawer, and schedule a Focus/website blocker from 5–6 so you literally can’t “just check” anything. Treat the workout like a meeting with a written plan laid out the night before: exact exercises, reps, and a start time. Stack it after your cold shower: shower → clothes on → hit play on the same playlist → first set. Use a minimum baseline so it always counts: 10 minutes of movement is a win; most days you’ll keep going. Have a default template so there’s zero decision-making: 5 min warm-up + 2–3 simple circuits (push/pull/squat/core) + 5 min stretch. Reward it with something you care about—coffee, or permission to open your inbox only after you finish. Add accountability if needed: book a 5am class, meet a buddy, or post a daily check-in. When life happens, do the “lite” version at 5am so you don’t break the slot. Build the gate before work, make starting friction-free, and the habit will stick."
      }
    },
    {
      "id": "t3_13q8io6",
      "title": "[Need Advice] How do I manage my work and housework?",
      "body": "\nI am a 27yo working female living alone in a metropolitan city in India. My work timings are usually 10-6 but it’s not very in terms of when I reach. However, I usually reach home by 7-7:30pm. I recently moved into a 1bhk and set it up completely( a first for me). I realised that my eating habits were not healthy and very expensive as I would order everything from outside, so I decided to start cooking for myself. However, it takes a lot of my time and it’s very difficult to manage with work, even if I try making simple things. I know I can cut vegetables and everything from before and keep for a while. But everything is taking so much of my mind space. I think more about food and shopping for food rather than work. I also don’t have a maid currently and am doing the dishes and house cleaning on my own. I can afford a maid(it’s cheap in India) but I don’t want to coz I have had bad experiences before in Delhi and it’s another hassle to manage. \nI just want to know how to save time physically and mentally and concentrate on my work while also cooking for myself and also getting some me time along with some workout in the morning .\nIs it too much to ask ? Please help.\nAlso, I find it difficult to wake up super early so I usually try to wake up by 8am. I am trying to wake earlier though.",
      "comments": {
        "best_comment": "Cook in Batches like for 2/3 days. It saves a good chunck of time and you can use it for purposes. Also once you get all your veggies, clean and arrange them so you can quickly prepare and start making the food immediately. Some veggies also come precut.",
        "percentile_10_comment": "Clean dishes + stockpiled fruits, vegetables, meat = easy and quick cooking whenever you need it",
        "comment_gpt4o": "Managing work, housework, and personal time can definitely feel overwhelming, but with a few tweaks, you can make it more manageable. First, consider meal prepping on weekends. Spend a couple of hours cooking and storing meals for the week. This way, you only need to reheat food after work, saving you time and mental energy. You can also try batch cooking grains or proteins that can be mixed and matched with different veggies or sauces throughout the week.\n\nSince you’re open to waking up earlier, try gradually setting your alarm 10-15 minutes earlier each day until you reach your desired wake-up time. This can give you a bit more time in the morning for a quick workout or some \"me time\" without feeling rushed.\n\nFor housework, creating a simple cleaning schedule can help. Break tasks into small, daily chores instead of letting them pile up. For example, do dishes right after meals and dedicate 10-15 minutes each day to tidying up a specific area. This keeps your space clean without feeling like a huge burden.\n\nLastly, if managing a maid is too much, consider hiring one for just a couple of days a week to handle the heavier cleaning tasks. This could free up some of your time and reduce stress without the full commitment.\n\nRemember, it’s all about finding a balance that works for you. Small changes can make a big difference over time. Good luck!",
        "comment_gpt5_verbositylow_efforthigh": "Totally doable. The trick is to stop re-deciding food and chores every day and run a simple “default week.”\n\nPlan once, execute all week. Take 20 minutes every Saturday or Sunday to make a 2‑week rotation and a fixed grocery list. Keep breakfast to two defaults (e.g., eggs + toast or oats + fruit). Make lunch leftovers or a tiffin so you only cook dinner on weekdays. For dinners, pick fast, repeatable meals: dal + rice + salad, sambar + rice, paneer bhurji + toast, egg curry + rice, veg khichdi + dahi. Skip rotis on weekdays; they eat time. Save them for weekends or keep frozen parathas for emergencies.\n\nBatch prep in 60–90 minutes on the weekend to kill the mental load. Pressure cook a big dal or chana/rajma and portion it; make a large onion‑tomato “bhuna” masala and freeze in cubes; boil 6–8 eggs; wash/chop a few veggies; marinate paneer/chicken; mix dough if you absolutely want rotis; stock frozen peas/corn. Order groceries online from a saved list: one weekly fresh order and one monthly staples order.\n\nWeeknight autopilot when you get home: drop your bag, start rice cooker or put rice + dal pot‑in‑pot in the pressure cooker with separators, and do a 10–15 minute quick sabzi or salad while it cooks. Aim to eat in 25–30 minutes. Clean-as-you-cook and then set a 10‑minute timer for dishes and counters. Use fewer utensils and one‑pot meals to keep the sink light.\n\nLight, scheduled housework beats random deep cleans. Do a 10‑minute nightly reset (dishes, counters, put things away). Sweep/mop Tue and Fri for 15 minutes. Laundry Wed and Sun. Bathroom Sat for 20 minutes. That’s it. If you ever change your mind on help, consider hiring just 2x/week for jhadu‑pocha/bathroom only, which is low management overhead.\n\nMorning workout: make the “minimum” 10–15 minutes non‑negotiable (Surya Namaskar, brisk walk, or a short bodyweight circuit). Lay clothes out at night. Move wake time earlier by 15 minutes every 4–5 days until you hit your target, and anchor bedtime to 7.5–8 hours before wake. No screens the last 30 minutes.\n\nKeep a “base plan” for busy days (simple dinner + 10‑minute tidy + 10‑minute workout) and an “upgrade” for lighter days (extra veg, longer workout). The win is running the system most days, not perfection. Once your defaults are set and groceries are on autopilot, food and cleaning stop hijacking your brain, and work/me‑time fits in naturally."
      }
    },
    {
      "id": "t3_v3f7wv",
      "title": "[need advice] how to effectively lessen time on social media ¿",
      "body": "I use my phone when I get tired of doing tasks but I realized that I waste most of my time just scrolling down my phone and I tend not to notice how much time it consumes. I want to get disciplined but I just keep on doing the same thing every day. wish anyone could help me out.",
      "comments": {
        "best_comment": "Try putting your phone away when doing tasks. I keep my phone outside of my room (where my desk is) inside my bag by the front door. It's many walks away from me when I'm working which makes it inconvenient to use. \n\nAnother inconvenient tactic - I moved all my social media apps on my phone to the third page of my home screen inside the 5th page of a folder. It takes me 5 swipes to get to my distracting apps. Definitely helps!",
        "percentile_10_comment": "Use the mobile browser version of social media apps. The experience is so garbage you won’t want to use it for long",
        "comment_gpt4o": "Hey there! Cutting down on social media can be tough, but it's definitely doable with some small changes. Start by setting specific time limits on your apps using your phone's settings or a dedicated app. This way, you'll get a reminder when you've hit your limit. Also, try to replace the habit with something else you enjoy, like reading a book or going for a walk. It might help to schedule these activities into your day so you have something to look forward to. Lastly, consider keeping your phone out of reach when you're working on tasks to reduce the temptation to pick it up. Remember, it's all about small, consistent changes. You've got this!",
        "comment_gpt5_verbositylow_efforthigh": "This is super common, and you don’t need more willpower—you need guardrails. You scroll when you’re tired, so make a default break that isn’t your phone: stand up, drink water, two-minute walk or stretch, 10 slow breaths, splash water on your face. Do that first; only then decide if you still want to scroll.\n\nPut social into containers. Two short windows (10–15 min at lunch and evening) with a timer; no free scrolling outside those. Use iOS Screen Time/Android Digital Wellbeing to set app limits and Downtime, and run a Focus mode during work. Add friction: delete the worst app for a week, log out, move socials to the last screen in a folder, turn on grayscale, or use “one sec”/Opal/Freedom to block or delay openings.\n\nWhile working, keep the phone out of reach—drawer or another room. Work in 25–45 min focus blocks; during breaks, use the default break or intentional scrolling with a running timer. If you catch yourself opening an app on autopilot, close it immediately and do the break routine once. Track it with a tiny daily checklist: phone away during work blocks, social ≤ X minutes. Aim for consistent “B+” days for a week; adjust the limits down after that. You’ll notice the time savings fast."
      }
    },
    {
      "id": "t3_x5oxom",
      "title": "[Need Advice] How do I control myself from buying unnecessary things and improve my spending habits?",
      "body": "Idk if this is the right sub but I have trouble controlling my spending habits. Every time I have money I always spend it to buy unnecessary things because it made me feel good. Idk why but shopping is just satisfying and I just can’t help it. I think it’s just me coping with my negative feelings like whenever I feel sad or mad at someone because these are the times I usually decided to get something for myself to feel better. It made me feel good for a moment until I realised that I’ve spent a lot of money and could have saved it for something more important. Can anyone help and give me tips on how to control myself? How do I become more responsible and save money?",
      "comments": {
        "best_comment": "Every time you want to buy something, add it to the list. And then keep adding things to the list as you think of things to buy. I don't actually buy them though. And then eventually you'll realize that these things have been on the list for a really long time but you never really needed them so you'll be fine. You can do this thing where you just don't spend any money for a month called No buy month",
        "percentile_10_comment": "get yourself into severe debt",
        "comment_gpt4o": "Hey there! It sounds like you're dealing with some emotional spending, which is super common. Here are a few tips that might help you get a handle on it:\n\n1. **Awareness**: Start by tracking your spending. Use an app or a simple notebook to jot down every purchase. This will help you see patterns and understand where your money is going.\n\n2. **Budgeting**: Set a budget for yourself. Allocate a specific amount for discretionary spending each month. Once you hit that limit, try to hold off on more purchases.\n\n3. **Delay Gratification**: When you feel the urge to buy something, wait 24 hours before making the purchase. This can help you determine if you really need it or if it's just an impulse buy.\n\n4. **Find Alternatives**: Since shopping is a way to cope with negative feelings, try to find other activities that make you feel good. This could be exercising, reading, or even just going for a walk.\n\n5. **Set Goals**: Think about what you want to save for. Having a clear goal can make it easier to resist unnecessary purchases because you know your money is going towards something important.\n\nRemember, it's all about progress, not perfection. Be kind to yourself as you work on building better habits. You've got this!",
        "comment_gpt5_verbositylow_efforthigh": "You’re not alone. Shopping is engineered to feel good; beat it with systems, not willpower.\n\nPay yourself first: on payday auto‑transfer a fixed amount to a separate savings account with no card. If you don’t see it, you won’t spend it.\n\nGive yourself a weekly “fun money” allowance in cash or on a separate debit card. Buy whatever you want from that pot, but only that pot. When it’s gone, you’re done until next week.\n\nUse a waiting rule: under $25 wait 24 hours, $25–$100 wait 72 hours, over $100 wait 7 days. Add everything to a wishlist during the wait. Most wants fade.\n\nAdd friction: unsubscribe from promo emails, delete shopping apps, remove saved cards from your browser, and block store sites except during a planned window.\n\nHave a non‑shopping coping script. Example: “If I want to buy to feel better, then I take a 10‑minute walk, drink water, set a 10‑minute timer, and decide after.” Pick any quick, free mood lifter.\n\nTrack one metric: “No impulse purchase today?” yes/no. Do a 1‑minute nightly account check and tag each transaction Planned or Impulse. Wins stack fast.\n\nIf you slip, use a 24–48h return rule and move the refund straight to savings. Reframe prices in hours of work—if it’s not worth that many hours, pass.\n\nRun this for 30 days and tweak. Discipline comes from the setup; make the default easy and the impulse hard. You’ve got this."
      }
    },
    {
      "id": "t3_ommucw",
      "title": "[Need Advice] How to make myself choose the harder but better choice for myself",
      "body": "It's 4:40am right now on a Sunday and I'm realizing how much of a mess my life is. I gained a ton of weight in the past 3 months from working in retail to working in a bank, I have mismanaged my funds due to overeating as a coping mechanism, I buy food at the grocery that I don't eat and they end up as waste, I use Uber Eats a lot despite grocery issue, I use Uber a lot in the morning, my room is a mess, I'm a smoker, I'm pondering if buying a gaming laptop would be good for my mind, and I'm having joint and body pains from being a fat mess with an injured knee from a sports accident a year ago. \n\nAll of these I'm aware that they may all result in my early death. I'm also aware that I can make better choices by doing the opposite of those but why can't I? Why can't I choose something that'll better myself it just doesn't make sense to me. I just want this to stop. I want to get better and be disciplined with my life.",
      "comments": {
        "best_comment": "Your mind hates uncomfortable things right now, but in the future not so much. That's called the present bias. The good things long term are often unpleasant now and your brain steers you away from the \"pain\" associated with those.\n\nFor bad habits, it will take discipline, but there are some things you can do:\n\nAs you've pointed out, bad habits are almost always coping mechanisms. So what are the emotions, events and situations that are at the root? If you can tackle even some of those, you should see less of the bad behaviour. \n\nSecond, try to find an alternative. \n\nFor a better understanding: smoking and eating can help deal with stress. That goes back to prehistoric times when there was often danger. If you were eating, it was because you found a safe place to do so. Even today eating or smoking send signals to your brain like \"I'm eating/chewing, so I must be safe right now\" which helps against stress.\n\nChewing gum would give you a similar effect but without the bad consequences.\n\nAnd probably the easiest thing to start with, change your environment. What barriers can you put in place that make the bad behaviour harder to do or unpleasant? And how can you make the good choices easier to do?\n\nIt's gonna take time to break bad habits, but it should get better once you start seeing some results.",
        "percentile_10_comment": "One step further: actually reward yourself. When I started running I rewarded myself with a TV show I wasn't allowing myself to watch until the run, or a chocolate protein shake (I love chocolate). Find the things you love doing in the day, and save them as rewards for doing the new habit - no matter how small the new habit is.",
        "comment_gpt4o": "Hey there! It sounds like you're going through a lot right now, and it's great that you're reaching out for advice. Making the harder but better choice often starts with small, manageable steps. Here are a few ideas that might help:\n\n1. **Start Small**: Pick one area to focus on first. Maybe it's reducing Uber Eats orders or setting a small budget for groceries. Small wins can build momentum.\n\n2. **Set Clear Goals**: Define what \"better\" looks like for you. Is it cooking one meal at home per day? Walking for 10 minutes? Having a tidy room? Clear goals can guide your actions.\n\n3. **Create a Routine**: Establish a simple daily routine. It could be as basic as waking up at the same time, making your bed, or having a set time for meals. Routines can provide structure and reduce decision fatigue.\n\n4. **Accountability**: Share your goals with a friend or join a community (like this one!) to keep you accountable. Sometimes knowing someone else is rooting for you can make a big difference.\n\n5. **Be Kind to Yourself**: Change is hard, and setbacks happen. Don't beat yourself up over them. Acknowledge the slip and refocus on your goals.\n\nRemember, discipline is a skill that takes time to develop. Celebrate your progress, no matter how small, and keep pushing forward. You've got this!",
        "comment_gpt5_verbositylow_efforthigh": "Discipline isn’t you versus willpower; it’s setup. Make the better option easier and the worse option harder. Start with one lever for 7 days: no delivery. Delete Uber Eats, unsave your cards, block it with Screen Time/BlockSite. Create one default 10‑minute dinner you can always make (rotisserie chicken + bagged salad; eggs + toast; frozen veggie stir‑fry + pre‑cooked protein). When the urge hits, cook the default before deciding anything.\n\nCut morning Ubers by prepping at night: clothes out, bag and lunch ready, keys by the door, coffee set. Phone across the room with two alarms and leave on the first alarm. Treat Uber as “rain/emergency only.”\n\nRoom: do a strict 10‑minute timer daily for trash and dishes only. Stop when it ends. That clears space fast and builds momentum.\n\nSmoking: either set a quit date, or this week replace the first cigarette with gum/patch and cut one total per day. Use a quitline or ask a pharmacist for NRT.\n\nKnee/weight: 10 minutes of low‑impact daily (walk, bike, or a beginner knee PT routine on YouTube). Food drives weight change, so lean on the default meal and eat protein + produce first. See a PT if the knee limits you.\n\nMoney: move bill money to a separate account on payday. Cancel Uber One/food subs. Use a weekly cash or low‑limit debit budget for food/transport. Use a 30‑day rule for non‑essentials over $100—put the gaming laptop on your calendar and revisit after 30 days of habits.\n\nWrite three if‑then rules and tape them up: if I want delivery, I cook the default and wait 20 minutes; if I’m tempted to Uber, I leave now and take transit; if I’m overwhelmed, I do a 10‑minute tidy. Track just three streaks this week: no delivery, prepped at night, 10‑minute tidy. Expect slip‑ups, restart at the next decision, and keep the rules. Once this sticks, add the next habit."
      }
    },
    {
      "id": "t3_13iiiex",
      "title": "[Need Advice] Went from extreme discipline to basically zero. Very unhappy with myself and my life.",
      "body": "I'm learning to play the guitar.",
      "comments": {
        "best_comment": "Sounds like you’re experiencing burn out. You worked really hard, you still work really hard, so first thing first, give yourself some credit. \n\nI recommend sleeping a little bit more, force yourself to go to bed before 11 PM, you are not resting enough. Working for 12 hours is definitely too much; work is draining your energy. If you’re independent and have the opportunity to decide your time, i suggest you to stop working at most within 8 PM. \n\nIf the place you live in is not enjoyable for you and you live alone, consider to move in a less expensive environment.\nBy now, your mental and physical health needs to be your number one priority. Find a hole in your routine to take a moment for sport, jogging, yoga, quick workout at the gym (45 min is enough), boxe (even at your home if you want to!), there are many choices. \n\nIf you don’t have much time to cook, which is a super relaxing and fun hobby, you can try meal prep, so you can make healthier choices and don’t have to think about cooking everyday; you can prep during the weekend. \n\nIf there are other details that could possibly help me to understand your situation and maybe give u better advice, feel free to respond. \nAlso, i’m italian so my english skills are pretty shitty, i hope you understand!",
        "percentile_10_comment": "Fuck the people who say grind more.\n\nFuck the 12 hour day.\n\nFuck 300K if it gets you this.\n\nFuck the current zip code.\n\nUse your money. Get a cook. Get time off every week. Get into a cheaper place. This will be very bad for your future health, not to mention it's killing you now.\n\n Get off this train immediately, friend. \n\nIf I made more than slave's wages, I'd make people work for me and make this work.\n\nHow can people help you, in real time? I always remember what a kid at my christian youth group camp said to me, \"people are great, if you know how to use them.\"\n\ngross, I know, but he's got a point. If you have the resources, you have a way out. \n\nHe's probably running some divinely fostered MLM scheme now....\n\nHere's a hug. I hope you figure it out soon.",
        "comment_gpt4o": "Hey there! It sounds like you're going through a tough patch, but it's great that you're reaching out for advice. Getting back on track with discipline can be challenging, but it's definitely doable. Since you're learning to play the guitar, try setting small, achievable goals to rebuild your routine. Start with just 10-15 minutes of practice each day. Consistency is key, and even short sessions can make a big difference over time. Also, try to connect with other guitar learners or join a community online. Sharing progress and challenges with others can be really motivating. Remember, it's okay to have ups and downs—what matters is getting back up and keeping at it. You've got this!",
        "comment_gpt5_verbositylow_efforthigh": "Use guitar as your comeback habit. Drop the extreme goals; build boring consistency. Pick a fixed cue (right after dinner), sit down, set a 15-minute timer, and play. Set a floor of 2 minutes and a ceiling of 30 so you don’t avoid it or burn out. Keep the guitar on a stand with pick/tuner visible to kill friction. Pre-plan the session: quick warmup, one skill (chords/strumming/scales), then a song you enjoy. End by writing tomorrow’s first drill. Track it with a calendar X. Never miss twice; if you miss, do the 2-minute version before bed to keep the chain alive. Record a 30-second clip weekly for feedback and motivation. After two solid weeks, bolt on one more tiny habit next to it. Discipline is just showing up. Start small and let the wins stack."
      }
    },
    {
      "id": "t3_12k7iil",
      "title": "[Need Advice]I cant even get myself to work 3 hours a day consistently.",
      "body": "Hello, I started since Monday a goal to work at least 3 hours a day of pure work. The first two days I did will and actually worked for 4 hours. But by Wednesday i couldn’t even get myself to work more than an hour. I spent so much energy forcing myself to work that day and I couldn’t do it. Almost like I was constipated mentally.\n\nShould I lower down the work hours (even tho 3 is so small). And try to gradually increase the minimum time working? Or is it because I just don’t care enough about this business I’m working on. I’m amazed how people can work 6 hours a day of pure focused work. Sometimes I think there’s something wrong with me.\n\nWhen it comes to gym, eating healthy I can see those benefits immediately right after and feel good. But with work I feel like shit after and I don’t really care about making bank. I do feel good sometimes but for the most part its a chore that makes me dislike life more.\n\nThank you!",
      "comments": {
        "best_comment": "Look up Atomic Habits. The real goal right now is to just convince yourself to show up to your work setting and not worry about how long. Maybe a few times a day to return. Maybe you get some in, maybe not. But good chance while you're at it without the pressure you will.\n\nNext make it fun, find something to reward yourself ONLY when you do some work. That's it. The only time. Associate it with doing the Thing (work) and you'll enjoy work a bit more knowing what you get out of the deal",
        "percentile_10_comment": "Start so small that you laugh at it, do it for a week, increase by 10min, do it for a week, rinse & repeat until you’re at your goal of 3h. It’ll take longer but it’ll be a habit.\n\nYou can also look up the pomodoro technique, think of ways to make it fun (reward yourself etc but not every time), have a deal made with someone that you pay them £xx.xx or donate to something you dislike if you miss 2 days in a row or 2 days from the same week. We can work a lot better with a drive to do it (the fun part) and a drive to not miss it (the punishment of losing money/whatever you decide).\n\nTry to make sure you enjoy the work you’re doing too if you’re lucky enough to be in that situation, definitely helps a whole lot!\n\nEDIT: Forgot to mention finding out ‘Why’ you’re doing this work, what drives you? Write that down and look at it everyday. So, when you’re having a bad day and ask yourself “what the f am I doing this?” Your brain replies with the answer and continue.",
        "comment_gpt4o": "Hey there! It sounds like you're really trying to find a balance that works for you, and that's a great start. First off, don't be too hard on yourself. It's normal to have fluctuations in motivation and energy. If 3 hours feels overwhelming right now, it's totally okay to scale back a bit. Try starting with shorter, focused sessions, like 30-45 minutes, and gradually build up as you get more comfortable. \n\nAlso, consider breaking your work into smaller, more manageable tasks. This can make the work feel less daunting and give you a sense of accomplishment as you complete each one. It might also help to set specific goals for each session, so you have a clear purpose and can see progress over time.\n\nSince you mentioned that you don't feel the same immediate benefits from work as you do from the gym or eating healthy, try to find ways to make your work more rewarding. Maybe set up a small reward system for yourself or find aspects of the work that you enjoy and focus on those.\n\nLastly, it's worth reflecting on whether this business aligns with your interests and values. If it doesn't, it might be why you're struggling to stay motivated. But if it does, remember that building discipline is a process, and it's okay to take it one step at a time. Keep experimenting with what works for you, and don't hesitate to adjust your approach as needed. You've got this!",
        "comment_gpt5_verbositylow_efforthigh": "Three hours of “pure focus” every day isn’t small—it’s a trained capacity. Most people top out at 3–4 hours of deep work after they’ve built up to it. You jumped straight to the advanced version, so the midweek crash is normal.\n\nLower the floor, keep the ceiling. Make your non‑negotiable something you can hit on your worst day: one or two short blocks (e.g., 20–30 minutes each). Use a timer, then take a real break. On good days, stack more blocks to reach 3 hours. Track weekly totals so a rough day doesn’t nuke the streak.\n\nMake the work stupid‑clear. “Work on business” is vague; your brain will dodge it. Define the next physical action: outline the landing page, draft 150 words, send 3 emails, analyze 10 rows, etc. If it’s unclear, the task is “plan the next steps for 10 minutes.”\n\nUse a starter ritual so momentum does the heavy lifting: sit down, open the file, set a 25‑minute timer, write a terrible first line. Promise yourself you can stop after one block. Put your phone in another room and block distracting sites. Schedule your first block at your best energy time (often right after a walk or the gym).\n\nEnd before you hate it. Leave a breadcrumb note: “Next: fix headline, then send to X.” Give yourself a small, immediate reward after each block so your brain starts associating work with a quick hit of “good.”\n\nIf money isn’t motivating, anchor the work to something you do care about—mastery, freedom, building something you’re proud of, reducing future stress. That’s fuel you’ll actually burn.\n\nIf, after a couple of weeks of low‑floor blocks and clearer tasks, you still dread every session, look at the work itself: can you change what you’re doing within the business or pivot entirely? And if focus has been a long‑term struggle across areas, it’s worth talking to a pro to rule out things like ADHD/anxiety.\n\nYou’re not broken. Treat it like the gym: start light, nail form, add plates over time. Consistency first, volume second."
      }
    },
    {
      "id": "t3_s2mn65",
      "title": "[need advice] how do you ppl get the energy to cook on weekdays?!",
      "body": "Before you say, cook on weekends. I’ve tried meal prepping once a week and it makes me feel a bit gross to eat stale food. So my ideal routine would include 2 meal prep  per week. \n\n\nI finished work this evening and I’m exhausted.  And not just physically, it’s just my eyes are tired from looking at a screen all day long. When my eyes feel tired, i know I’m out for the day.  If I’m just physically tired, i can still push through.\nI’ve decided to stop ordering takeouts and eating healthier (to help with energy). And i dont want to make cheat meals full of empty nutrients. \n\nIf you’ve managed to make this work in your routine, any tips?",
      "comments": {
        "best_comment": "Blue apron helps me because I know if I don't cook I'll lose meals. Other than that, the answer is wine and not having energy for anything else 😆",
        "percentile_10_comment": "1. Make rice, stew etc for 3-5 days on weekends (3 cups of rice is enough for 1 person) \n2. Prep everything on the weekends. Marinade what you can for Mon & tuesday. \n3. Literally, just steam your marinated meat and veggies, heat up your rice. Leave it on the stove for 10-20 mins and you're ready to eat it.\n\nIt's a lot less work than it seems. You don't have to do much.\n\nI'll try kimchi, because I think you can keep it for months.",
        "comment_gpt4o": "I totally get where you're coming from—after a long day, the last thing you want to do is cook. Here are a few ideas that might help: \n\n1. **Simplify Your Meals**: Focus on recipes that are quick and easy but still healthy. Think stir-fries, salads, or one-pot meals that take 20-30 minutes max. \n\n2. **Batch Prep Ingredients**: Instead of full meals, prep ingredients twice a week. Chop veggies, marinate proteins, or cook grains in advance. This way, you can mix and match to create fresh meals quickly.\n\n3. **Use a Slow Cooker or Instant Pot**: These can be lifesavers. You can throw everything in before work and come home to a ready meal. Plus, they often make enough for leftovers that don’t feel stale.\n\n4. **Set a Routine**: Try to set a specific time for cooking, like right after work. It might be tough at first, but once it becomes a habit, it’ll feel less like a chore.\n\n5. **Incorporate Breaks**: If screen fatigue is a big issue, take short breaks during the day to rest your eyes. This might help you feel less drained by the evening.\n\nRemember, it's all about finding what works for you and making small adjustments. Good luck!",
        "comment_gpt5_verbositylow_efforthigh": "Energy at 7 p.m. is unreliable; build a system that makes cooking the default. Do two component preps (Sun + Wed): cook a pot of grains, a tray of protein, a tray of veg, and a quick sauce. Store components and sauces separately and freeze half the protein so nothing sits more than ~3 days. Weeknights become 10–15 minutes: reheat protein/veg in a hot pan or air fryer for texture, add a fresh element (bagged slaw, herbs, lemon), assemble.\n\nUse templates to kill decision fatigue: bowl (grain+protein+veg+sauce), tacos/lettuce wraps, or stir-fry/egg scramble. Decide the week’s dinners on Sunday, put them on the fridge, and defrost what you’ll use each morning.\n\nProtect your after-work energy with a tiny ritual: 10 minutes off screens, water and a short walk or shower, then turn on the pan or rice cooker before you can think. Pair it with a podcast. If motivation is low, give it 10 minutes; if it’s still a no, hit a healthy fallback instead of takeout: eggs + spinach + toast, tuna + white beans + olive oil + lemon, rotisserie chicken + bagged salad + microwaved potato. Frozen veggies are clutch.\n\nTo avoid the “stale” vibe, keep sauces/toppings separate and rotate them (peanut, chimichurri, tahini, salsa). Add friction to takeout by deleting the apps and track a simple streak: home‑cooked dinners this week. Two weeks in, this runs on autopilot."
      }
    },
    {
      "id": "t3_140lzrf",
      "title": "[Need Advice] Why is it so damn difficult to stay consistent with exercise?",
      "body": "As the title states...WHY?!  The first 2 - 3 weeks I'm all-in, all gung-ho. I'm loving how I'm looking and feeling. But after a while I get burnt out and take a couple days off. Those days then become weeks and weeks and then I'm back to square one. \n\nI'm an early morning work out type person, I can't stand the packed & crowded gym after work and I don't have the same energy either as I do in the am. \n\nFor those that STAY consistent,  what is your advice? \n\nThank you all in advance for your time and responses.\n\nEdit : I wasn't expecting so many replies. Thank you all for being very helpful!",
      "comments": {
        "best_comment": "Don't overdo it and when you're not feelig fully up to it accept that somethign is better than nothing. Perfect is the enemy of good.",
        "percentile_10_comment": "I started doing this with my workout clothes and my clothes for the office the night before, and then with my breakfast cooking setup (same thing every day, takes a bowl, measuring cup, spoon, skillet, cooking spray, coffee tumbler, pour over). It’s just makes the mornings so easy and automatic, helps me get out of the house earlier, no mental energy used",
        "comment_gpt4o": "Hey there! Staying consistent with exercise can be tough, but you're definitely not alone in this struggle. One thing that might help is to focus on building a routine that feels sustainable rather than going all-in right from the start. Try setting smaller, more manageable goals and gradually increase the intensity or duration of your workouts. This way, you're less likely to burn out.\n\nAlso, consider mixing up your workouts to keep things interesting. If you're an early morning person, maybe try different types of exercises that you can look forward to, like a new class or a run in a different location. Lastly, remember that rest days are part of the process, not a setback. Plan them into your routine so they don't feel like you're losing momentum. Keep at it, and you'll find your groove!",
        "comment_gpt5_verbositylow_efforthigh": "That 2–3 week burnout usually means you’re starting too hot and relying on hype. The fix: build a floor, schedule rest, and automate your mornings.\n\nSet a floor. On workout days, your minimum is 10 minutes (mobility, easy sets, or a brisk walk). If you feel great, do the full session; if not, stop at 10 and you still win. Never miss twice.\n\nUse a simple template: Mon/Wed/Fri full‑body 45–60 min. Tue/Thu 10–20 min easy cardio or mobility. Weekends off. Every 4th week, cut volume by ~40% so you don’t flame out in week 3.\n\nProtect the morning. Clothes out, bag packed, alarm across the room, lights on, water and coffee ready, bedtime set so you get enough sleep. Pre-plan the exact workout the night before so there’s zero decision-making at 5 a.m.\n\nIf you oversleep, do a 15‑minute at‑home circuit after work to keep the chain. Missing once is normal; missing twice creates the slide.\n\nTrack it on a calendar and give yourself a tiny reward after each session (great coffee, a podcast only during workouts). If you want extra insurance, book a class or meet a buddy once a week.\n\nDo this for a few months and the boom‑bust goes away. Consistency > intensity."
      }
    },
    {
      "id": "t3_slz1uo",
      "title": "[Need Advice] Why do I always feel the need to sleep after lunch?",
      "body": "As the title says, i really don't know why I feel tired every afternoon. Like as soon as I finish eating I need to go to sleep or spend at least 30-60 minutes on the bed.\n\nI tried studying or doing something that I like as soon as lunch was over, but I always keep coming back to my bed. \n\nAny advice is appreciated, like why is this happening, how can I fix this etc...",
      "comments": {
        "best_comment": "Food intake(especially carbs) increases blood sugar(transient hyperglycemia). This is brought under control by insulin released by special cells in the pancreas. It is hypothesized that hyperglycemia reduces the level of orexin, which plays a major role in maintaining alertness. You can call it the alertness hormone.\n\nHow to manage this? Cut down on carbs, sub it with protein, reduce servings ideally. I skip lunch entirely and have breakfast and an early dinner. Haven't needed an afternoon nap unless really exhausted.",
        "percentile_10_comment": "I would suggest avoiding sugar and carbs.\n\nFor breakfast and lunch, I go for low calorie meals high in protein and fiber with a little at. My breakfast during the week is a Quest bar, and my lunch varies but is usually something like a chicken soup, chili, meat and cheese (skip the crackers though), something like that. I'd also recommend spice for lunch. Eating something extremely spicy will help keep you alert. Peppers are really good for you, too.\n\nThe one exception is in the early summer when it's in season I like to have fresh fruit, especially berries, and whipped cream, because that is just one of my favorite things.\n\nFor dinner after you are mostly done being productive for the day is the time to eat your carbs.",
        "comment_gpt4o": "Feeling sleepy after lunch is pretty common and can be due to a few reasons. It might be related to what you're eating. Meals high in carbs or sugar can cause a spike in blood sugar followed by a crash, making you feel tired. Try incorporating more protein and healthy fats into your lunch to see if that helps. Also, consider your portion sizes; eating too much can make you feel sluggish. \n\nAnother thing to look at is your overall sleep quality and quantity. If you're not getting enough rest at night, it can make you more prone to afternoon drowsiness. \n\nFinally, try to get some light physical activity after eating, like a short walk. It can help boost your energy levels and keep you away from the bed. Building a habit of staying active after lunch might take some time, but consistency is key. Keep experimenting with these changes and see what works best for you!",
        "comment_gpt5_verbositylow_efforthigh": "Totally normal to crash after lunch; it’s a combo of the circadian dip and big/sugary meals spiking and dropping your blood sugar. You can blunt it and build a routine that carries you through.\n\nMake lunch smaller and steadier energy: mostly protein + veggies + some fat, go easier on refined carbs/sweets, and skip alcohol. Stop at “comfortably not full.” Then, the moment you finish eating, start a simple post‑lunch ritual so you’re not deciding in the moment: drink a glass of water, do a 10–15 minute brisk walk outside for light and movement, then sit down for a single 25‑minute focus block on something low-friction. Put this on a repeating timer. If you work near your bed, change location after lunch so lying down isn’t the default.\n\nUse light and temp to your advantage: bright light on your workspace and a slightly cooler room help. Caffeine timing matters—have coffee/tea right before the walk or try a “coffee nap” (small coffee, 15–20 min nap, alarm). If you nap, keep it 10–20 minutes and not late in the day; 30–60 minutes drops you into deep sleep and makes you groggy.\n\nProtect nighttime sleep: consistent wake time and 7–9 hours make the afternoon dip much smaller. If you’re underslept, no hack will fully help.\n\nGive this exact routine a 7–10 day trial and adjust one variable at a time (meal size, walk length, caffeine). If the sleepiness is extreme or unchanged after solid sleep and these tweaks, consider checking basics like anemia, thyroid, apnea, or blood sugar.\n\nDiscipline angle: don’t rely on willpower; rely on defaults. “After lunch, I walk, water, 25 minutes.” Do it before your brain petitions for the bed. It gets easier once it’s just what you do."
      }
    },
    {
      "id": "t3_10sae8b",
      "title": "Too many interests, not enough time [need advice]",
      "body": "I have so many skills and interests but I feel like there’s not enough time to work on any of them.I work full time and my job is pretty taxing, I usually work 9-5 but usually stay working until 5:30 sometimes 6. I wfh so thankfully theres no commute.i have a dog which takes up an hour after work to walk, feed, play with him. Since I wfh I try to finish up most of my chores during the day when I can so I dont have much to do after work. By the time I’m done it’s usually around 8, sometimes around 7. I like to be In bed by 11, this gives me 3-4 hours a day.\n\ni have so many things I want to do in life. I love music and play two instruments and want to find time to continue playing them. I love reading and writing. I was learning French and am at an intermediate level, I really want to be fluent and even learn more languages.i love learning new things and would love to take some online courses, physics, bio, chem, philosophy, etc.\n\ni would also love to start my own company. I feel like this would allow me to control my work and control my hours. Ik its A grind but I would be willing to do it.\n\nclearly, I have too many goals and not enough time. i often get option paralysis and end up doing nothing but watching tv. Some days I feel so burnt out by work that I do nothing but watch tv.\n\nAny advice on managing this would be appreciated.",
      "comments": {
        "best_comment": "One thing at a time. You can't do everything. Have priorities. Less is more. You can always learn a third language after you finish learning your second. You're not saying no to other things forever by doing the first thing now.",
        "percentile_10_comment": "I’m happy to hear of someone who devotes an hour a day to their dog. That’s an awesome use of your time. Beyond that, I agree strongly with some of the other commenters - start working on 1 thing at a time. See how it goes doing it consistently for, say, 6 months. At that point, you can do it more or less and/or add a new thing to try and do consistently. \n\nAlso stick with the things you’re already doing if you like them, or scale back on those to make more time for yourself if you feel you could better invest your time elsewhere",
        "comment_gpt4o": "It sounds like you have a lot of passions, which is awesome, but it can definitely feel overwhelming. One approach is to prioritize and rotate your interests. Start by picking one or two things to focus on each week. For example, dedicate one week to music and reading, and the next to language learning and writing. This way, you’re not trying to do everything at once, and you can give each interest the attention it deserves. \n\nAlso, consider setting small, achievable goals for each interest. Instead of aiming to become fluent in French immediately, set a goal to practice for 15 minutes a day. This makes it more manageable and less daunting. \n\nLastly, try to schedule your time. If you have 3-4 hours in the evening, allocate specific time slots for your activities. This can help prevent option paralysis and ensure you’re making progress. Remember, it’s okay to have downtime too—balance is key. Good luck!",
        "comment_gpt5_verbositylow_efforthigh": "You don’t need more time, you need fewer active priorities at once. Run your life in 6-week sprints: pick one primary focus, keep two things in “maintenance,” and park everything else on a list for later.\n\nMake French your “during the dog walk” habit. Queue a podcast or shadowing audio, or run Anki audio while you walk. That gives you 20–30 minutes of language every day with no extra time cost.\n\nAfter the dog/chores, keep a simple evening template. Example: 90 minutes on your current focus, 20 minutes on an instrument, 20–30 minutes reading or writing to wind down. That fits your 7–11 window, and you’re still in bed by 11. Do this 4 nights a week; keep one weeknight free. If you want more, add a 2–3 hour block on one weekend morning.\n\nBeat option paralysis by deciding tomorrow’s exact next action before you stop today. “Open Chapter 3 and complete problems 1–4,” or “Email 5 potential customers,” not “work on course/business.” Set Do Not Disturb, start a timer, and go. On low-energy days, hit the floor only: 10–15 minutes French + 10 minutes instrument, then rest guilt‑free. No zero days.\n\nKeep a “parking lot” note for all the other cool things. At the end of each 6-week sprint, review it and either continue the same focus or swap it. Over a year you’ll give each interest a real season without constant context switching.\n\nMake TV the reward, not the default. “Blocks first, then TV,” with a hard stop alarm so you still make bedtime. If bingeing is the trap, log out or move apps off the home screen until after your blocks.\n\nIf the company is the big dream, give it a dedicated season. Use that sprint for customer discovery and a tiny MVP, not more courses. You’ll learn faster and see if it deserves the next sprint.\n\nThree focused hours a night is plenty. Pick one thing, protect a small daily floor for the rest, and let the sprints compound."
      }
    },
    {
      "id": "t3_oexyx3",
      "title": "[need advice] how do you force yourself to wake up early without feeling miserable",
      "body": "I’ve always been a night owl for as long as I can remember. I love staying awake at night, and I naturally tend to fall asleep around 2 to 3 AM and wake up around 10-11AM feeling well-rested. But lately I’ve really had a desire to try to become a morning person so that I can be more productive throughout the day. Do you guys have any tips on how you wake up early, like 6 AM? How do you force yourself out of bed when all you feel like doing is sleeping for “five more minutes.”\n\nEdit: just wanted to thank everyone for taking the time out of their day to contribute such helpful comments! I may not be able to comment on each individual post, but I will try to read as many tips as I can and incorporate them. I hope others find these tips just as helpful as I did :)",
      "comments": {
        "best_comment": "I’m the same as you. I used to spend the whole night scrolling the internet, binge watching, buying useless stuff, whatever. Waking up at 1pm easily. Over the past year I’ve decided to get my life in order. Didn’t especially focus on my sleep schedule issues, but on my general well being. I listen to my body more, I rest more and quit drinking, I take the time to do painting / drawing, whatever creative activity calms me down. Cut out all social media except for Reddit sometimes, never at night. I started feeling more relaxed in the evenings, and I came to enjoy reading a book at 10pm as much as I used to enjoy binge watching Netflix all night. Being far from screens, I get tired, I fall asleep. Naturally, I wake up earlier and earlier every week, step by step. \n\nMy point is, I’ve used every technic I could find to become a morning person before, and it never worked (I was late EVERY day to my job for 4 years). It is only when I started taking care of myself globally and on a more spiritual level too that it has changed. Feeling good and proud about yourself is the best way to actually want to get out of bed and face the day.",
        "percentile_10_comment": "* A normal sleep schedule\n* An accountability partner getting me to follow said schedule, who also is my partner\n* A happier partner\n* More time do to the fun stuff with said partner\n* Nice breakfasts together\n* Two squabbles less\n* Also what the others said",
        "comment_gpt4o": "Hey there! Transitioning from a night owl to an early riser can be challenging, but it's definitely doable with some gradual changes. Start by adjusting your bedtime in small increments, like 15-30 minutes earlier each night, until you reach your desired wake-up time. Consistency is key, so try to stick to the same sleep schedule even on weekends. \n\nCreating a relaxing bedtime routine can also help signal to your body that it's time to wind down. This could include activities like reading, meditating, or taking a warm shower. In the morning, place your alarm clock across the room so you have to physically get out of bed to turn it off. Once you're up, expose yourself to natural light as soon as possible to help reset your internal clock.\n\nLastly, give yourself something to look forward to in the morning, like a delicious breakfast or a few minutes of quiet time with a cup of coffee. It might take some time, but with patience and persistence, you'll likely find it easier to wake up early and start your day on a productive note. Good luck!",
        "comment_gpt5_verbositylow_efforthigh": "Night-owl turned early riser here. You don’t force it; you rig the environment so getting up is the easy default. Don’t chop sleep—shift it. Move your wake time 15–30 min earlier every 2–3 days, hold each step a few days, and keep the same wake time all 7 days until you hit 6.\n\nUse light to move your clock. As soon as you wake, turn on bright light and get outside for 5–15 minutes. At night, dim lights/screens for 1–2 hours before bed, stop caffeine by early afternoon, and set a reverse alarm 60–90 minutes before bed to start winding down.\n\nKill the “five more minutes” with an autopilot script. Put the alarm across the room next to a lamp on a smart plug or sunrise alarm. When it goes off: feet on floor, lights on, drink water, bathroom, clothes on, step outside for a quick walk. Don’t think—count 5-4-3-2-1 and start a 10‑minute minimum morning. Make it pleasant: coffee on a timer, a playlist, and have your top task written the night before so you can do 10 minutes on it once you’re up.\n\nAdd friction to snoozing and some accountability. Charge your phone in another room, use an app that fines you for snoozing, or send a “proof of up” text to a friend by 6:05 for a week.\n\nIf you go to bed late, still wake at the set time and go earlier the next night; a 20‑minute nap before 3 p.m. is fine if needed. Keep weekends within an hour of your target. Give it 10–14 days of consistency and it stops feeling miserable. If 6 a.m. is arbitrary, pick the earliest time that still gives you 7–9 hours."
      }
    },
    {
      "id": "t3_13lfafr",
      "title": "[Need Advice] How to get into a good routine after work?",
      "body": "I want to be more productive outside of work. I want to workout, cook, take my dog out, learn a new hobby. \n\nI’ve been working out inconsistently. I try to take the dog out for a walk when I can. \n\nMy **biggest** challenge is walking early. I feel like I **can not** get myself to wake up early.",
      "comments": {
        "best_comment": "You gotta fix your schedule, there's no way around it, even your free time needs to be scheduled. The main tip to wake up early is to sleep early and always the same time, including weekends, in a few days you'll naturally wake up the same hour everyday, the problem is that usually when our system is understanding our new routine we screw up during the weekend.   \nTalking about the routine after work, you have to optimize your activities in a way that you lose time as little as possible like going to the gym after work, go home straight to shower or shower in the gym; right after, you start to cook and if possible cook more meals, this way you save gas/electricity and saves time the next day; schedule what you have to do earlier in the night or maybe during the cooking so you still have a bit of energy like maybe a class or learning a hobby, and the last 1 or 2 hours you have left you rest, watch something dumb, play something, maybe read and slowly let the sleep routine take over.   \nIn a few days you'll love your new routine and you'll realize the more you do the more can be done. Idk why but this happens a lot, when we are lost and without a routine we tend to think we don't have time. but when we figure it out, we understand that there's always a little windows to stick something new you want to try. Be curious, test it, try new things, improvise but always follow your schedule, I like to organize my week during my sunday, this way I know exactly what have to be done in the following days, including when I'll rest.",
        "percentile_10_comment": "You might wanna check out Nuj Alarm Clock.\n\nIt’s an app I built that charges money if you don’t get up and scan a barcode (e.g. your toothpaste) within a few mins of your alarm.",
        "comment_gpt4o": "Creating a routine after work can be a game-changer! Start by setting small, achievable goals. For example, commit to a 10-minute workout or a short walk with your dog right after work. This can help build momentum without feeling overwhelming. As for waking up early, try focusing on your evening routine first. Gradually go to bed earlier and create a relaxing pre-sleep ritual to improve your sleep quality. You might find it easier to wake up earlier once you're well-rested. Also, consider prepping meals or planning your hobby time in advance to make it easier to dive in. Consistency is key, so be patient with yourself as you build these habits. You've got this!",
        "comment_gpt5_verbositylow_efforthigh": "You don’t need mornings to be consistent. Build an after‑work chain with tiny non‑negotiables and let it run on autopilot. Example: walk the dog 15–20 minutes as soon as you get home (before you sit down) to reset. Back home, do 15–20 minutes of a simple workout (bodyweight circuit is fine). Cook one of three easy dinners you’ve planned, then set a 15–20 minute timer for your hobby. On low‑energy days, do five minutes of each and call it a win—the streak matters more than volume.\n\nMake it automatic by removing friction ahead of time: set out leash and workout clothes in the morning, keep ingredients prepped on Sunday, put your phone on Do Not Disturb until the chain is done, and give the routine a fixed start time on your calendar. Use if‑then rules: if you get home late, do the five‑minute version; if it’s raining, do indoor play and a short bodyweight circuit.\n\nIf you still want early mornings, shift wake time 15 minutes earlier every few days, keep a consistent bedtime, put the alarm across the room, get bright light immediately, and step outside with the dog for two minutes. But don’t wait on mornings—nail the after‑work baseline first.\n\nTrack with a simple “Walk • Workout • Cook • Hobby” checkbox on your fridge. Hit the checkmarks most weekdays and the routine will click."
      }
    },
    {
      "id": "t3_xt9y8l",
      "title": "[Need Advice] To people who do work or activities that require immense amounts of discipline frequently , what trick did you employ to get into that flow state",
      "body": "I'm having difficulty turning occasional habits into daily consitent habits and was wondering what others  who were in my situation did to tackl the problem.\n\n[Edit] Thank you to everyone who took their time and contributed to the post. I've received some very insightful advice on the techniques i can use to boost my discipline. I will make full use of them",
      "comments": {
        "best_comment": "That’s a tough one. Seems like the best thing I’ve done is to create a first step that is simply too small to fail. I want to walk? I just focus on putting on my shoes. Once I’ve done that I’m much more likely to actually continue on with the task.",
        "percentile_10_comment": "I notice I’m deepest in the flow state when I use mind muscle connection in any physical sport",
        "comment_gpt4o": "One trick that really helped me was the \"two-minute rule.\" Basically, if a habit takes less than two minutes to start, just do it. This helps overcome the initial resistance and makes it easier to build momentum. For example, if you want to start reading daily, just commit to reading one page. Often, you'll find that once you start, you'll want to keep going. Also, try to attach the new habit to an existing one. If you already have a morning coffee routine, use that time to do a quick meditation or plan your day. Consistency is key, so even small steps count. Good luck!",
        "comment_gpt5_verbositylow_efforthigh": "Flow usually shows up after 10–20 minutes of boring focus. The “trick” is a repeatable start ritual so you don’t rely on motivation. Pick a non‑negotiable time and place, stack it onto an existing cue (coffee, commute, lunch), and define a 2‑minute gateway action that makes quitting awkward. Remove friction first (phone in another room, tabs closed, site blocker on), choose one concrete target, and run a 20–25 minute timer. After that first block you’re allowed to stop; most days you’ll keep going and hit flow.\n\nMake it daily with a tiny minimum that always counts and a “never miss twice” rule. Have a fallback slot if you miss your primary. Track inputs with a simple X on a calendar and do a short weekly reset to schedule sessions and prep your workspace. Keep tasks as next actions (“outline section 2”) not vague (“work on project”). Example: 7:30am, same desk and playlist, phone away, open doc, type one ugly paragraph, start 25‑minute timer. Start the ritual; flow follows."
      }
    },
    {
      "id": "t3_125e8y1",
      "title": "[NEED ADVICE] how do I balance work, studies and sleep?",
      "body": "I managed to land a wfh job with decent hours. Hours are roughly from 9 am - 7-8 pm. It’s insane how sleepy I feel - at 11 AM, after lunch, then again at 9 PM. How am I even alive? How do I function? I stop caring about things when I feel sleepy. \nPlease advise.",
      "comments": {
        "best_comment": "Youre working long hours. You're working 50-55h a week. Most people are going to feel sleepy from that. Some people will adapt, others wont. There is no magic formula except getting enough sleep and good nutrition",
        "percentile_10_comment": "I would advise against studying before shortly before you head to bed. It's proven that your brain doesn't retain as much information and has a hard time remembering what you read/studied. So for the 1 hour you study before heading to bed its actually like 40 minutes of studying time.",
        "comment_gpt4o": "Balancing work, studies, and sleep can definitely be a challenge, but with a few adjustments, you can make it more manageable. First, try to establish a consistent sleep schedule by going to bed and waking up at the same time every day, even on weekends. This can help regulate your body's internal clock and improve your sleep quality. Also, consider incorporating short power naps (10-20 minutes) during your breaks if possible, as they can help boost your energy levels without affecting your nighttime sleep. \n\nFor your work and study sessions, use techniques like the Pomodoro Technique, where you work for 25 minutes and then take a 5-minute break. This can help maintain your focus and prevent burnout. Lastly, pay attention to your diet and hydration; sometimes, sleepiness can be linked to what you eat or drink. Try to have balanced meals and stay hydrated throughout the day. Small changes can make a big difference, so experiment with what works best for you!",
        "comment_gpt5_verbositylow_efforthigh": "Long WFH days make dips normal, so build guardrails: a fixed sleep window, an AM study block, and planned movement/caffeine.\n\nPick a consistent sleep schedule that gives 7.5–8.5 hours and protect it with a hard stop at night. Last hour screen‑light low, room cool and dark. Wake at the same time daily, get 5–10 minutes of outdoor light and a quick movement burst right away.\n\nStudy before work while your brain is fresh. Do 45–60 focused minutes, or 25–30 if that’s all you can, then add two 10–15 minute micro‑sessions on breaks. Keep one longer session on the weekend to top up.\n\nHandle the 11 a.m./post‑lunch slump on purpose. Front‑load caffeine: one coffee at start, optional small one around 10–11, none after ~2 p.m. Eat a smaller, higher‑protein, lower‑refined‑carb lunch. Take a 10–15 minute walk immediately after eating; it blunts the crash. If possible, a 10–20 minute power nap around 1–2 p.m. helps a ton (a “napuccino” works: sip coffee, nap 15 minutes). When the 11 a.m. wave hits, stand, breathe deeply, do 2–3 minutes of brisk movement; keep your workspace bright and slightly cool.\n\nWork in cycles: 50 minutes focus, 10 minutes off your chair. Set timers to stand hourly. Keep water handy and have a protein snack around 4–5 p.m. so you’re not dragging. Close the day with a quick plan for tomorrow, then shut it down so your bedtime doesn’t drift.\n\nIf you’re still wiped after 2–3 solid weeks of this, talk to a doc about basics like iron/thyroid/sleep apnea (especially if you snore or wake unrefreshed).\n\nSystems beat willpower here: study before work, move during dips, front‑load caffeine, eat lighter at lunch, and defend your sleep window. It’s boring, but it works."
      }
    },
    {
      "id": "t3_zm4r0t",
      "title": "[need advice] I feel like I am going back to my old habits",
      "body": "So I'm(19F)  a young student and I was living alone but due to complicated reasons I had to go back to my parents house. I realised that when i was alone, i was way more disciplined and i used to bring a lot of value to time. I was working out 4x a week, I had a plan and a vision , I had a pretty good meal plan, I was healthy... \n\nNow that i'm living again with my parents and my 2 brothers i feel like i'm losing myself again. I act like when i had an ED. My screen time is enormous. I'm losing my ideas , my goals... I respect my parents but the energy of this house is so low...(people are shouting, complaining, eating bad)\n\nHow can I change my environment ? I sincerely do not want to go back to my old habits. It scares me. \n\nThank you.",
      "comments": {
        "best_comment": "It's not easy being the only motivated and disciplined person in your environment. You have to be better than who your around. It's takes dedication. Spend more time out of the house around their negative energy. It will consume you and drag yours down with it. \n\nYou don't have to fall back into it just because you're around them. BE exactly who you are even if no one likes it. You don't want to go back then don't. Only you can decide whether you go back. \n\nYour willpower and values have to be stronger than theirs. Set smalls goals first and work your way up. Easiest way to change your environment is to simply just change it. Get out, be anywhere else but there.  Hope this helps \n\nGood luck",
        "percentile_10_comment": "Probably the best advice here. Find environments outside your home to do your work, maybe a library or some place at school",
        "comment_gpt4o": "Hey there! It sounds like you're going through a tough transition, but it's great that you're aware of the changes and want to take action. Here are a few ideas that might help:\n\n1. **Create a Personal Space**: Even if it's just a corner of your room, make a space that's yours where you can focus and feel motivated. Fill it with things that inspire you, like a vision board or your workout gear.\n\n2. **Set Boundaries**: Communicate with your family about your need for some quiet time or specific hours when you need to focus. It might be tough, but setting these boundaries can help you maintain your routine.\n\n3. **Stick to a Routine**: Try to keep the same habits you had when you were living alone. Set specific times for workouts, meals, and study sessions. Consistency can help you regain that sense of discipline.\n\n4. **Limit Screen Time**: Set specific times for using your phone or computer for leisure. You can use apps to help limit your screen time if you find it hard to do on your own.\n\n5. **Find Support**: If possible, connect with friends or a community that shares your goals. Having people to talk to who understand your journey can be really motivating.\n\nRemember, it's okay to have setbacks. What's important is that you're trying to get back on track. You've done it before, and you can do it again! Good luck!",
        "comment_gpt5_verbositylow_efforthigh": "Moving home can wreck routines. You don’t need to change your family; design your bubble instead. Pick 2–3 non‑negotiables you’ll protect no matter what: daily 20–30 minutes of movement, a consistent sleep/wake, and a screen‑free first and last hour of the day. Put them on your calendar like classes.\n\nCreate a “third place” you go to most days (library, campus, gym, café). Leave the house at the same time, do your deep work and planning there, and keep home for lighter tasks. Pre‑book workouts or classes so there’s a cost to skipping.\n\nMake your room a performance zone: tidy daily, headphones/white noise for the shouting, and a simple morning/evening routine. Park your phone in another room or a drawer, use app/site blockers, and set your gym clothes and bag out the night before.\n\nFood-wise, stock a few staples you control (fruit, yogurt, oats, eggs, frozen veg, beans, etc.) and batch two simple meals each week you can reheat. Offer to cook for the family once or twice; lead by example instead of debating what they eat.\n\nHave one short, clear talk with your parents: “I’m working on a routine for school. I’ll be studying 7–9 pm and in bed at 11. Please knock if my door’s closed.” Small, specific boundaries beat arguments.\n\nTrack habits and use “never miss twice.” Do a 10‑minute nightly reset: quick tidy, lay out clothes, pack your bag, write tomorrow’s top 3 on a sticky note. Review weekly what helped or hurt and adjust one thing.\n\nIf old ED patterns start creeping back, loop in a counselor/dietitian early. That’s part of discipline, not a failure.\n\nYou already built these skills alone. Re‑building them in a tougher environment will make them bulletproof. Start with today’s tiny wins and stack from there."
      }
    },
    {
      "id": "t3_ocxh5e",
      "title": "[Need Advice] How do I manage to convince myself I’ll do something tomorrow when I have a terrible track record of actually doing a task next the next day?!",
      "body": "\nI seem to be completely unaware of my abilities and capabilities. At times I’ll convince myself I can do anything in the world, and on other times I’ll convince myself I’m a good for nothing failure. It’s crazy how I’ll start a task and be so happy to have even started the task, I’ll be like yeah see you can start a task whenever you want. With my newfound confidence, I’ll be riding that ‘high’ and end up procrastinating and that would be the end of my task for that day. Time and time again I procrastinate and hate myself for it later, but I somehow manage to convince myself to procrastinate again! It’s crazy! How do I break this loop? Should I just assume that there’s no way I’ll end up doing the task later, and hence there’s no better time than now? I’ve gotten to the point of initiating the task but I struggle to keep up the momentum. I’m really tired and I think it’s high time I break out of this seemingly never ending loop. I’ll take any suggestions I can get.",
      "comments": {
        "best_comment": "Perhaps it can help by viewing your future self as an separate entity that you can help out by doing something today. Sounds like he would be very grateful if he didn't have to go through the pain of pushing through procrastination habits again.\n\nI also like to fool myself into only asking to do a chore for a few more minutes when I want to quit, usually I stick to it a while longer",
        "percentile_10_comment": "Easy. **DON'T** say you'll do it tomorrow. Get up and do it right now. Tomorrow does not exist. It's a hypothetical period of time. As soon as \"tomorrow\" comes, it's today, and no one is guaranteed a \"tomorrow\" anyway. Do it now.",
        "comment_gpt4o": "Hey there! It sounds like you're caught in a cycle that's all too familiar to many of us. The key to breaking this loop is to start small and build consistency. Here are a few ideas that might help:\n\n1. **Set Clear, Achievable Goals**: Instead of telling yourself you'll do something tomorrow, break it down into smaller, manageable tasks. For example, if you need to write a report, set a goal to write just one paragraph today. This makes it less daunting and easier to start.\n\n2. **Create a Routine**: Try to do your tasks at the same time each day. This helps build a habit and reduces the mental energy needed to decide when to start.\n\n3. **Use a Timer**: The Pomodoro Technique can be really effective. Work for 25 minutes, then take a 5-minute break. This can help maintain focus and prevent burnout.\n\n4. **Celebrate Small Wins**: Acknowledge and reward yourself for completing even the smallest tasks. This can help reinforce positive behavior and keep you motivated.\n\n5. **Reflect and Adjust**: At the end of the day, take a moment to reflect on what worked and what didn’t. Adjust your approach as needed.\n\nRemember, it's all about progress, not perfection. Be kind to yourself and keep pushing forward. You've got this!",
        "comment_gpt5_verbositylow_efforthigh": "“Tomorrow-me” is a liar. Make that your default. If you catch yourself saying “I’ll do it later,” you have only two options: do 5–10 minutes now, or make a real appointment for it. A real appointment = a calendar block with a start time and place, an alarm, the exact first action written (“open X, type Y”), and the materials laid out beforehand. If any piece is missing, do five minutes now.\n\nTo keep momentum, work in small, finishable units with a timer. Decide “done” before you start: “outline three bullets,” “solve two problems,” “write 150 words.” Start the timer (10–25 minutes), finish that unit, then take a short break. Don’t celebrate for starting; only after finishing a unit.\n\nEnd every session with breadcrumbs so tomorrow’s entry is frictionless: write the very next action on a sticky, leave the file open at the spot you’ll continue, lay out tools, and schedule the next start time. You should be able to sit down and move your hands without thinking.\n\nReduce slippage by making procrastination harder: phone in another room, site blocker on, single full-screen window, water/snack ready.\n\nIf you want extra leverage, use light accountability: text someone “Starting at 7:30, done by 8:00 with X,” then send a quick “done” check-in.\n\nRun this for one week. You’ll teach your brain that “later” is only real when it’s on the calendar and prepped; otherwise, you do a little now."
      }
    },
    {
      "id": "t3_w8lmqp",
      "title": "[Need advice] How to clean my house properly and keep it clean all the time?",
      "body": "This is embarrassing tbh because it’s considered to be an easy task for most people. I (29F) have always neglected my house. It looks like pile of trash and clothes everywhere. I’ve tried to see YouTube videos, googled etc, but I just can’t clean properly. I don’t know why I’m like this. I can’t even have guests. I can’t understand why I’m like this.\n\nI know people think I’m just lazy but I’m not. I work, study and take long hikes very often. It’s difficult to describe the feeling I get when I think about cleaning my home. I feel defeated.",
      "comments": {
        "best_comment": "You're like that because no one has taught you how to clean. We aren't born knowing how to be tidy, we have to learn, so that's not your fault at all. Once you clean your house, It's mostly about maintaining that level through routines. I recommend unf*ck your habitat and the flylady for some simple routine building. \nTo get the house where it can be managed though, you may want to enlist some help if it's really bad. But the amount you have is finite. Can you grab a trash bag, set a 5 min timer, and fill it with visible trash? You can start by sorting laundry into one place (can be a big corner pile even) to do a load a day until it's done, and a bag of trash on a timer a day. It didn't get messy all in one day, so you won't get it clean that fast either. But by taking small steps it can get better faster than you think. Good luck!",
        "percentile_10_comment": "You seriously just described my exact situation. I feel overwhelmed with 3 generations worth of stuff, and I also feel like I need to sell everything I'm able to because I could use the money. But it is so damn overwhelming to even think about throwing away or donating, much less selling. I get so stressed I end up doing nothing, and am miserable every day due to all this stuff taking up my space. It's insanity",
        "comment_gpt4o": "Hey there! First off, don't be too hard on yourself—cleaning can be overwhelming, especially when you're juggling work, studies, and other activities. Here’s a simple approach that might help:\n\nStart small. Pick one area or room to focus on, like your bedroom or living room. Set a timer for 15-20 minutes and do what you can in that time. This makes it less daunting and helps build momentum. Once you see progress in one area, it can motivate you to tackle others.\n\nCreate a routine. Try to incorporate a few minutes of tidying up into your daily schedule. For example, spend 5 minutes each morning making your bed or clearing surfaces. Consistency is key, and over time, these small habits can make a big difference.\n\nConsider a decluttering session. Sometimes, having too much stuff can make cleaning feel impossible. Go through your things and decide what you really need or love. Donate or discard the rest. Less clutter means less to clean.\n\nLastly, don't hesitate to ask for help. Whether it's a friend or a professional cleaner, sometimes a little assistance can make a huge difference and teach you new strategies.\n\nRemember, it's about progress, not perfection. You've got this!",
        "comment_gpt5_verbositylow_efforthigh": "You’re not lazy; cleaning is a skill and a system. Treat it like training: tiny reps, same routine, low friction.\n\nPhase 1: Baseline. For the next week, run the same 15–20 minute “reset” once or twice a day. Set a timer. Start at the door and move clockwise. First pass: fill a trash bag. Second: grab a hamper and collect all dirty clothes, start a load. Third: clear and wipe one visible surface (kitchen counters or coffee table). Don’t organize or read papers—just trash, laundry, dishes. Stop when the timer ends and repeat tomorrow. If possible, a one-time pro clean or a friend’s help can jump‑start this.\n\nPhase 2: Maintenance. Create a 10–15 minute daily “home reset” at the same time every day. Do dishes and wipe counters, switch/fold/put away one laundry load, 5‑minute floor pickup, trash out if full. Pair it with a playlist and a timer. Track the streak on a calendar. Two simple rules between resets: never leave a room empty‑handed, and OHIO (Only Handle It Once) — clothes go in a hamper or on a hook, dishes go straight to sink/dishwasher.\n\nPhase 3: Weekly. Pick one 30‑minute slot for a zone: bathroom one week, floors the next, bed linens the next, dust/vac after that. Rotate.\n\nLower friction so it’s easier to win. Put a hamper in each bedroom, hooks for “wear again” clothes, a donation box by the door, and a small cleaning caddy that stays in the kitchen/bath.\n\nStart today with just this: fill one trash bag, run one load of laundry, and clear one countertop. Consistency beats marathon cleans. Give it 30 days and you’ll feel the difference."
      }
    },
    {
      "id": "t3_v5paqq",
      "title": "[NEED ADVICE] I cannot stick to exercising because I end up prioritizing other things",
      "body": "Hi! So I'm currently coursing my last year of med school and throughout my career I've tried to make exercising a habit, but sometimes I have to go to the hospital or I have long shifts of classes/practices and I end up really tired and end up losing my streak of workouts.\n\nI actually enjoy exercising! Since the pandemic started I discovered I enjoy exercising at home, so that's not really the problem. \n\nThe main problem is that sometimes I have so many things to do or I'm so tired that I justify the fact that I do not have the time or energy for exercising. It's frustrating because sometimes I've been working out for a whole month and then I have a week of exams and quizzes so I stop working out to study and then it's so hard for me to get back on track and it takes me from 2-3 weeks to start exercising again :( This has been going on for years and I have never really known what to do. \n\nAny advices would be really appreciated :-)",
      "comments": {
        "best_comment": "Do it first thing in the morning. It will give you energy for everything else.",
        "percentile_10_comment": "First thing in the morning.",
        "comment_gpt4o": "Hey there! Balancing med school and exercise is definitely a challenge, but it's great that you enjoy working out. One approach you might find helpful is to integrate shorter, more flexible workouts into your routine. Even 10-15 minutes of exercise can be effective and easier to fit into a busy schedule. Consider scheduling these mini-sessions during breaks or right after a class to make them a regular part of your day. Also, try to view exercise as a way to recharge rather than another task on your to-do list. It might help to set a non-negotiable time for exercise, just like you would for a class or meeting. Lastly, remember that it's okay to have off weeks. The key is to get back into it without guilt. Consistency over perfection! Keep at it, and good luck with your studies!",
        "comment_gpt5_verbositylow_efforthigh": "Med school is chaotic, so build a system that survives chaos. Use two gears: training and maintenance. On normal days, do your 30–45 min workout. On exam/long-shift days, do a 5–10 minute “minimum effective dose” that still counts.\n\nWrite the minimum so there’s no debate: 60s light cardio, 2 rounds of 10 squats, 5–10 pushups, 30–45s plank, quick hip flexor/cat-cow stretch. Done in 6–8 minutes. If you’re wrecked, do 2 minutes (one set of anything). Never zero days. Maintenance days count toward your streak exactly like training days; mark them M/T so you don’t feel like you “fell off.”\n\nSet simple rules and triggers. If tomorrow is an exam or you worked a 12-hour shift, auto-switch to maintenance. Do it at a consistent anchor: right when you get home before shower, immediately after waking, or right after brushing teeth. During study blocks, sprinkle micro-sets between Pomodoros (10 squats, 30s plank).\n\nPlan re-entry so it isn’t scary: the first two workouts after a heavy week are 60–70% of usual volume/intensity to avoid DOMS and resistance. Reduce friction: mat and dumbbells visible, mini band in your bag, a 10-minute playlist ready. Give yourself a “quit after 5 minutes” permission—most days you’ll keep going, and on the rough ones you still protected the habit.\n\nConsistency beats intensity. Define a floor you can hit even on call. Keep the chain alive; progress happens on the weeks you have more gas."
      }
    },
    {
      "id": "t3_xe53ud",
      "title": "[Need Advice] How to stop being extremely lazy and day dreaming, and instead focus on learning?",
      "body": "Hello, I am easily distracted in school. I am extremely lazy and would often day dream but I am extremely lazy.\n\nI have short-sightedness and would just use it as an excuse to not focus, but here's the thing. \n\nI would write down what I heard and google it, even when my vision is blurry.\n\nEXCEPT I STOPPED DOING THIS BECAUSE I'M REALLY LAZY, HOW DO I DEAL WITH MYSELF?",
      "comments": {
        "best_comment": "Since no one else is giving you serious advice… Learning is just like any good habit and it takes time to build good habits.  You need to force yourself to do things you don’t enjoy because you know that its for your own benefit anyway.\n\nForce yourself to study for 10-15 minutes at a time.  Do this multiple times a day, whether you feel like it or not.\n\nSoon the habit of studying starts to form and then you will be studying more often and it won’t seem so unpleasant after a while.\n\nBut this doesn’t happen overnight.  Building habits take time.",
        "percentile_10_comment": "I'd recommend using a pomodoro timer! 25 minutes on, 5 min break.",
        "comment_gpt4o": "Hey there! It sounds like you're aware of your challenges, which is a great first step. Here’s a simple approach to help you get back on track:\n\n1. **Set Small Goals**: Start by setting small, achievable goals for each study session. For example, aim to focus for just 10-15 minutes at a time, then take a short break. Gradually increase the time as you get more comfortable.\n\n2. **Create a Routine**: Try to establish a consistent study routine. Having a set time and place for studying can help train your brain to get into \"focus mode.\"\n\n3. **Limit Distractions**: Identify what usually distracts you and try to minimize those. This could mean studying in a quiet place, using apps to block distracting websites, or keeping your phone out of reach.\n\n4. **Use Your Short-Sightedness as a Tool**: Since you mentioned your vision, maybe use it to your advantage. Sit closer to the board or screen if possible, and use it as a reason to focus more intently on what's in front of you.\n\n5. **Reward Yourself**: Give yourself a small reward after completing a study session. This could be a snack, a short walk, or a few minutes of a favorite activity.\n\nRemember, building discipline takes time, so be patient with yourself. Good luck!",
        "comment_gpt5_verbositylow_efforthigh": "Treat this like a systems problem, not a personality flaw.\n\nFirst, remove the vision excuse: update your prescription if you can, sit in the front, and ask for slides/printouts. Make seeing the material easy.\n\nThen make class autopilot. Start-of-class ritual every time: phone on Do Not Disturb in your bag, open notebook, write the date and one simple goal—capture the main idea, one unfamiliar term, and one question. If you catch yourself daydreaming, don’t spiral—put a small tally in the margin and write the last phrase you just heard. That “catch-and-return” resets focus fast.\n\nStop Googling mid-class. Schedule a 10-minute lookup block right after class to define terms and clean up notes. One timer, one tab, then you’re done.\n\nUse the 2-minute rule on low-motivation days: do the ritual for two minutes—open notebook, write the header, capture one idea. Let momentum carry you if it wants. Track a 10-class streak of just doing this ritual and reward yourself when you finish it.\n\nYou already proved you can work through blurry vision; this just makes it structured and easier to repeat. Make the right actions easier and the wrong ones harder, consistently."
      }
    },
    {
      "id": "t3_xr9mbt",
      "title": "[Need advice] How to develop study habits? Planing to go back to school after decades.",
      "body": "I plan to go back to school after decade. I need a career change, because my current job is just not it anymore. I've been out of school for so long, I don't know how to study anymore. I have one year untill I start and would like to start practicing \"studying\" now so I don't get burned out in the first semester.\n\nAny tips?",
      "comments": {
        "best_comment": "Read Deep Work by Cal Newport. Great book on how to study. Borrow from the library. Worth buying as well. Or download free pdf from pdfdrive dot net.",
        "percentile_10_comment": "I know it seems pretty obvious, but for me, studying two weeks ahead really helps in the long run. When you are ahead, you can afford to take breaks, be sick or whatever, without getting left behind by the piles of homework. And if you are behind, catch up!!! I have made that mistake before, and i was so behind that it was impossible to catch up, because i kept delaying it. And because of that, i had to restart my programme.\nBest of luck!",
        "comment_gpt4o": "Going back to school after a long break can be daunting, but it's great that you're planning ahead! Start by setting a consistent study schedule, even if it's just an hour a day. This will help you build the habit gradually. Try using the Pomodoro Technique—study for 25 minutes, then take a 5-minute break. It can help maintain focus and prevent burnout. Also, explore different study methods like active recall and spaced repetition to see what works best for you. Lastly, consider joining study groups or online forums related to your field of study to stay motivated and engaged. You've got a year to prepare, so take it step by step, and you'll be ready when classes start!",
        "comment_gpt5_verbositylow_efforthigh": "Love that you’re giving yourself a year. Treat it like a preseason: rebuild focus, learn the techniques, then simulate a semester.\n\nMonth 1: practice sitting down. Pick a consistent cue (e.g., after breakfast), clear your desk, put your phone in another room, set a 25-minute timer, study anything, then write a 3–5 sentence summary from memory. Do this daily, even if it’s just one block. Log minutes, not perfection.\n\nLearn the core methods now so they’re automatic later. Use active recall (close the book and explain the idea in your own words), spaced repetition (Anki for 10–15 minutes a day), and practice problems over rereading. Cornell notes or the Feynman technique will keep you honest. If you want a quick primer, check out “Learning How to Learn” and “Make It Stick.”\n\nMonths 2–3: ramp to 2 x 45–60 minute blocks, four days a week, plus a 30-minute weekly review to plan the next week. Keep one full rest day. Every 6–8 weeks, take a light “deload” week at 50–60% volume to prevent burnout.\n\nMonths 4–6: simulate a mini-semester. Pick one or two free MOOCs or a textbook relevant to your program. Make a simple syllabus with start/end dates, weekly readings, and two self-tests (midterm/final) under timed conditions. Treat your calendar as non-negotiable.\n\nMonths 7–9: scale to 3 blocks on study days and add a writing block. Practice closed-book, timed quizzes. Join a forum, Discord, or study buddy for accountability.\n\nMonths 10–12: prep for your actual program. Brush up math/writing basics, read the first chapter or two of core courses, set up your system (calendar, task manager, note template, citation tool). Aim to arrive with your workflow ready, not just your knowledge.\n\nGuardrails: 7–8 hours of sleep, some movement most days, sunlight, protein and water. If you miss, do a 10-minute “minimum viable session” and keep the chain. If you feel overloaded, cut volume by 20% next week, don’t quit.\n\nSimple daily template: 15 min Anki, 50–60 min deep block, 10 min break, repeat once, 5 min log and plan the next step. That’s enough to rebuild the muscle. You’ve got this."
      }
    },
    {
      "id": "t3_rnpw4g",
      "title": "[Need Advice] How do I overcome complacency?",
      "body": "Complacency for me is staying at the same area I am at, no matter if I am already good at this area. I want to grow in life, but in more areas than not, I feel like I am complacent and also procrastinate on achieving my goals and dreams. \n\nFor this discussion, I would like some advice on how to overcome complacency and apathy in life, how do I make sure I am continually growing, and how do I continually get out of my comfort zone?",
      "comments": {
        "best_comment": "I agree with you. One of the reasons I have for getting out of my comfort zone is to not waste my life being mediocre and to really have a positive impact on the world. A lot of people have a midlife crisis because they are being complacent. I have other reasons too, but this is one of them.",
        "percentile_10_comment": "Why do you want to keep growing and get out of your comfort zone? This might seem like a strange question to ask, but different people will want this for different reasons. If you really want this then it can be extremely helpful to know why, exactly, you want it.",
        "comment_gpt4o": "Hey there! It sounds like you're ready to shake things up and push past that comfort zone. Here are a few ideas that might help:\n\n1. **Set Clear, Specific Goals**: Instead of vague goals like \"I want to grow,\" try setting specific, measurable goals. For example, \"I want to learn a new skill, like coding, and complete an online course in three months.\" This gives you a clear target to aim for.\n\n2. **Break It Down**: Big goals can be overwhelming, so break them into smaller, manageable tasks. This makes it easier to start and gives you a sense of accomplishment as you complete each step.\n\n3. **Create a Routine**: Discipline often comes from routine. Set aside specific times each day or week dedicated to working on your goals. Consistency is key.\n\n4. **Accountability**: Share your goals with a friend or join a community with similar interests. Having someone to check in with can keep you motivated and accountable.\n\n5. **Reflect and Adjust**: Regularly take time to reflect on your progress. What's working? What's not? Be open to adjusting your approach if needed.\n\n6. **Celebrate Small Wins**: Don't wait until you've achieved the big goal to celebrate. Acknowledge and reward yourself for the small victories along the way.\n\nRemember, growth often happens outside of your comfort zone, so embrace the discomfort as a sign that you're moving in the right direction. Good luck!",
        "comment_gpt5_verbositylow_efforthigh": "Complacency fades when you install a system of small, scheduled stretch with feedback and stakes. Try this for the next 30–60 days.\n\nPick one area to grow first (two max). Name the skill and set a lead metric you control: number of deliberate sessions per week. Schedule those blocks at the same time each day and protect them with Focus mode/Do Not Disturb. Make the floor tiny: even on bad days you do 10–15 minutes. Use a timer. Consistency over intensity.\n\nDo one “discomfort rep” before noon, every day. Aim for a 4–6/10 in discomfort (stretch, not panic). Examples: ask for feedback, speak up once in a meeting, add 5% weight, send a pitch/application, post a draft publicly, 30s cold finish, read 5 pages of a dense book. Keep a running list and tick one off daily.\n\nTrack it visibly. Use a wall calendar or habit app with two checks: skill block? y/n; discomfort rep? y/n. On Sunday, do a 20-minute review: What did I complete? Where did I hide in comfort? What’s one tweak for next week? If you missed twice, shrink the target; if you hit 80%+, raise the floor slightly (add 5 minutes, an extra set, or a harder rep). Never miss twice.\n\nAdd finish lines and stakes. Commit to one monthly output tied to the skill (article, mini-project, portfolio piece, 5k attempt). Tell a friend or group and send proof on a set date. Light money accountability (StickK/Beeminder or a simple bet) helps.\n\nMake comfort the hard path. Phone in another room during the block, sites blocked, clothes/tools laid out, a clear start cue: “When it’s 7:30, I start the 25-minute block at my desk with headphones.” Join a group where the behavior is normal; their baseline becomes yours.\n\nMantra: raise the floor, not the ceiling. Small daily reps + one deliberate stretch each day + weekly review/adjustment = continuous growth without burnout."
      }
    },
    {
      "id": "t3_u0xcin",
      "title": "[Need Advice] 23 year old female with a 6 figure software engineer job. Just bought a condo. New at my job and fortunately that let's me get away with barely doing any work but ... getting increasingly nervous that I can't perform.",
      "body": "First thing first. Imposter syndrome is kicking my ass. I remind myself constantly that it's okay not know how to do things and ask a lot of questions, but I need so much hand holding. I feel so much panic. \n\nOn top of that, I'm dealing with learning how to be a better person, friend and partner. And I have a place I'm getting in order. I get bursts of motivation but I feel like I am procrastinating so often. I know they're going to realize I am not doing shit and I am worried about my job. \n\nI used to be able to sit for hours and study math or make art. Maybe because I felt good at it? But I could figure things out and perfect things for so long but my patience and tolerance feels like it is at a 0. Any book recommendations? I want to feel good at what I do and put the work in. I just... don't know what to do. And the good therapist I finally found after many shitty ones has ghosted me and I don't want to go through the process again. I feel like I'm so close to an amazing life with a job that gives me freedom to do other things. But I feel like I'm drowning and I'm so unconfident in my job. I feel like I'll lose it and will be stripping again. Sometimes I fantasize about that because I am good at it and I feel in control there.",
      "comments": {
        "best_comment": "Congrulations for your Job! In my opinion small daily routines  gives best outcome. Waiting for inspiration, motivation  boom  generally not sustainable. I am also a software developer sometimes I cant help myself and giving up my tasks. But when i start daily fixed routine  i feel more organized and productive. I told my self first thing in the morning do some coding job Just for 5 minutes if dont like you can give up. I did this every day now i feel more productive. I can suggest meditation. It clears mind and atomic habits book.",
        "percentile_10_comment": "As a 25 year old who's already studying for quite some time with a new job as ABAP developer I know exactly what it feels like. I'm scared of failing exams, imposter syndrome at work.\n\nSince i'm working fully remote they cannot really track my working time nor progress. I'm not really getting my work done in a appropriate time...\n\nBut... I noticed that if I have any appointment (Uni, work, friends, sports) i'm much more reliable.\n\nMaybe it is a good idea to find someone to have a work-meeting with for set times. So you see eachother working and can casually talk with about problems (and all software engineers know... we have A LOT of problems). I don't even mean a colleague from work. Just anyone! Maybe that is going to help you as well? :)",
        "comment_gpt4o": "Hey there! First off, congrats on the new job and condo—those are huge achievements! It sounds like you're juggling a lot, and it's totally normal to feel overwhelmed. Imposter syndrome is a tough beast, but remember, everyone starts somewhere, and asking questions is a sign of strength, not weakness.\n\nTo tackle the work anxiety, try setting small, achievable goals each day. This can help build confidence and show progress. Also, consider pairing up with a mentor or a more experienced colleague who can guide you through the learning curve. They can offer insights and reassurance that you're on the right track.\n\nFor your personal life, it might help to schedule regular check-ins with yourself. Reflect on what you want to improve and set realistic steps to get there. It’s okay to take it one day at a time.\n\nAs for book recommendations, \"Atomic Habits\" by James Clear is a great read on building habits and discipline. It might give you some practical strategies to regain that focus and patience you mentioned.\n\nLastly, don't give up on finding a therapist. It can be frustrating, but having someone to talk to can make a big difference. You're doing great, and it's clear you're committed to making positive changes. Keep pushing forward, and remember, it's okay to lean on others for support. You've got this!",
        "comment_gpt5_verbositylow_efforthigh": "Totally normal for a new SWE to feel lost for a while. You don’t need to be brilliant right now; you need a simple system that produces visible progress.\n\nSet up a 30/60/90 with your manager this week. Script: “I want to ramp faster and make sure I’m focused on the right things. Could we agree on a 30/60/90 plan and do a 15‑min weekly check‑in? For the next two weeks I propose: solidify local env, close 2–3 small bugs, and document what I learn. Does that align with priorities?”\n\nRun a tight daily routine at work: one deep-focus block first thing (no Slack, phone away), then a second block after lunch. Aim to ship small and often—one tiny PR a day or every other day beats big perfect PRs. Keep a work log: Today I will…, Blockers…, What I shipped…, What I learned… and send a short weekly update to your manager. That alone lowers “imposter” anxiety.\n\nAsk for help like a senior: include context, what you tried, logs/screenshots, your guess, and a clear question. Use a 20‑minute rule—try solo for 20, then ask. Batch questions for 11 and 3, or book 15‑min “office hours” with a teammate. Pair once or twice a week. Start a “learning doc” and turn it into team docs; teaching what you learned builds credibility fast.\n\nRebuild focus stamina, don’t expect it. Start with two 25‑min Pomodoros, grow to 2×60–90 over a few weeks. Use blockers for distracting sites. When you’re avoiding, commit to five minutes; momentum usually carries you.\n\nKeep life simple with a minimum viable routine: 10‑minute tidy after work, 30 minutes of movement, a short daily check‑in with your partner or a friend, and a 45‑minute weekly reset to plan and reset the condo. That’s enough to feel in control without draining willpower.\n\nBooks: Deep Work (Newport) for focus, The First 90 Days (Watkins) for ramping into a new role, Atomic Habits (Clear) for consistency. If anxiety is driving procrastination, Feeling Good (Burns) is a solid CBT workbook.\n\nIf your therapist ghosted you, consider two quick 15‑min consults in one afternoon and pick the best fit, or use your company’s EAP for a short-term bridge. Low friction, high payoff.\n\nYou’re closer than you think. Ship small things, make progress visible, batch help, and protect two focus blocks a day. Do that for four weeks and your confidence will catch up to your reality."
      }
    },
    {
      "id": "t3_rygxb9",
      "title": "[Need Advice] How do I un-fuck my life?",
      "body": "So I'm 18, no job, and I kinda fucked up my college life. I haven't done a single thing for the first semester of college and now my second semester is coming up in a few days, and now one of my scholarship funding sources are asking for my grades. WHAT DO I DO?!\n\nYou might be wondering how this happened...well...\n\nI have a severe hentai addiction. I've gotten into this terrible procrastination routine where I pleasure myself, then play a video game, then eat, then sleep, pleasure myself some more, then repeat that cycle the next day. My question is, how do I stop? I've tried P0rn blockers, but because how easy it was to turn off the blocker to watch my \"content\", I built a habit of disabling the blocker before going onto my computer, rendering it worthless.\n\nAnother problem is whenever I work myself up to not watching the content, my day filled up with other distractions like video games.\n\nEven when I had a day with absolutely zero distractions, no games, no h3ntai, and the perfect working environment, I had this odd habit to walk out of my room and around the kitchen, maybe grab a snack, or I would just go to sleep. I don't understand why I do this. For the work environment, I do use a basic kitchen chair, which I'm not sure if that has something to do with it as they're not designed to sit at a computer desk for hours.\n\nNow back to my college stuff. I can slowly work on self-improving and my procrastination later (ik that sounds counterintuitive), but seriously, I don't know what to say to my dad. I can't just say \"I didn't do a single one of my assignments and I basically scrapped my entire first semester\", and I most certainly can't say that to one of my primary sources of scholarships. What tf do I do? On top of that, I have severe social anxiety. Many of the comments are gonna say \"just do it\", but it doesn't work like that.\n\nFor stopping my procrastination, I'm getting a little into Atomic Habits, but I've even found myself procrastinating in my anti-procrastination. Could I get some strong advice for someone who has suffered through a strong addiction of some sort?\n\nEdit: Should I skip this second semester entirely to fix myself before I get back to college? ",
      "comments": {
        "best_comment": "I do a LOT better if I study on campus in the library, rather than at home around my home computer. It’s so hard to work at the place I also play games (and more lol).",
        "percentile_10_comment": "Sounds like you could have ADHD.",
        "comment_gpt4o": "Hey there! First off, it's great that you're reaching out for advice—recognizing the need for change is a big first step. Let's tackle this one step at a time.\n\nFor your college situation, honesty is usually the best policy. It might be tough, but consider having a candid conversation with your dad and the scholarship committee. Explain that you struggled with the transition and are actively working on improving. They might appreciate your honesty and determination to do better.\n\nRegarding your habits, it sounds like you're caught in a cycle that's hard to break. Since blockers haven't worked, try changing your environment. If possible, study in a library or a café where distractions are minimized. Also, set small, achievable goals for each day. Instead of thinking about the entire semester, focus on completing one assignment or studying for one hour. Celebrate these small wins to build momentum.\n\nFor the social anxiety, consider reaching out to your college's counseling services. They can offer support and strategies to manage anxiety, which might help you feel more comfortable tackling these conversations and responsibilities.\n\nLastly, about skipping the semester, weigh the pros and cons. If you think taking a break will help you reset and come back stronger, it might be worth considering. But if you feel you can manage with some adjustments, maybe try to push through with a lighter course load.\n\nRemember, change takes time, and it's okay to ask for help along the way. You've got this!",
        "comment_gpt5_verbositylow_efforthigh": "First, triage the school/aid piece. You can’t hide the grades, so be proactive. Email your academic advisor and financial aid today: “I blew my first semester and want to fix it. What are my options (probation, reduced load, or a leave)? How does this affect my scholarship, and is there an appeal/probation path?” Then email the scholarship contact with the same honesty + a brief plan. The earlier you ask, the more options you’ll get.\n\nTell your dad, but lead with the plan, not the problem: “I failed this semester. I’m taking responsibility. Here’s what I’m doing starting today: removing my gaming rig, locking down devices, meeting counseling, and setting a daily study schedule. I’d like you to hold the passcodes and check in weekly.”\n\nOn the porn/gaming loop: blockers fail when you’re the admin. Remove your control. Have a trusted person set Screen Time/Family Link/app-blocker passcodes you don’t know, and lock filtering at the router/DNS level. Move the gaming PC/console out of your room or store it elsewhere. Use a cheap, locked-down laptop/Chromebook for school only. Do work at the library or a public space—environment beats willpower.\n\nReplace, don’t just remove. Daily anchors: fixed wake time, shower, 10-minute walk outside, then one 25-minute study sprint in a public spot. Use the 5-minute rule: open the assignment and do the tiniest next step for five minutes. When you feel the urge to wander/snack, write the next action, start a timer, and keep water/protein at the desk so the kitchen isn’t an escape. Sleep 7–9 hours; no devices in bed.\n\nGet support. Book campus counseling this week and ask about groups for compulsive behaviors and social anxiety. Consider r/pornfree/NoFap/SMART Recovery. Ask your dad (or a friend) to hold the blocker passwords and do a 10-minute weekly review.\n\nShould you skip the second semester? Decide with your advisor. If you take time off, make it structured (job, counseling, set study blocks, re-enroll date). Otherwise, consider a reduced load with all the safeguards above.\n\nDo these today: send the two emails, move the gaming rig out, set up locked filters with someone else holding the codes, pick a library seat, do one 25-minute block, and book counseling. Momentum first, perfection never."
      }
    },
    {
      "id": "t3_p89z6k",
      "title": "[Need Advice] Why do I find myself going on social media overdrive after a long hard day of work?",
      "body": "After completing 16 solid hours of productive analytical work, instead of hitting the sack, I go into manic scrolling mode.. Instagram, TikTok, Facebook, Reddit, becoming increasingly awake and energetic till 2am, effectively ruining my next day. \n\nWhy is this happening ? How can I stop this?\n\nUpdate: Thank you for insightful comments and great recommendations! I am super grateful for the effort that you guys have put in your replies. I’ve learnt new perspectives from every single comment. This is awesome. Thank you once again 🥰\n\nTo summarize \n\n1) Go on dopamine fasting. Rewire my brain to get used to lower doses of dopamine hit. Swear off social media\n\n2) Replace downtime with something constructive, that I can grow over time. Be deliberate about what the replacement activities are before going on dopamine fast. Examples of replacement activities are reading, journaling, exercising, learning a new language, trying to make art…\n\n3) Examine what is causing me to get into social media apps, beyond the dopamine factor. Social media is not my support network. Few books mentioned are Wilpower instinct, Atomic habits, Digital Minimization, the Molecule of more \n\n4) Out of sight out of mind. Keep the phone away, set limits on usage, put on grey mode, tell my brain that I am not missing out anything. Love this quote \"If it's not what you want, are you really sacrificing anything by not doing it?\"",
      "comments": {
        "best_comment": "It is called Revenge Procrastination. Your body (and the body part of your mind, some call it the subconscious) has an idea about a certain amount of free undisciplined time they are owed every day. Once you get your work hours in, try and plan your undisciplined time ahead and stick to it. For eg. I cook a great meal and eat it. That seems to calm things down and it is a win in terms of health and getting my mind ready for the next day. Or you can watch a good movie. Select the movie ahead of time and don't sit in front of Netflix and hit the remote - Netflix algorithms are tuned to push you into long-running and addictive TV series, next thing you know you will be sitting there and it is past 3 am. Workouts are a great way to relax, but the body-mind knows that this is a sort of discipline and often doesn't get the same amount of relaxation points as say a movie or a dinner. If you think you can skip this and get another extra 3 hours out of your day - you will be mistaken and this will be reflected in the next day's productivity which will be not as much as today, even if you sitting at the desk the work might not be in peak mental performance. TLDR: Take breaks, relax. But more importantly, PLAN the break time and the type of relaxation activity you will be indulging in.",
        "percentile_10_comment": "I’m pretty sure the quote they are referring to is the explanation given in the documentary ‘A Social Dilemma’. In it, they do explain the effects of social media scrolling and how it’s akin to slot machines. \n\nHere’s a partial explanation by Tristan Harris, an ex-employee for Google who worked as a design ethicist, and is one of the drivers of the documentary:\n\n\n“Each time you’re swiping down, it’s like a slot machine,” he says. “You don’t know what’s coming next. Sometimes it’s a beautiful photo. Sometimes it’s just an ad.” What slot machines and social media share are variable rewards.\n\nThis feeds into the ‘pull to refresh’ function. Every time we pull down to refresh our timeline—whether that’s on Facebook, Twitter or even by email—we don’t know what we’ll discover. That could be a new email from work, lots of surprising ‘likes’ or even disappointment should there be nothing fresh to excite us. The downward-pull action, created by designer Loren Brichter, has been emulated across many different apps, and its ubiquity has become intuitive for its users. Being drawn into what’s called ‘ludic loops’—where a user is unsure whether they’ll receive feedback (or in the case of a slot machine, cash rewards) following anticipation—is what keeps us hooked. Or, as Harris says: pulling the lever.”\n\nLink: https://www.we-heart.com/2019/09/04/social-media-and-the-slot-machine/\n\nThere’s a wide range of sources online that compare the striking physiological similarities between the rush you feel from slot machines and the rush you feel from scrolling and refreshing your social media. According to the documentary, it was built this way on purpose. \n\nAs always take these things with a grain is salt, however the documentary is definitely interesting!",
        "comment_gpt4o": "It sounds like you're experiencing a classic case of needing to unwind after a long day, but the way you're doing it is actually counterproductive. After such intense work, your brain craves a break, and social media offers quick, easy dopamine hits. The problem is, it can become a cycle that disrupts your sleep and productivity. \n\nTo break this habit, try setting a specific time limit for social media use in the evening, maybe 30 minutes, and stick to it. Use apps that can help you enforce these limits. Also, consider creating a relaxing bedtime routine that doesn't involve screens—like reading a book, meditating, or listening to calming music. This can help signal to your brain that it's time to wind down. \n\nRemember, it's about finding balance. You don't have to cut out social media entirely, but being mindful of how and when you use it can make a big difference. Good luck!",
        "comment_gpt5_verbositylow_efforthigh": "Classic revenge bedtime procrastination + “wired but tired.” After a long, high-control day your brain craves novelty/autonomy, and bright, infinite-scroll apps spike arousal so you feel more awake, not less.\n\nYour summary is solid. Turn it into a system that decides for you before you’re tired. Pick a hard stop and a shutdown ritual at the same time every night: write tomorrow’s top 3, tidy desk, set clothes, quick stretch or shower, lights dim. When shutdown ends, bed-only rule starts.\n\nEngineer friction so the default is sleep. Charge the phone outside the bedroom and use a cheap alarm clock. Block social 9:30pm–6am (Freedom/Cold Turkey/FocusMe or Screen Time with a passcode someone else holds). Add One Sec-style delays and grayscale. Remove the worst apps from your phone; if you must, allow them only on desktop at a scheduled time.\n\nGive yourself a planned decompression that scratches the itch earlier: 20–30 min of a book, podcast with the screen off, a walk, light lift, sketching, shower. If you want social, do a timed 15–20 min window before the curfew, then devices go away.\n\nLower arousal: no caffeine after ~2pm, brief walk after work, hot shower, low light, cool room. If you slip, use a bright-line: the moment I open social after curfew, I put the phone down and get in bed. Track nights you hit the cutoff; aim for 5 in a row.\n\nIf 16-hour days are frequent, the scrolling is a pressure valve. Reduce the load where you can—the easiest way to kill a 2am scroll is to make sleep the only option available. You’ve got the insights; let your environment do the heavy lifting."
      }
    },
    {
      "id": "t3_zs03uo",
      "title": "[Need Advice] I still live with my mom at 26. I have been trying to earn my independence but I feel like I’m on a treadmill. What do I need to change?",
      "body": "I (26f) still live with my mother (57f). I’m working on becoming independent but I’m doing something wrong because it’s not getting me anywhere. What is my problem? \n\nI’m so ashamed of how behind I am in life and how immature and dependent I am. I live at home, work part time (work reduced my hours), am taking one class at a local college (all I can pay for), and am applying for more part time work at other places. I live in Cleveland, so the rent is super high but still not cheap. I pay my mom 500 a month but that is it. \n\nMy mom doesn’t work herself but does get alimony from her ex, my father (they split up 10 years ago, and we are pretty estranged), and her parents (my grandparents, who I am also not close to because they are devout Jehovah witnesses) pay for her/our rent. The $500 I pay actually covers rent for this big store front-turned-storage-unit with a bunch of stuff from our old house that my mom intends to sell but it’s been many many years (10+).\n\nI also obviously pay for any personal things like my clothes/money to go out. I also paid my tuition for one class at a local college. she still pays for my groceries and phone. I’m so embarrassed. \n\nShe doesn’t want me to move out because she says I’m incapable of functioning and I’m trying to prove both of us wrong. I do housework, try to clean up after both of us, help her whenever I can, but I’m still basically a child and I hate myself for being so behind. \n\nI’m grateful, don’t get me wrong, but I’m incredibly ashamed of what it says about me that I am where I am in life.\n\nWhat am I doing wrong? Should I quit school? Should I just try to find better/more work? Or is it stupid to work shitty jobs without a degree. Should I get independence or a degree first?",
      "comments": {
        "best_comment": "I think you would experience less day-to-day stress if you simply let go of the narrative that you need to have it all figured out by now. You’re doing great. Just keep doing your best at whatever you set your mind to and maintain a growth mindset. You are already enough. Work on building healthy boundaries with your family, you might be taking on inherited generational trauma. Keep displaying the courage it takes to be vulnerable, like you did by sharing your story, and it will inspire those around you to do the same. Remember, you don’t need to set yourself on fire to keep others warm!",
        "percentile_10_comment": "I would get a job in construction. It's full-time, pays decent, and if you want to continue taking 1-3 evening college courses to work toward something, you can.\n\nYou can probably find a roommate for the same $500 you pay your mom.\n\nShe sounds toxic by telling you that you can't function without her - you can. If you are interested in any construction careers from concrete to carpentry to electrical, shoot me a PM and I can try to give advice if you're interested. I think beyond warehouse work, it's one of the fastest ways to a decent paying career with upward wage growth (apprenticeships, etc). Even drywall work is typically full-time work and good pay. The other fast track to decent income is sales work, but I think it's harder to find the right opportunity, and not everyone is suited for sales work.\n\nConstruction gets you pretty disciplined, you have to show up on the jobsites early, most work starts at 7am, sometimes 6am, you finish at a respectable time, usually 3:30pm or sometimes you work later, you work a physical job in all weather conditions, you learn skills, work with your hands, and it helps self-confidence in almost everyone who starts.",
        "comment_gpt4o": "Hey there! First off, don't be too hard on yourself. Everyone's journey is different, and it's great that you're actively seeking ways to improve your situation. Here are a few thoughts that might help:\n\n1. **Job Situation**: Since your hours were reduced, it's smart that you're looking for additional part-time work. Keep applying and consider jobs that might offer more hours or better pay. Even if they're not in your ideal field, they can help you save up and gain more independence.\n\n2. **Education**: If you can manage it financially and time-wise, continuing with your class is a good idea. Education can open doors, but it doesn't have to be a full-time commitment right now. Maybe look into online courses or certifications that are affordable and can boost your skills.\n\n3. **Budgeting**: Try to track your expenses and see if there are areas where you can save more. Every little bit helps when you're working towards moving out.\n\n4. **Communication with Your Mom**: It might be helpful to have an open conversation with your mom about your goals and how she can support you in becoming more independent. Maybe there's a way to gradually take on more responsibilities that can help prove your capability.\n\n5. **Self-Compassion**: Remember, you're not alone in feeling this way, and it's okay to be where you are. Focus on small, consistent steps towards your goals, and celebrate the progress you make along the way.\n\nKeep pushing forward, and don't hesitate to reach out for support when you need it. You've got this!",
        "comment_gpt5_verbositylow_efforthigh": "You’re not broken; you’re juggling competing goals. Make “independence first, degree second” your plan. For the next 12 weeks, go all‑in on stable full‑time income, taking over your own bills, and building a small emergency fund. School can pause for a semester if it slows that down; finishing a degree is easier once you’re stable or using employer tuition.\n\nTreat job hunting like a job: set daily hours, track applications, and follow up. Hit staffing agencies and OhioMeansJobs, and apply broadly to entry‑level roles with benefits: hospitals (Cleveland Clinic/University Hospitals/MetroHealth), logistics (UPS/Amazon/FedEx), customer service (Progressive/KeyBank), property management, security, manufacturing. If your current place cut hours, assume you need a different employer; nights/weekends for a second income stream are fine for a sprint.\n\nFix cash flow now. Take over your phone and groceries by a specific date to build the muscle. Aim to save $1–2k fast. Have a calm, firm conversation about the $500 going to the storage unit; set a deadline to help sell/donate and close it, and stop funding it after that date. That money should go to your bills and savings. If she insists on keeping it, she funds it.\n\nBuild a simple daily routine: fixed wake time; every day do three things—make money (shift or applications), maintain life (20–30 minutes cleaning and a short workout/walk), and move forward one inch (skill study like typing, Excel, or a quick certification). Weekly, review progress and set next week’s targets.\n\nOnce you’ve got full‑time work, file FAFSA (you’re independent at 26) and look for employer tuition reimbursement. Cleveland employers, especially hospitals, often help pay for school. Consider short, high‑ROI credentials through Tri‑C (STNA, phlebotomy, unit secretary, IT help desk) that can raise your wage quickly while you keep studying part‑time.\n\nSet a realistic move‑out target (room in a shared place first) and save for deposit and basics. Share your plan with your mom as an update, not a debate: “I’m taking over my bills by X, saving Y, and moving out by Z.”\n\nYou’re not late. Ninety focused days of this will change your trajectory. Today: update resume, send 5 applications, 30‑minute walk, and one concrete step toward ending that storage drain. Repeat tomorrow."
      }
    },
    {
      "id": "t3_x6698s",
      "title": "[Need advice] How to to get rid of racist thoughts",
      "body": "Like the title says I’m very judgemental and racist. Eg: I’ll see a video on social media of a group of people doing something bad, first thing ill think to myself is stuff like “of course they are all (insert race)” or thats a very (race) thing to do. Also when I see protests or people defending a certain race I’ll think of reasons why they’re actually bad and discredit the protesters. I’m not vocal about it and have never told or posted my thoughts to anyone but I know its terrible and need to stop",
      "comments": {
        "best_comment": "I don't remember where I read this, but here's some insight from an internet stranger:\n\nThe thoughts/opinions that best define you're character/personality  aren't your very first thoughts on a subject, but your second ones.\n\nThe first opinions that come to your mind are usually snap judgements that involve little thought and so they tend to reflect close associations your brain has made, aka biases(even if they might not be logical), and so they are mostly determined by the environment you were raised in.\n\nOn the other hand, the second opinions you form about a subject require you to put in some more thought into it, which forces you to be more rational in your judgement, because you can apply you're reasoning skills now.\n\nTherefore, your second thoughts on a subject are a much better reflection of character because they reveal how rational you are, and how much you let your own biases influence you.\n\nIf you are already recognizing that you're initial reactions around poc are irrational and caused by your personal bias against them, then you are already going in the right direction.\n\nGood luck with your problem, and remember, everyone has their own biases, what's important is that you don't let them override your reason. Biases are just mental hurdles meant to be overcome.",
        "percentile_10_comment": "I had to tell my ex to STOP visiting horrible sites that were so anti-women, red-Pill-ish in nature. His horrible pre-judgements of women were disgusting. How I didn’t see it prior to dating shocks me. Needless to say, he still secretly consumed it like porn, and our relationship failed. Crazy. He was addicted to it. I wish I could remember what it was. It was a meme site generator with HORRIBLE, degrading comments. ifunny?",
        "comment_gpt4o": "It's great that you're recognizing these thoughts and want to change. Here are a few steps that might help you work on this:\n\n1. **Educate Yourself**: Start by learning more about the cultures and histories of the groups you find yourself judging. Understanding the context and experiences of others can help break down stereotypes.\n\n2. **Challenge Your Thoughts**: When you catch yourself having a racist thought, pause and question it. Ask yourself why you think that way and if it's based on facts or assumptions. Over time, this can help rewire your thinking.\n\n3. **Diversify Your Feed**: Follow people from different backgrounds on social media. Exposure to diverse perspectives can help you see the world through different lenses and reduce biases.\n\n4. **Practice Empathy**: Try to put yourself in the shoes of those you judge. Consider their experiences and challenges. This can foster a more compassionate outlook.\n\n5. **Seek Conversations**: Engage in discussions with people from different backgrounds. Listening to their stories and perspectives can be eye-opening and help you grow.\n\nRemember, change takes time and effort, but acknowledging the problem is a huge first step. Keep at it, and don't be too hard on yourself as you work through this.",
        "comment_gpt5_verbositylow_efforthigh": "Treat this like breaking any habit. You can’t always control the first thought, but you can train the second one.\n\nMake an if-then plan: “If I see an inflammatory clip or a protest post, then I pause for 10 seconds, say to myself, ‘These are individuals, not a race. What’s a non‑racial explanation?’ and either scroll past or look for credible context.”\n\nDo a quick counter-stereotype rep each time you catch it: bring to mind two counterexamples from that group or two alternative explanations (poverty, age, location, incentives, editing). It’s 30 seconds, but it rewires the association over time.\n\nChange your inputs. Unfollow outrage/fail accounts, mute keywords, add time limits, remove feeds from your phone, and replace with long‑form reporting or creators from varied backgrounds doing normal, everyday stuff. Outrage clips are cherry‑picked; don’t let algorithms train your brain.\n\nTrack it. Keep a simple tally: trigger, replacement line used, moved on or not. Review weekly and aim for more catches and less rumination time. Treat slips as reps, not failures.\n\nGet real contact. Join a class/club or volunteer where you collaborate with people from different backgrounds once a week. Repeated, positive interaction collapses stereotypes faster than anything online.\n\nDo 5 minutes of mindfulness daily to notice thoughts and let them pass. And audit your language: ban “always/they are X,” force “some individuals in this clip did Y.”\n\nRun this for 30 days. Consistency beats intensity, and the thought will show up less and feel weaker."
      }
    },
    {
      "id": "t3_uu5woe",
      "title": "[Need Advice] I’m a 29-year-old male that has wasted 16 years of my life in video games, escapism, alcohol, and marijuana use, and feel so behind, I don’t know where to start.",
      "body": "I spent so many years of my life doing the bare minimum when it came to developing my life that I’m almost 30 and have nothing to show for myself. I feel like I’m still a lazy 16-year-old trapped in a 29-year-old body, and that’s the equivalent of how my intelligence feels sometimes, even though I’m for sure smarter than that. On top of that, I’ve relied on those around me to fill in the gaps in my finances as I worked entry-level jobs at minimum wage so I can masquerade as working hard for my future just to have zero control of my finances because I had terrible spending habits (I say had because I’m actively working on myself every day and over time have been making big progress). I suffer from depression because of the weight in which I judge myself. The only really great thing going for me right now is that I lost \\~100lbs since last summer, and I barely want to give myself credit for that because although it was hard work, I spent 3-4 days at a time just not eating and only consuming White Claws to keep me at baseline while I hung around the house and eventually hopped on the computer to spend the night on Call of Duty (that wasn’t that often, just a few week time frame, I did have a more healthy side to my diet than that). I enjoyed the dynamic of competition in video games because I didn’t have to physically compete (adding to my ever-so-growing laziness), I made deep connections with voices and personalities and not actual people in my real life that I can hang out with. I fell in love with computer-generated worlds and stories and wanted to be there more than in real life. I felt more satisfaction in achieving success in GTA than I did putting in the effort at any job because the paycheck was still going to be the same regardless. I feel like that's caused me to observe the world in a way where it's here for everybody else and that sometimes I just don't belong. Of course, though, my childhood had a huge playing role in why I am where I am today. I’m never sure of my next move, I’m usually unsure of my decisions and thoughts more often than being certain of the things I want and am after. My friends are all doing really well and seem to be about 10 years ahead of me in life. I don’t know how to structure my day, so in return, I don’t know if what I’m doing is enough or if I’m cutting myself short. I feel like all of my values are so out of whack and I want to take control of them. Unfortunately with gaming for so long and not having to physically apply myself, my brain became lazier over time, which caused me to just observe and not contribute (more so when I’d always watch movies and youtube through the years). I’m always way too critical of myself, I feel like I’m so far behind in life and it’s really uncomfortable and hard to come to grips with. It makes it uneasy for me to relax because I am confused and don’t know what career path to take, I feel that I need to have a genuine uninterrupted interest in something to be happy enough to truly pursue it with absolute drive. But I also grew up around siblings that are older than me and had a successful business that exposed me to a lifestyle of elevated living and dining with a careless mentality because I was in love with the life I had when I was with them, but I only saw the fun part of it and even though I spent a lot of time in the office spaces, I never really captured the perspective and idea that this lifestyle came from hard work and effort, and I didn’t witness the beginning years of the business and before when they were starting up because I was too young. Also, everybody moved away, my sister is in one southern state, one brother is in a western state, and my other brother is in the same state but we don’t really talk much anymore because of his own issues, unfortunately. Because I lived around enabling environments my whole life, it caused me to slip through the cracks and not get ahead like I was supposed to. I lived with my mother and sister for 19 years of my life. My mother was in a near-fatal car crash in her teens and suffered life-changing disabilities which caused her to become heavily addicted to pain medication and hard liquor. She couldn’t be there for me as much as she wanted because she gained a lot of weight over the years because of her addictions, she was in pain all the time and didn’t have the capacity to really be on my ass with school work and personal development like other parents did with their kids. And my sister wasn’t the most motivated person either, so that’s what I was surrounded by. My father was more of the one to push me academically, but my parents were separated and I only saw my father on the weekends. I just guess what I’m trying to say is I feel like I have all the right resources, but my scatter-brains prevent me from seeing a clear, direct path on how to take initiative. My memory recall is hit or miss, and when I see a new perspective that helps me better understand things, I lose it the next morning when I wake up, which can result in me feeling depressed because I can’t continue to operate in that same perspective. I’m not sure, but I think that causes me to not take the initiative with anything as a result, maybe I disguise that as being lazy. Also, my apologies for being all over the place, I guess since I was lazy with education, I never really learned how to structure my thoughts properly to formulate a coherent body of text. One last thing, I realize people tell me I’m way too in my head, which I agree about, but I can’t help it because my focus is so loose, my mind always takes over. How can I be more present, be a more active listener, and become much more aware of my surroundings?",
      "comments": {
        "best_comment": "PARAGRAPHS OP PARAGRAPHS\n\nHonestly though you’re probably better off than you think if you see the problems. Most people aren’t very self aware. Just put one foot in front of the other and don’t give up even when you have the inevitable setback or relapse.",
        "percentile_10_comment": "Video games can be harmful to professional development, yes. But it is also an emotional and social outlet. Not everyone needs to cut it entirely but I agree with the sentiment. Can be harmful and overused, like social media or the internet in general",
        "comment_gpt4o": "Hey there! First off, congrats on the weight loss—that's a huge achievement and shows you have the ability to make significant changes. It sounds like you're ready to take control of your life, and that's a great first step. Here are a few ideas to help you get started:\n\n1. **Start Small**: It can be overwhelming to think about changing everything at once. Pick one or two small habits to work on first. Maybe it's setting a consistent wake-up time or dedicating 30 minutes a day to learning something new.\n\n2. **Set Clear Goals**: Think about what you want to achieve in the short term and long term. Write these down and break them into actionable steps. This can help you focus and give you a sense of direction.\n\n3. **Create a Routine**: Structure can be incredibly helpful. Try to establish a daily routine that includes time for work, exercise, relaxation, and socializing. This can help you feel more grounded and in control.\n\n4. **Limit Gaming Time**: Since gaming has been a big part of your life, try setting specific times for it, so it doesn't take over your day. Use it as a reward after completing tasks.\n\n5. **Mindfulness and Presence**: Practice being present by engaging in activities that require focus, like meditation or even just mindful breathing exercises. This can help you become more aware of your surroundings and improve your focus.\n\n6. **Seek Support**: Don't hesitate to reach out to friends, family, or even a therapist. Having someone to talk to can provide encouragement and accountability.\n\nRemember, progress takes time, and it's okay to have setbacks. Celebrate your wins, no matter how small, and keep moving forward. You've got this!",
        "comment_gpt5_verbositylow_efforthigh": "First off: losing ~100 lbs is a huge deal. That proves you can execute. You’re not behind; you’re at the start of your next decade with proof you can change.\n\nDo a 30‑day reset to stabilize your brain and energy. Same wake time every day, no alcohol or weed for the month, 30 minutes of walking or lifting daily, three real meals with protein and water, and morning sunlight for a few minutes. Keep it boring and repeatable. This alone will calm the overthinking and make everything else easier.\n\nUse a simple daily template so you’re never guessing. Run the Rule of 3: one thing for Health, one for Money, one for Relationships. Do those before entertainment. Example: morning walk and quick lift, a 90‑minute “money block” for job search/skill study or side work, and one social touch like a call or in‑person class. Everything after that is optional, but the day is already a win.\n\nTo be more present and a better listener, anchor your attention with your body. Feel your feet on the floor, slow your exhale, and wait two seconds before replying. Then mirror back one sentence of what they said and ask one open question. Put your phone face‑down and out of reach during conversations. That tiny loop—notice breath, pause, summarize, follow‑up—will make you feel engaged fast.\n\nExternalize your thoughts so they stop looping. Every morning, do a 10‑minute brain dump in your notes and pick today’s Health/Money/Relationships actions. Every night, a 5‑minute check: what worked, what’s tomorrow’s first step. When you get a new perspective, write it as a one‑sentence rule and pin it. Re‑read your rules each morning for recall.\n\nSince competitive gaming hijacks your reward system, take 30–90 days off COD and pair it with the alcohol/weed break. Uninstall, log out, or put the console away. Replace the slot with physical competition or community—lifting with a plan, BJJ, rec sports, or a class. You’re keeping the competitive itch but making it pay you back.\n\nStop waiting for a perfect passion. Pick a useful, trainable lane and let skill create interest. Good options: IT help desk (CompTIA A+ or Google IT), a trade apprenticeship, CDL, HVAC, medical tech, or sales. Do a 12‑week sprint: every weekday, 90 minutes of study or applications, and track outputs. First goal is stable income and a reputation for reliability; optionality and pride follow.\n\nMake it visible. Put a calendar on the wall and X the days you hit your three. Do a Sunday 30‑minute reset to plan the next week. If depression is heavy, loop in a therapist or doctor; that’s a force multiplier, not a detour.\n\nDo this boring plan for 90 days and reassess. You already proved you can change; now make it sustainable and repeatable. You’ve got this."
      }
    },
    {
      "id": "t3_vpyfhz",
      "title": "[Need Advice] Strong pull toward inaction when it comes to doing unpleasant activities.",
      "body": "For example, cleaning my room or organizing. I'd legitimately rather stare blankly at the wall for an hour than get started on it. In fact I've done just that before.\n\nI realize it will ultimately come to \"just find a way to motivate yourself to do it or form a disciplined routine around it etc etc\" which is fine. But ideally I'd like to stop my mind from having that reaction to begin with. Is there any way to eliminate the pull toward doing nothing instead of something?",
      "comments": {
        "best_comment": "Here’s the thing - it’s totally normal. Procrastination is a reaction that’s stems from fear. So normally people talk about flight or fight but there’s also freeze, and that’s often how procrastination manifests. When you think of doing something, you avoid it or just get locked up. Your reaction toward something that sucks - is just your “lizard brain” reaction.\n\nOne of the big key pieces of overcoming it is being compassionate toward yourself. When you say I’m an idiot, I’m lazy, I’m scared, I’m a pussy, or any number of self-destructive things it makes the feeling worse because you then feel guilt or shame which makes you even more reluctant to do the task.\n\nSo here’s the tips:\n1. Show yourself compassion and say (either in your head or out loud-it’s up to you) I’m afraid, scared, anxious about this thing, whatever it is.\n2. Think of the positive aspects of your personality - you’re smart, capable, hard working, or whatever it is that you believe is good within you.\n3. Tell yourself it’s sucks but you can do it. Not necessarily that you believe in yourself or philosophically… but rather functionally that you are capable of the task - period. Telling yourself you can do but removing the emotionality of the task helps removes/reduce the emotional emotional aspects that causss anxiety, stress, etc.\n4. Just start. Tell yourself you’ll do it for 5 minutes. Make the goal small, quick, and not necessarily the entire thing you want to do. Putting on a distraction like tv or music can help - but avoid the internet or phone or something that’s likely to suck you in.\n5. When you hit five minutes you might either be like “thank god it’s over” or “I can keep going”. If you say “thank god, it’s over…” try to push through again by going back to the original steps. Show yourself self-compassion, tell yourself your strengths, tell yourself you’re more than capable, and just start again.\n\nEventually it becomes a habit - which is key to it and helps make it less of an obstacle in the future.",
        "percentile_10_comment": "I realised recently my messy room was a coping mechanism. I found it hard to clean up because a messy room was a barrier to entry when I was younger (nothing too sinister just a method of protecting my privacy) maybe you have a similar situation. How far back is your room messy and what did your childhood self feel about the mess",
        "comment_gpt4o": "I totally get where you're coming from. Tackling unpleasant tasks can feel like a huge mental hurdle. One trick that might help is the \"5-minute rule.\" Tell yourself you'll only work on the task for 5 minutes. Often, just starting is the hardest part, and once you're in motion, it's easier to keep going. Also, try to pair the task with something you enjoy, like listening to your favorite music or podcast. This can make the activity feel less daunting. Over time, these small changes can help shift your mindset and reduce that pull toward inaction. Good luck!",
        "comment_gpt5_verbositylow_efforthigh": "You probably won’t delete that “do nothing” pull, but you can train a faster counter‑reflex. Make a tiny, always‑the‑same start and pair it with a script. Example: first move = make the bed or pick up 10 items. If‑then = “If I catch myself staring/avoiding, I count 5‑4‑3‑2‑1, stand up, press play on a cleaning playlist/podcast, start a 3‑minute timer, and do the tiny move.” Keep tools visible so there’s no friction (trash bag, hamper, caddy). Stop when the timer ends; extra time is bonus. Anchor it to a daily cue (after breakfast or before dinner) and mark an X on a calendar.\n\nGive it 1–2 weeks. Your brain will start predicting “short, bounded, paired with something enjoyable” instead of “endless chore,” and the pull to do nothing fades. You don’t have to like it—just run the script."
      }
    },
    {
      "id": "t3_124xh6v",
      "title": "can a 37 yo man change his life? [need advice]",
      "body": " so i only have 1.25 US dollars to spend on food today, i cant afford anything else. How did i let my life go to the trash can like this? can i change it now? im certainly gonna try...",
      "comments": {
        "best_comment": "Some people only live to 50 years old. \n\nBut what if you live to 87? You could live as if today is your first day. \n\nThat's something I tell myself when I get overwhelmed with decisions I've made or my circumstances. \n\nLike others have said here, connect with social services, reach out to friends and family for help, be genuinely thankful for any generosity you receive to those who share it with you. \n\nYou can find a job, find purpose and be a blessing to others. It's certainly not too late!! You can look back one day on this time and thank the 37 year old you for making some good decisions. One day at a time, and try to find inner peace along the journey. You got this!!",
        "percentile_10_comment": "You can do absolutely anything amigo.  The only limit is your mind.    \nYou have some inertia to overcome. \nBut,  If you commit to your dream more than your nightmare you can bring it to life 🙏🏼🔥",
        "comment_gpt4o": "Absolutely, a 37-year-old can change his life! It's great that you're ready to try. Start by focusing on small, manageable steps. With $1.25, consider buying ingredients like rice, beans, or oats, which are filling and nutritious. For long-term change, look into local food banks or community resources that might offer support. Building discipline starts with setting small, achievable goals. Try to establish a daily routine, even if it's just waking up at the same time each day or dedicating 10 minutes to a new skill or job search. Remember, change is a gradual process, and every small step counts. Keep pushing forward, and don't hesitate to reach out for support when you need it. You've got this!",
        "comment_gpt5_verbositylow_efforthigh": "Yes—people rebuild in their 30s and 40s all the time. Start with two tracks: today’s survival and a tiny daily routine you won’t skip.\n\nToday: stretch the $1.25 on calories (ramen and a banana, or a small bag of rice/beans at Dollar Tree if there’s one). Also hit free options: call 211 right now for nearby food pantries/soup kitchens; search “community fridge + your city”; check churches. Use the library for internet and ask about local aid; apply for SNAP/EBT online there.\n\nMake a non-negotiable checklist: 30 minutes on income (temp agency or day-labor center first thing, plus applications on Indeed/Snagajob or asking three places in person), 20 minutes walking or bodyweight work, 10 minutes cleaning, and a one-sentence journal with a spending log. Put an X on a page each day and don’t break the chain.\n\nIncome first: be at a temp agency at opening; they often place same-day warehouse, dishwashing, or moving gigs. Goodwill and shelters have job centers and can help with IDs, resumes, and clothes. Set a daily application quota and no non-essential spending until you’ve built a small cushion.\n\nWhen cash starts coming in, buy cheap staples (rice, oats, beans, eggs, peanut butter, frozen veg) and cook once a day. Run the checklist for 30 days. Small, boring wins compound. You can change this—start with the next hour."
      }
    },
    {
      "id": "t3_vx6uct",
      "title": "[Need Advice] I just turned 31 and my life is a *huge* mess.",
      "body": "Hey guys\n\nI’m a 31-year-old man and I’ve reached a point where I’m at my wit’s end and I just don’t know what’s wrong with me or what to do.\n\nI’m just going to list the big issues in my life and hope that someone can offer up some advice. Here goes:\n\n* **I’ve never been able to finish a degree.**  \n\n   * I’ve started and dropped out of three courses since I was 18.\n   * I’ve finally made it through \\*most\\* of a law degree. I have just 6 months remaining (after taking a 2-year break) but cannot bring myself to study AT ALL.\n* **I constantly feel exhausted and low in energy.**  \n\n   * I’ve felt “sluggish” my whole life. I process information and learn slowly, I’ve never been able to just get sh\\*t done.\n   * I have serious sleep issues and can rarely fall asleep before 3am.\n   * Even when I can get a decent sleep, I wake up feeling unrefreshed.\n   * My weight has fluctuated a fair bit my whole life. I'm pretty fat now and despite eating very healthy I can't lose any weight this time.\n   * I’ve been diagnosed with ADHD and I’ve been trying different meds for almost 2 years but nothing has made a difference.\n* **Zero motivation**:  \n\n   * I have a full-time job (I’m studying part-time) and I constantly feel on the verge of being fired because I’m hopeless at deadlines and have no motivation to do the work they pay me to do.\n   * I have big dreams but just feel too lazy to achieve anything. I want to do well and meet my goals so much, but something is holding me back and I just feel paralysed.\n* **I feel socially weird**  \n\n   * Work meetings, for example, are a huge source of anxiety - even though people seem to think I’m normal and outgoing. I have the same issues with attending classes.\n* **I constantly feel like the dumbest person in the room**  \n\n   * I have a reputation got being smart and everyone seems to think I’m smart, but I feel like I’ve just fooled everyone because, to be honest, I feel like I don’t understand things 99% of the time.\n* **My apartment and my finances are a f\\*\\*king mess**. My bedroom is disgusting (to the point of being unsanitary) and I have debt collectors after me.\n\n**TL;DR:**\n\nFor a grown who is seen by most people as intelligent, together and competent, my life is secretly a damn mess. I’m always tired and have zero motivation to do anything. Please help me!\n\nThanks so much :)",
      "comments": {
        "best_comment": "Hey, congratulations for expressing yourself, you can be proud of you. That's not an easy thing to do. In my opinion, you lack of self-esteem and self-confidence. Only you can know why and how to improve it. You'll find what's best for you. To know what's best, you have to compare, in order to compare, you have to try different things. Pick what works for you, leave what doesn't. \n\nBut remember that you become what you do, only actions are effective. And if you feel like not having the will power to try something you have never tried, it's either you evolve trying, or you remain the same. But you can't expect different results by repeating the same actions. \n\nIt's gonna be a beautiful journey, don't lose faith in yourself. We all have deamons to fight, keep grinding, keep shining. Peace",
        "percentile_10_comment": "I feel like getting to the heart of your sleep problems will help a lot with almost everything else on this list? Like if you can, find some way to access a sleep specialist, spend some money on it if you can, really try to get a decent sleep schedule. Try everything you can, this matters a lot. \n\nSleep is so so so important for physical and mental health. It won't magically fix everything, but I feel like it's a good first step.",
        "comment_gpt4o": "Hey there! First off, it's great that you're reaching out for advice—acknowledging where you are is a big step. It sounds like you're juggling a lot, and it's understandable to feel overwhelmed. Here are a few ideas that might help:\n\n1. **Break it down**: For your law degree, try breaking your study sessions into smaller, manageable chunks. Even 15-30 minutes a day can make a difference. Use a timer and commit to just that short period. Often, starting is the hardest part.\n\n2. **Sleep and energy**: Since sleep is a big issue, consider creating a bedtime routine to help signal your body it's time to wind down. This could be as simple as dimming the lights, reading a book, or doing some light stretching. Also, check in with your doctor about your sleep and energy levels—there might be underlying issues that need addressing.\n\n3. **ADHD management**: Keep working with your healthcare provider on finding the right medication or therapy. In the meantime, try using tools like planners or apps to help manage tasks and deadlines. Breaking tasks into smaller steps can also help with motivation.\n\n4. **Social anxiety**: Practice makes progress. Try to gradually expose yourself to social situations, starting with low-pressure environments. Remember, most people are more focused on themselves than on judging you.\n\n5. **Tidy up**: For your apartment, set a timer for 10 minutes each day to tackle one small area. It’s amazing how much you can accomplish in short bursts, and it can help reduce the overwhelm.\n\n6. **Finances**: Consider reaching out to a financial advisor or using budgeting apps to get a handle on your finances. They can help you create a plan to tackle debt and manage expenses.\n\nRemember, progress is progress, no matter how small. Be kind to yourself and celebrate the little wins along the way. You've got this!",
        "comment_gpt5_verbositylow_efforthigh": "You’re not broken, you’re overloaded. Build scaffolding and let the system carry you for a bit. Here’s a simple 6–8 week reset that has helped a lot of people in your spot.\n\nEnergy first. Pick a fixed wake time and protect it every day for two weeks. Get outside light within 30 minutes of waking for 10–15 minutes. Cut caffeine 8+ hours before bed, park your phone outside the bedroom, and do a 20–30 minute wind‑down routine. Given the weight and unrefreshing sleep, ask your doctor for a sleep study and basic labs (iron/ferritin, thyroid, B12, vitamin D, testosterone). Untreated sleep issues make ADHD meds feel useless.\n\nDaily structure next. Run three non‑negotiable blocks on weekdays: a 60–90 minute “deep work” block for the top job task due soonest, a 60 minute law block, and a 15–20 minute home reset. Use timers (25/5), put your phone in another room, and body‑double (Focusmate, library, study buddy). Adopt the “just five minutes” rule to start—momentum does the rest.\n\nStabilize your job. Each morning, send your manager a short plan for the day; each afternoon, send what you finished and what’s next. Ask for micro‑deadlines and early check‑ins. Break work into visible deliverables and aim to deliver something by 3 p.m. every day.\n\nFinish or formally pause the degree—don’t linger. Book a meeting with your advisor this week. Map the remaining modules and pick exam/assignment dates. Schedule your daily 60 minute law block at the same time, in the same place, with body‑doubling. Keep a visible checklist and cross off one concrete output per day.\n\nClean up money with one focused session. Make a complete list of debts and due dates, call each creditor, and set small autopays/payment plans. Freeze unnecessary cards and open a separate “bills” account so fixed expenses are paid first. Open every envelope and put all due dates on a single calendar.\n\nTame the apartment with a nightly 15‑minute reset—trash, dishes, laundry in that order. Do one 60–90 minute weekend “reset” for floors, bathroom, and bedding. If it’s truly unsanitary, hire a one‑time cleaner to jump‑start momentum; then maintain with the nightly reset.\n\nFor meetings/class anxiety, prep one sentence you’ll say and one question you can ask. Speak early to reduce anticipatory anxiety. It reads as engaged, not awkward.\n\nTwo‑week starter challenge: fixed wake time + morning light, one 60 minute law block daily, one 15 minute home reset nightly, and daily manager check‑ins. Don’t chase motivation—chase starts and finishes. Stack small wins; the fog lifts faster than you think."
      }
    },
    {
      "id": "t3_ow4ft3",
      "title": "[need advice] I don’t know what to do after I get out of bed",
      "body": "I can get out of bed sure but I don’t have anything to do I’m on summer vacation I’m 15, but I have barely any responsibilities all I do is workout, do a few quick chores and off I’m scrolling on YouTube I listen to music as a hobby but i want more hobbies I just get up late because I don’t have much to do help",
      "comments": {
        "best_comment": "Maybe try to add a couple hobbies to spend 30-60min every day on? Read a book. Maybe learn the guitar or keyboard or another  language. Take a bike ride or run/walk every day. Try woodworking or building things. Offer yard or car washing services in your area to make some $. Just some ideas :)",
        "percentile_10_comment": "Since you're in high school try volunteering at local areas, it helps with colleges and keeps you active",
        "comment_gpt4o": "Hey there! It’s awesome that you’re looking to make the most of your summer. Since you’re already working out and doing chores, you’ve got a good start. Here are a few ideas to fill your day with more activities:\n\n1. **Learn Something New**: Pick up a new skill or hobby. You could try learning a musical instrument, coding, drawing, or even cooking. There are tons of free resources online to get you started.\n\n2. **Set Small Goals**: Try setting daily or weekly goals for yourself. It could be reading a book, writing a short story, or completing a puzzle. Having something to work towards can give your day more structure.\n\n3. **Volunteer**: Look for local volunteer opportunities. It’s a great way to meet new people, gain experience, and make a positive impact in your community.\n\n4. **Explore Nature**: If you can, spend some time outdoors. Go for a walk, hike, or bike ride. It’s a great way to clear your mind and get some fresh air.\n\n5. **Create a Routine**: Even if you don’t have a lot of responsibilities, having a routine can help you feel more productive. Try waking up at the same time each day and planning out your activities.\n\nRemember, it’s all about experimenting and finding what you enjoy. Good luck, and have fun exploring new things!",
        "comment_gpt5_verbositylow_efforthigh": "Summer with no structure = default to scrolling. Fix the structure. Tonight, decide exactly what happens after you stand up and do it before any phone. Put your phone outside your room. Alarm goes off → water, open blinds, 10–20 min walk for sunlight, breakfast, then 30–60 min on a skill.\n\nPick one or two summer projects with clear outputs. Examples: make 6 beats in GarageBand/FL Studio (one per week), finish freeCodeCamp’s first module, 30 daily sketches, learn to cook 4 meals and make dinner twice a week, read 3 books, learn 300 words in a new language. Do a minimum daily—30 minutes is plenty—and track it on paper.\n\nTimebox YouTube so it’s not the default. Set Screen Time/AppBlock/LeechBlock limits and only watch during a set window (e.g., 4–6 pm). No-phone mornings until your “move, make, learn” block is done.\n\nMake a simple day template: morning block, chores, workout, lunch, hobby/social/outdoors, YouTube window, then evening chill/reading. Write 3 must-do’s for tomorrow on an index card before bed and lay out what you need so it’s frictionless.\n\nIf you want more to do, add one thing that gets you around people: volunteer at the library/shelter, ref youth sports, mow lawns, or a part-time gig if allowed. Start tomorrow with a 5-minute version of the plan to break inertia, then stretch it. Consistency > marathon days."
      }
    },
    {
      "id": "t3_xdxiuz",
      "title": "[Need advice] Has anyone successfully overcome or managed a schema against self-discipline?",
      "body": "Turns out I'm not just lazy, it's not just my ADHD, it's not just that I was spoiled, I've got some sort of childhood-induced massive aversion to discipline as a concept, from within or without. We're talking beyond attitude and effort and willpower. It's cost me every job and hobby I've ever had and it's cost me the love of my life. \n\nAs soon as anything I do requires discipline to accomplish, the wall goes up and gets taller every day. I've been a game developer for a decade and I've never finished a game. I've been playing musical instruments and singing my entire life but I've never managed to learn sheet music or any scales or arpeggios on anything. Believe me I have tried. The trying never lasts long enough. The shame is overwhelming.\n\nI'm sick of not being good at anything. I'm sick of this abstract baseless fear ruling my life. How the fuck am I supposed to overcome a discipline aversion without discipline?! Has anyone conquered something this deeply rooted? What steps did you take?",
      "comments": {
        "best_comment": "I looked at how my life was going and instead of getting angry or resentful, I got motivated. I self-started motivation to build discipline, since the former will eventually give out and die as time goes on — as you seem to well know. \n\nI set my sights on smaller goals, rather than large ones like writing a book, earning a certification, fixing everything wrong with my house. I started small. I committed to studying every day for at least an hour. I committed to journaling every morning, writing something reflective, no matter how long it was. I committed to completing simple steps of my projects when I had the time. I committed to reading one chapter of a book per day instead of gaming my free time away. \n\nNow, I have the discipline to get up early and journal. I finished a novel and started the second one. My house to-do list is more limited by money than by my discipline and motivation. I’m closing in on a certification, after which I will seek another one.\n\nI struggle with ADHD and a natural laziness. I hate getting up early. I’d much rather play video games than study. The task of writing a novel is monumental and I don’t really want to do it all again (despite wanting to finish my story). I’d rather not work at all. Discipline aversion isn’t unique to you. Some people deal with it, but you can overcome it. Gamify it if you must; I didn’t find it particularly motivating, but I know many do. \n\nYou need to set small goals and remind yourself of them constantly. Accomplishing these small goals will build confidence, which inspires motivation, which is how you build discipline. That’s how I overcame the problem you’re having.",
        "percentile_10_comment": "The shame needs to be addressed. If shame is your motivator, it won't last. If hope is your motivator, it will. \n\nA big thing with ADHD (I have it too) is that your likely to get distracted, so stop and start tasks. If you get distracted, notice the task again and feel overwhelming shame it's hugely painful, so you avoid that feeling, therefore avoiding the task. Working through that shame, so that your able to notice the thing you forgot and just go \"oh, I did want to finish that\", that's the game changer. \n\nIt needs to be ok that you stopped the task. (Which, spoiler, it is)\n\nSocietal ways of dealing with someone (both yourself and others) forgetful or easily distracted tend to involve making the person \"care\" enough about it, which means feel so bad about it you'll never do it again. You ever had that lector from yourself or others? This doesn't work in the long run and takes a LOT of dedication and time to overcome. \n\nIt's not that you don't care, it's that you're wired to be distracted and forgetful. Just have to restart a few times, and that's ok.",
        "comment_gpt4o": "Hey there! It sounds like you're dealing with a pretty tough challenge, but the fact that you're reaching out for advice is a great first step. Overcoming a deep-rooted aversion to discipline can be tricky, but it's definitely possible with some patience and strategy.\n\nFirst, try to reframe how you view discipline. Instead of seeing it as a rigid, external force, think of it as a tool that helps you achieve what you truly want. Start small—pick one tiny habit that you can incorporate into your daily routine. It could be as simple as playing an instrument for just 5 minutes a day or jotting down a few game ideas. The key is consistency, not intensity.\n\nAlso, consider breaking down your larger goals into smaller, manageable tasks. This can make them feel less overwhelming and more achievable. Celebrate small wins to build momentum and confidence.\n\nIt might also help to find a community or accountability partner who shares your interests. Having someone to share progress with can make the journey feel less isolating and more motivating.\n\nLastly, don't be too hard on yourself. Progress isn't always linear, and setbacks are part of the process. Keep experimenting with what works for you, and remember that every small step forward is a victory. You've got this!",
        "comment_gpt5_verbositylow_efforthigh": "Yes—people do climb out of this. You don’t beat an aversion with more willpower; you design around it so “discipline” isn’t required.\n\n- Replace “discipline” with “ritual.” Anchor a 3–5 minute starter to a cue: after coffee, open the IDE and set a 5‑minute timer; or tune the instrument and play one slow scale. Hard stop when the timer ends. The stop rule prevents the wall.\n- Define tiny “done.” Game dev: one‑week toy with a title screen, one mechanic, win/lose, build, README. Music: one clean C‑major scale and one page of sight‑reading. Ship/record it, even if ugly.\n- Body double. Book Focusmate or co‑work with a friend daily. Goal is showing up, not long blocks.\n- External deadlines. Weekly lesson, game jam, open mic. Put money or reputation on the line so the schedule, not mood, runs the show.\n- Reduce friction. Instrument on a stand, IDE opens to the right file on boot, block distracting sites, prep water/snacks. Make the first 30 seconds effortless.\n- Track inputs, not streaks or outcomes. Checklist: opened editor? 1 point. 10 minutes? bonus point. Weekly build/recording posted? star. If you miss, clean slate—no penalties.\n- Progressive overload. Only add 2–5 minutes or one extra rep after 1–2 weeks of “too easy.” If it breaks, step back.\n- Rename the trigger. Call it “defaults,” “maintenance,” or “rituals.” Labels matter less than friction and rewards.\n- If possible, work with an ADHD coach or therapist (schema/ACT). They’ll help set micro‑commitments and defang the trigger.\n\nExample 30‑day start: Weekdays at 9:30, 10‑minute Focusmate; open your smallest prototype, make one ugly commit; stop. Fridays, cut a build and post it. Before dinner, 5 minutes: tune + one scale. After two weeks, add 5 minutes only if it feels easy.\n\nYou overcome an aversion by making the start inevitable and the finish tiny. Consistency comes from design, not heroics."
      }
    }
  ]
}